[
  {
    "companyName": "Lime",
    "externalUrl": "https://ca.linkedin.com/jobs/view/senior-android-engineer-at-lime-4142971080?position=9&pageNum=0&refId=5B8GvfrjvUegKNLbhbUsyg%3D%3D&trackingId=4OE4o6vH1yc0llAzvFCFAg%3D%3D",
    "description": "Lime is the world's largest shared electric vehicle company. We’re on a mission to build a future where transportation is shared, affordable and carbon-free. Our electric bikes and scooters have powered 700+ million rides in 250+ cities on 5 continents, replacing an estimated 150+ million car trips. Named a Time 100 Most Influential Company and Fast Company Brand That Matters, Lime continues to set the pace for shared micromobility globally.  \n  \nWe are looking for an experienced Android Engineer to join our team and help us revolutionize the way people move around cities. As a key member of our team, you’ll have the opportunity to design and build the core technology that powers our fleet of connected vehicles. With our rapid global expansion, you’ll play a vital role in crafting backend systems that can process boatloads of requests from our IoT devices and consumer-facing apps. You will also have the chance to improve our suite of operational tools that enable our distributed workforce to charge, deploy, and maintain our electric vehicles. And the best part? You get an opportunity to work with a talented group of engineers, data scientists, designers and PMs who are passionate about creating innovative solutions for urban transportation!  \n  \n**What You'll Do:**  \n  \n\n-   Identify, define, and solve strategically essential technical problems, including architecting and building highly scalable foundational platforms, leading new product initiatives, and revamping core application experiences\n-   Scrutinize and reason clearly about the technology and architecture choices we make. In many cases, you will be the decider of these decisions\n-   Lead the cross-functional collaboration with PMs, Engineers, Design, Data Scientists, Research, and Operations teams\n-   Mentor and lead other engineers on the team. Identify and develop future leaders\n-   Advise Lime’s leadership team on key technology adoption and process improvements\n-   Contribute to shaping overall engineering culture at the company\n\n**About You:**  \n  \n\n-   6+ years of industry professional software development experience, and a track record of building impactful products or systems\n-   Strong background and proven leadership in mobile development\n-   Dynamic, driven and hands-on, yet capable to multitask across functions\n-   Experience with mobile testing frameworks and services\n-   iOS development experience. (bonus)\n-   Passionate. You’re passionate about Lime's mission and micro mobility; you want to see cities transform to becoming people-centric and less polluted\n\nAnnual performance bonus, equity and benefits may be provided as part of the compensation package, depending on the position offered. Not all candidates will be eligible for the upper end of the salary range. Exact salary will ultimately depend on multiple factors, which may include the candidate’s location of residence, the successful candidate's skills, experience and other qualifications. In addition to base salary, some roles may be eligible for a variable performance-bonus based on a combination of company performance, employee performance, and management discretion.  \n  \n**Why Lime?**  \n  \nWhen you join Lime, you join a global community of smart, caring, talented individuals working together to deliver world-changing results; striving to create an experience that enables Limers to do their best work. Here are some ways we support and invest in our team:  \n  \nCompetitive salaries, performance-based annual bonus and pre-IPO equity  \n  \nHealth and wellness offerings for all team members starting day one including access to top-tier fitness and mindfulness apps  \n  \nFlexible vacation policies with ample paid holidays tailored to country of residence  \n  \nFully-paid leave following the birth or adoption of a child and financial, medical and educational support for Limers pursuing parenthood  \n  \nSupport for retirement and financial goals with unlimited access to financial advisors  \n  \nUnlimited, complimentary use of our vehicles in hundreds of cities around the world  \n  \nProfessional growth opportunities through quarterly learning days and top-tier tools  \n  \nOpportunities to connect across teams and locations to network, socialize and volunteer  \n  \nCulture of belonging with Employee Resource Groups that engage and promote cultural awareness and DEI training across all functions  \n  \nConsistent recognition of great work through meaningful rewards and career advancements  \n  \nBenefits and perks vary depending on the nature of your employment and country of residence. Terms and conditions may apply.  \n  \nIf you want to make an impact, Lime is the place for you. Not sure if you meet all the qualifications? If this role excites you we encourage you to apply. Explore all opportunities on our career page.  \n  \nLime is an Equal Opportunity Employer, but that’s just the start. We believe different perspectives help us grow and achieve more. That’s why we’re dedicated to hiring and developing the most talented and globally diverse team – which includes individuals with different backgrounds, abilities, identities and experiences. Applicants who require a reasonable accommodation for any part of the application or hiring process can email recruiting-operations@li.me for assistance.  \n  \nUse of artificial intelligence or an LLM such as ChatGPT during the interview process will be grounds for rejection of your application."
  },
  {
    "companyName": "Snoonu",
    "externalUrl": "https://qa.linkedin.com/jobs/view/senior-mobile-engineer-android-at-snoonu-4114815251?position=34&pageNum=0&refId=5B8GvfrjvUegKNLbhbUsyg%3D%3D&trackingId=N1lGobKSSRjKWbvzAiJV1A%3D%3D",
    "description": "**A Little Bit About Us!**\n\n  \n\nAt Snoonu, we believe that technology has the power to make anything possible.\n\n  \n\n**Our Vision:** To be the first Qatari Super App that propels the region and its community through innovation and technology. We envision a global expansion where what we do surpasses norms and limitations every time.\n\n  \n\n**Our Mission:** To radically transform how people live by leveraging technology to connect them with endless possibilities.\n\n  \n\n**Values We Live By**\n\n  \n\n-   **Be Customer Obsessed:** “Focus on the customer and all else will follow.”\n-   **Act with Integrity:** “We are honest, ethical, and trustworthy in everything we do.”\n-   **Be Curious and Creative:** “We constantly innovate and create solutions to bring a lasting positive impact.”\n-   **Lead by Example and Take Ownership:** “Be the change you want to see and take ownership.”\n-   **Work Smart and Deliver Results:** “You can do more by doing less, better, and faster.”\n-   **It's All About People:** “Be a team player; together we are stronger.”\n\n  \n\n**What you'll need to apply:**\n\n-   3+ years of experience in native(using Java/Kotlin) android development\n-   Understanding of base Java/Kotlin principles and tools such as standard collections, multithreading, garbage collection\n-   Production-level experience with kotlin coroutines\n-   Production-level experience with dependency injection\n-   Production-level experience with androidx libraries for UI such as Navigation, RecyclerView, ConstraintLayout\n-   Production-level experience in creating custom views\n-   Understanding Clean Architecture and MVVM\n-   Understanding of http protocol\n-   Experience with git and git flow like process\n-   Intermediate english - you have enough language level if you can read this vacancy description and tell about your working experience without a dictionary\n\n  \n\n**Nice to have:**\n\n-   Experience with android animations framework - with things like Value/Object animator, transition framework, MotionLayout\n-   Experience with adapter delegates\n-   Experience in writing unit tests\n-   Experience with room\n-   Experience with kotlin multiplatform\n-   Experience with Compose including Compose Multiplatform\n-   Experience with trunk based development\n\n  \n\n**What you'll do:**\n\n-   Create new features in product teams or technical teams - we have both types of positions and we will discuss them during the interview process\n-   Take part in project technical backlog planning and development\n-   Work using scrum-like process, quickly evolving with all team members feedback\n-   Use english in your every day communications\n-   Make and feel your value for product development\n\n  \n\n**About our project:**\n\n-   100% written in kotlin\n-   Multi-module\n-   Using kotlin multiplatform\n-   Using compose on android side, experimenting with compose multiplatform\n-   minSdk = 28 (Android 9+) - minimum version is updated or regular basics"
  },
  {
    "companyName": "Devtech",
    "externalUrl": "https://rs.linkedin.com/jobs/view/senior-android-developer-at-devtech-4139661174?position=1&pageNum=0&refId=PokO8KwkoDpNkQvGGGvpvQ%3D%3D&trackingId=KBrjybIEfC6QnC4HmV7%2F3Q%3D%3D",
    "description": "**About Us**  \n  \nDevtech provides digital innovation services that help Fortune 1000 and emerging companies transform, scale and disrupt. We partner with our clients to envision and develop next-gen digital and cloud solutions that drive impactful business outcomes through people and technology.  \n  \nOur mission is to empower every innovative business in the world to do what they do best,_even better_.  \n  \nFounded in 2012, Devtech successfully bootstrapped the business for many years before securing institutional growth capital in 2022 and 2024 to fuel our next stages of growth. We are a team of over 300 professionals across Europe and North America, and our continued growth is a testament to the quality of work our teams produce.  \n  \nAt Devtech, we’re fostering an environment ofautonomy, mastery, and purpose, where our team members can grow and thrive. As we continue to scale globally, we're excited to welcome new team members who share our curiosity and growth mindset, and are ready to make an impact!  \n  \n**What You’ll Do**  \n  \nAs a member of the Global Services Unit, you will be a part of a creative team responsible for all aspects of the ongoing software development from the initial specification, through to developing, testing, and launching. Your focus will be to develop dynamic mobile applications to a high standard, in a timely and scalable way that improves the code in meaningful ways. Also, as Devtech is focused on learning and development, it will be expected that you take active participation in company-wide knowledge-sharing efforts, and promotion of security, quality, and knowledge-sharing culture across the company. Creatively solving problems from the big picture to the nuts and bolts.  \n  \n\n-   Create and maintain high-quality Android applications using Java and Kotlin\n-   Design and implement user interfaces following Android design principles, patterns, and best practices\n-   Connect applications to back-end services using RESTful APIs\n-   Enhance application performance, focusing on memory, CPU, GPU, and battery optimization\n-   Implement and manage offline databases like SQLite, Realm, and Room to ensure data persistence and availability\n-   Continuously learn and adapt to new Android technologies, frameworks, and best practices to keep applications current and efficient\n\n**What you’ll need**  \n  \n\n-   5+ years of demonstrated professional experience in mobile development\n-   Extensive knowledge of Object-Oriented Programming (OOP) with Java and/or Kotlin\n-   In-depth understanding of the Android SDK, including UI design principles, patterns, and best practices\n-   Experience with NDK development using C/C++ is a plus\n-   Familiarity with RESTful APIs to connect Android applications to back-end services\n-   Experience with offline databases such as SQLite, Realm, and Room\n-   Strong understanding of threading, multithreading, and optimizing performance for memory, CPU, GPU, and Battery performance optimization\n-   Solid grasp of networking concepts, including Subnet, VPN, IPSEC, SSL, and DNS\n-   Experience in designing, developing, and implementing enterprise-level applications\n-   Proficiencyin using code versioning tools, particularly GIT\n-   Excellent verbal and written communication skills in English\n\n**What we offer**  \n  \n\n-   Development program (training & conferences, internal knowledge sharing)\n-   Outstanding referral bonuses\n-   Private health insurance and 100% paid sick leave\n-   25 days of vacation\n-   Paternity leave – 15 days for new dads\n-   Reduced working hours for the first month after returning from maternity leave\n-   Mental health program\n-   English language courses\n-   FitPass\n\nPowered by JazzHR  \n  \nTuqvSvu9Mk"
  },
  {
    "companyName": "Bharat SEO",
    "externalUrl": "https://in.linkedin.com/jobs/view/mobile-application-developer-at-bharat-seo-4139893337?position=51&pageNum=0&refId=TwTtKiHJ7rbjceepYOGJRQ%3D%3D&trackingId=opU1EEH%2FFQ26C5%2F5gSlSWg%3D%3D",
    "description": "**Skills:**  \nSwift, Kotlin, Flutter, React Native, Android SDK, Xcode, Firebase, RESTful APIs,  \n  \n**Company Overview**  \n  \nAUXIDANE India Private Limited, headquartered in Gurgaon, specializes in innovative advertising solutions such as indoor and outdoor LED displays and 3D hologram fans. Our dynamic team of 11-50 employees is dedicated to elevating advertising experiences to new dimensions. Visit us at www.auxidane.in to learn more about our cutting-edge services.  \n  \n**Job Overview**  \n  \nWe are seeking a talented Mobile Application Developer to join our team in Gurgaon. This is a full-time, mid-level position requiring a minimum of 4 years and a maximum of 6 years of work experience. The ideal candidate will be skilled in developing cross-platform applications and have a strong understanding of both Android and iOS development environments.  \n  \n**Qualifications And Skills**  \n  \n\n-   Proven experience of at least 4 years in developing mobile applications using Swift and Kotlin.\n-   Solid experience with Full Stack development, Flutter, and React Native for building cross-platform applications.\n-   Proficiency in using Android SDK and Xcode to craft responsive and resilient mobile apps.\n-   Hands-on experience with Firebase and integrating various Firebase services into applications.\n-   Strong understanding and implementation experience with RESTful APIs for seamless communication with back-end services.\n-   Ability to write clean, maintainable, and efficient code while following industry best practices.\n-   Excellent problem-solving skills to address any challenges that arise during app development.\n-   Must stay updated with the latest industry trends and technologies to ensure our apps are modern and competitive.\n\n**Roles And Responsibilities**  \n  \n\n-   Develop and maintain robust and scalable mobile applications for both iOS and Android platforms.\n-   Collaborate with cross-functional teams to define, design, and ship new features timely and efficiently.\n-   Ensure the performance, quality, and responsiveness of applications through rigorous testing and optimization.\n-   Identify and resolve bottlenecks and bugs, and maintain applications to ensure functionality aligns with business and design requirements.\n-   Work alongside UI/UX designers to ensure accurate implementation of design into application interfaces.\n-   Continuously discover, evaluate, and implement new technologies to maximize development efficiency.\n-   Participate in code reviews to maintain high-quality code standards across the team.\n-   Provide technical guidance and mentorship to junior developers as necessary."
  },
  {
    "companyName": "Data Voyage",
    "externalUrl": "https://in.linkedin.com/jobs/view/application-developer-at-data-voyage-4141549110?position=57&pageNum=0&refId=9XemJIaxrm9U3qFPFszIqg%3D%3D&trackingId=pt03VA0zlzyZnhNO9Q14Ww%3D%3D",
    "description": "Are you passionate about **building innovative mobile and web applications**? Do you thrive in a **remote, fast-paced environment** where your work directly impacts users? Join **Data Voyage** and help us develop cutting-edge digital solutions!\n\n📍 **Location:** Remote\n\n💼 **Employment Type:** Full-Time\n\n**🔹 What You’ll Do:**\n\n✅ Design, develop, and maintain **mobile (iOS/Android) and web applications**\n\n✅ Work with **cross-platform frameworks (Flutter, React Native) or native development (Swift, Kotlin)**\n\n✅ Implement **secure and scalable APIs, databases, and backend integrations**\n\n✅ Optimize applications for **performance, responsiveness, and scalability**\n\n✅ Collaborate with **UI/UX designers, product managers, and developers** to refine user experience\n\n✅ Debug, test, and deploy updates using **CI/CD pipelines**\n\n**🔹 What We’re Looking For:**\n\n🔹 Proficiency in **Flutter, React Native, Swift, Kotlin, or JavaScript frameworks**\n\n🔹 Experience with **RESTful APIs, Firebase, GraphQL, or cloud-based services**\n\n🔹 Knowledge of **database management (SQL, MongoDB, Firebase, etc.)**\n\n🔹 Strong understanding of **UI/UX principles and responsive design**\n\n🔹 Ability to work **independently in a remote environment**\n\n**✨ Why Join Data Voyage?**\n\n📱 **Exciting projects** in app development, AI, and digital solutions\n\n🌍 **Fully Remote** – Work from anywhere!\n\n💰 **Competitive salary & project-based incentives**\n\n📈 **Career growth opportunities in tech development**\n\n🤝 **Collaborate with a talented global team**\n\n📩 **Interested? Apply now!**\n\n#AppDeveloper #MobileDevelopment #Hiring #RemoteWork #Flutter #ReactNative #iOS #Android #DataVoyage"
  },
  {
    "companyName": "OpenText",
    "externalUrl": "https://in.linkedin.com/jobs/view/sr-software-engineer-at-opentext-4138515172?position=10&pageNum=10&refId=qQHrC1TvgQ8%2BFkYh9WIk1Q%3D%3D&trackingId=4tUfDJBH5twn%2BhLZBGPsrA%3D%3D",
    "description": "**OPENTEXT**  \n  \nOpenText is a global leader in information management, where innovation, creativity, and collaboration are the key components of our corporate culture. As a member of our team, you will have the opportunity to partner with the most highly regarded companies in the world, tackle complex issues, and contribute to projects that shape the future of digital transformation.  \n  \n**OpenText**  \n  \nOpenText is a global leader in information management, where innovation, creativity, and collaboration are the key components of our corporate culture. As a member of our team, you will have the opportunity to partner with the most highly regarded companies in the world, tackle complex issues, and contribute to projects that shape the future of digital transformation.  \n  \n**Your Impact**  \n  \nThe OpenText UFT Family of integrated functional testing solutions enables customers to test earlier and faster by delivering AI-driven test automation across an unparalleled range of technologies; on the most popular browsers, mobile devices, operating systems, and form-factors; from the cloud or on-premises; to deliver the speed and resiliency required to achieve automation at scale that is tightly integrated with an organization’s current ADM/DevOps toolchain.  \n  \n**What The Role Offers**  \n  \n\n-   Responsible for leading the development and maintenance of cross-platform mobile applications, Take proactive approach to anticipate issues and provide solutions\n-   Overseeing a team of developers while ensuring high-quality code, adherence to best practices, and timely delivery of features across both Android and iOS platforms,\n-   Actively take part in technical discussions.\n-   Architect and design robust mobile app solutions for both Android and iOS, ensuring scalability and maintainability.\n-   Guide the team on best practices for coding standards, design patterns, and performance optimization.\n-   Stay updated on the latest mobile development technologies and frameworks, proposing and implementing new solutions as needed\n-   Lead the development of new features and functionalities for mobile apps, ensuring alignment with product requirements.\n-   Hands-on coding for complex features and critical components across both Android and iOS platforms.\n-   Manage the development lifecycle, including planning, estimation, implementation, testing, and deployment.\n\n**What You Will Need To Succeed**  \n  \n\n-   Bachelor’s degree in computer science or a related field.\n-   6+ years of professional experience in software development.\n-   Solid understanding of object-oriented programming, multi-threaded apps and design patterns.\n-   Proficient in Java/Kotlin for Android development\n-   Proficient in Swift/Objective-C for iOS development\n-   Deep understanding of Android SDK and iOS SDK\n-   Familiarity with cross-platform frameworks (React Native, Flutter) is a plus\n-   Experience with clean architecture principles (MVVM, MVP, etc.)\n-   Knowledge of RESTful APIs and data handling techniques\n-   Strong problem-solving and debugging abilities\n-   Excellent communication and collaboration skills\n-   Passion for mobile technology and staying updated with the latest trends\n-   Experience on working on frontend with JavaScript/typescript/node.js etc\n-   Experience with Databases and opensource frameworks\n-   Experience with version control and build system\n-   Good knowledge of Docker., Kubernetes.\n-   Proficient in Scripting and CI/CD .\n-   Experience with of Docker., Kubernetes\n\nOpenText's efforts to build an inclusive work environment go beyond simply complying with applicable laws. Our Employment Equity and Diversity Policy provides direction on maintaining a working environment that is inclusive of everyone, regardless of culture, national origin, race, color, gender, gender identification, sexual orientation, family status, age, veteran status, disability, religion, or other basis protected by applicable laws.  \n  \nIf you need assistance and/or a reasonable accommodation due to a disability during the application or recruiting process, please contact us at hr@opentext.com. Our proactive approach fosters collaboration, innovation, and personal growth, enriching OpenText's vibrant workplace.  \n  \n**44667**"
  },
  {
    "companyName": "Windowmaker Software",
    "externalUrl": "https://in.linkedin.com/jobs/view/mobile-application-developer-at-windowmaker-software-4138567859?position=9&pageNum=7&refId=K22nyBi7UupPoDSBoSKn9w%3D%3D&trackingId=HwzUfgAi%2BAaEJcb3rV8DTA%3D%3D",
    "description": "Mobile App Developer\n\n  \n\nWe require a Techno Commercial Mobile App Developer to join our App team.\n\nIf you’re passionate about mobile platforms and translating code into user-friendly apps, we would like to meet you. As a Mobile developer, you’ll collaborate with internal teams to develop functional mobile applications, while working in a fast-paced environment.\n\n  \n\n**Key Responsibilities:**\n\n  \n\n·       Producing fully functional mobile applications \n\n·       Supporting the entire application lifecycle (concept, design, test, release, and support) \n\n·       Designing interface to improve user experience \n\n·       Troubleshooting and debugging to optimize performance \n\n·       Implementation of automated testing platforms and unit tests \n\n·       Liaising with the Product development team to plan new features \n\n·       Working closely with colleagues to constantly innovate app functionality and design \n\n·       Researching and proposing new mobile products, applications, and protocols \n\n·       Staying up to date with technology trends \n\n·       Interacting with clients to get their feedback \n\n  \n\n**Technical Skills:**\n\n  \n\n·    At least 4-6 years’ experience of developing mobile applications on Android (Kotlin)\n\n·    Understanding of Android and Apple’s design principles and interface guidelines \n\n·    Familiarity with OOP design principles \n\n·    Understanding of common design patterns - MVC, MVVM, MVP \n\n·    Hands on experience working with remote data via REST APIs, JSON, XML \n\n·    Familiarity with Room and SQLite \n\n·    Experience with third-party libraries and APIs \n\n·    Familiarity using Scrum/Agile development methodologies \n\n·    Familiarity with CI/CD \n\n·    Must have development experience on both tablets and phones \n\n·    Hands on experience with in-app purchases \n\n·    Familiarity with AR and AI is a big plus \n\n  \n\n**Do you have what it takes?** \n\n·    Excellent analytical skills with a good problem-solving attitude \n\n·    Self-driven and ability to work with minimal direction and in a team to research innovative\n\n    solutions to challenging business/technical problems. \n\n·    Communication… \n\n·    Innovation… \n\n·    Initiative…"
  },
  {
    "companyName": "NeoTaste",
    "externalUrl": "https://de.linkedin.com/jobs/view/android-engineer-at-tech-startup-remote-in-germany-m-w-d-at-neotaste-4140850814?position=24&pageNum=0&refId=4j7ZR61w%2B1%2FRhrSXoCHVqg%3D%3D&trackingId=zyCTwe0odJWmfMwhergErQ%3D%3D",
    "description": "**Let us give you a taste**  \n  \nJoin us in revolutionizing the food industry in your city and become a part of one of the fastest-growing startups in 2024!  \n  \n**Your mission**  \n  \n\n-   You will play a crucial role in building the NeoTaste Android app for the next millions of users\n-   Collaborate closely with our product and design team to discover, define, and ship new features improving the NeoTaste experience\n-   Implement clean, efficient, and scalable code following the best practices and considering the latest Android platform capabilities\n-   Work closely with Backend Engineers and Data Scientists to build features and ship experiments\n-   You will take part in the team building process by joining technical interviews and be a mentor to more junior colleagues\n\n**Your profile**  \n  \n\n-   You have a proven track record of developing and scaling high-quality Android apps with at least 2 years of working experience\n-   You are strongly proficient in Kotlin\n-   You have experience in navigating the entire mobile development lifecycle, crafting applications designed for substantial scale\n-   You have an eye for detail and care about delivering a top-notch user experience\n-   You can work flexibly and independently, and show a high level of ownership\n-   You are passionate about food and changing the way people explore new restaurants\n\n**Why us?**  \n  \n\n-   The opportunity to be part of our newly built in-house engineering team - you’ll have the chance to shape how we work from the ground up\n-   Inspiring work environment - learn something new every day!\n-   Sports Benefits – Through our partners Urban Sports Club and Hussle, you get great deals on sports and wellness offerings for the perfect balance!\n-   True startup atmosphere & flat hierarchies - your ideas matter and are welcomed\n-   Flexible & autonomous work - remote and in our office\n-   Top-notch technical equipment - you tell us what you need\n-   NeoTaste parties with all employees, free drinks, team dinners, rooftop after-works, and many more perks!\n\n**Sounds good?**  \n  \nDoes this description fit you? Then send us a short message explaining why you are the right person for the job! Your contact person Lea looks forward to your application.  \n  \n**About Us**  \n  \nWith **NeoTaste** we develop **the platform** for you to discover new restaurants in your city. As a user, you can enjoy special deals that are exclusive to us and allow you to discover the culinary diversity of the city.  \n  \nOn the other hand, we are also **the partner** for restaurants to win new customers who do not yet know their go-to food place. The restaurants can adjust their special deals individually to their capacity, which helps them increase their occupancy and thus their revenue.  \n  \nWe are looking for enthusiastic and motivated team players who are eager to build something great with us.  \n  \n\n-   We're present in over 50 cities in Germany, the Netherlands & the UK and are expanding into Europe\n-   More than 1.5 million users love our app\n-   We're a team of more than 100 employees\n-   In addition to our €6 Million funding in August 2023, we've also collected a €15 Million Series A extension in March 2024"
  },
  {
    "companyName": "UWorld",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-uworld-4129133632?position=21&pageNum=0&refId=dZsf%2Bm7CD7HAeT%2BtM8wv2g%3D%3D&trackingId=jN1EDbTutokYaiAEH7JaKw%3D%3D",
    "description": "Description\n\n  \n\nUWorld is a leader in online test prep for college entrance, undergraduate, graduate, and professional licensing exams throughout the United States. Since 2003, over 2 million students have trusted us to help them prepare for high-stakes examinations.\n\nUWorld is seeking Android developers who are passionate about creating an excellent user experience and enjoy taking on new challenges. The Android app developer will be responsible for the development, testing, and support of our native Android apps for online test delivery platforms.\n\n  \n\nYour Role\n\n-   Create storyboards and develop native UI screens using native Android components.\n-   Participate in end-to-end development of features, including performance monitoring and app analytics.\n-   Consume REST services to provide an interactive experience for end-users with real-time data.\n-   Collaborate with senior software developers and team leads in establishing and employing best practices for code sharing and development to ensure common code base abstraction across all applications.\n-   Understand the cross-platform functionality support so all apps provide a consistent user experience.\n\n**Environment:** Java, Kotlin, Android SDK, Relational Databases (MS-SQL, MySQL, etc.), NoSQL (MongoDB, CosmosDB, etc.), HTML, CSS, JavaScript, jQuery, TypeScript, Bootstrap, Material Design principles.\n\n  \n\n  \n\n**Requirements**\n\n-   Master's or Bachelor's degree in computer science or related field\n-   4–6 years of experience in native Android applications development\n-   3+ years of coding experience in Java or Kotlin\n-   Strong understanding of OOP concepts and design\n-   Experience in launching at least one commercially deployed application.\n-   Experience integrating with external APIs/web services (with REST, SOAP, etc.)\n-   Experience working with material design patterns and creating custom UI controls.\n\n  \n\nSoft Skills\n\n-   Working proficiency and communication skills in verbal and written English\n-   Excellent interpersonal skills demonstrating the ability to articulate ideas clearly, concisely, and persuasively.\n-   Excellent attention to detail and organization skills and ability to understand direction and feedback.\n-   Ability to work effectively within a changing environment that is going through high growth.\n-   Exceptional follow-through, personal drive, and the desire to make a difference."
  },
  {
    "companyName": "MediaLab",
    "externalUrl": "https://ar.linkedin.com/jobs/view/android-engineer-at-medialab-4139684080?position=8&pageNum=10&refId=ngGpRtcbFRAGCtP2fdvPpw%3D%3D&trackingId=JRnwM5njfyVEYqHwUJNbHw%3D%3D",
    "description": "MediaLab is a media & technology company focused on acquiring and growing properties and global brands. The organization is a unique combination of private equity, holding company and operating entity. We continue to expand and are proud of the prominent market position of our brands.\n\n  \n\nCome join an exceptionally talented team of engineers, designers, product and business builders. HQ is located in sunny Santa Monica, California with growing teams in New York, and across cities in the US and Latin America.\n\n  \n\n**Your Role at MediaLab**\n\n  \n\nMediaLab Engineering supports a growing number of applications across multiple business verticals which have been acquired through a careful selection process to integrate with its internal Ad platform that processes billions of impressions a month.\n\n  \n\nAs an Android Engineer, you will be responsible for the development of both WorldStar HipHop and Amino apps, two key brands of MediaLab.\n\n  \n\nWorldStar HipHop is the N°1 urban news platform in the US that offers a perfect mix of exclusive music videos, user footage, hilarious comedy, sports highlights, movie trailers, interviews, viral clips and more daily.\n\n  \n\nAmino is our social networking brand, is a platform designed for people to connect over shared interests. It allows users to join or create communities which are focused on specific topics, such as gaming, anime, music, movies, art, or general hobbies.\n\n  \n\n**What You'll Do**\n\n  \n\n-   Own the end-to-end development, testing, and maintenance of both WSHH and Amino Apps.\n-   Deliver reliable software thorough code reviews, and best-in-class engineering practices and robust testing.\n-   Troubleshoot and resolve bugs, continuously optimizing performance and user experience.\n-   Document technical details and contribute to long-term application planning and future feature development.\n-   Collaborate with the team to produce high-quality, maintainable, and well-tested code.\n-   Partner with team lead and cross-functional stakeholders to deliver features on time and to specification.\n-   Advocate for emerging technologies, modernize legacy code, and refine best practices and processes.\n\n  \n\n**What We're Searching For**\n\n  \n\n-   Minimum 4+ years of native android development experience. Additional software development experience is preferred but not required\n-   B.S. degree in Computer Science, Engineering or related field preferred but not required\n-   Solid understanding Android tools (Android SDK, Android Studio, Gradle)\n-   Good understanding of commonly used libraries (Jetpack, Compose, Retrofit, Firebase)\n-   Proficiency in Java and Kotlin\n-   Experience with CI/CD tools\n-   Self-motivated with strong communication and problem-solving skills\n-   Passionate about writing clean, well organized and production-ready code\n-   At least one application already built and in the Play Store\n\n  \n\n_At MediaLab, we rely on a range of backgrounds, experiences, and ideas. We value diversity, and we’re proud to be an inclusive, equal opportunity workplace._"
  },
  {
    "companyName": "Trigent Software Inc",
    "externalUrl": "https://in.linkedin.com/jobs/view/application-developer-hyd-hybrid-at-trigent-software-inc-4140601329?position=29&pageNum=0&refId=fRU%2FnWYDGXvco3Je9j7aiw%3D%3D&trackingId=%2BeGNgwYUJZ%2BrPeCWqA%2FpHA%3D%3D",
    "description": "-   Bachelors/ Masters in Computer Science or other Engineering field\n-   6+ years of experience as a Software Developer\n-   6+ years of Android/iOS App development, Flutter development, .NET, C#, XAML, UWP, ASP.Net, Web API, Azure PAAS technologies\n-   Strong knowledge of Windows APIs, UI layouts via XAML\n-   Strong leadership skills\n-   Excellent communication, teamwork and collaboration skills across organizations\n-   Strong problem solving and debugging skills\n-   Should be able to work independently\n-   Passionate, motivated, self-driven and quick learner\n\n**Preferred But Not Mandatory**  \n  \n\n-   Knowledge on Google Store & iOS Store\n-   Experience in publishing mobile app to Google store & to Apple store\n-   Experience developing with UWP applications"
  },
  {
    "companyName": "Strataigize Marketing",
    "externalUrl": "https://ca.linkedin.com/jobs/view/android-developer-at-strataigize-marketing-4141545407?position=1&pageNum=0&refId=j5yI9OmjD18LLIIBS9EoaA%3D%3D&trackingId=3qyMOEb3lCYWziYrORgRQA%3D%3D",
    "description": "**Company Description**\n\nStrataigize Marketing is a full-service partner for mobile app and product growth, specializing in scaling acquisition, retention, and revenue. Services include Growth Strategy, Ad Creative Production, Performance Marketing & Paid Media, Landing Page Optimization & Monetization, CRM Strategy & Implementation, Product-Led Growth, UX/UI Design, and SEO & ASO.\n\n  \n\n**Role Description**\n\nThis is a full-time remote role for an Android Developer at Strataigize Marketing. The Android Developer will be responsible for mobile application development, Android design, and software development. The role involves day-to-day tasks related to building and optimizing Android applications to drive growth and user engagement.\n\n  \n\n**Qualifications**\n\n-   Mobile Application Development and Android Design skills\n-   Android Development and Software Development expertise\n-   Experience in developing mobile applications\n-   Knowledge of UI/UX principles\n-   Strong problem-solving and analytical skills\n-   Ability to work independently and remotely\n-   Bachelor's degree in Computer Science, Engineering, or related field"
  },
  {
    "companyName": "Aura Bizcom",
    "externalUrl": "https://www.indeed.com/rc/clk?jk=96cb386d413c7e3c&bb=AAA4uySzzyk490saWvn_q3EsVADidR-rRbcfhhWvyBjlXZaJpW0ONa50aa-OOXjQ2jTPw4xvanm4p461C5mK0cKXvCszUgJCF7d_hZ85i3sYTy04Ofku01oe_s5co_0n&xkcb=SoA_67M32g1VC2zZkB0GbzkdCdPP&fccid=5032b4b791be2e7a&cmp=Aura-Bizcom&ti=Android+Developer&vjs=3",
    "description": "We are looking for a talented and passionate Android Developer to join our team. As an Android Developer, you will be responsible for designing, developing, and maintaining high-quality Android applications. You will collaborate with cross-functional teams to define, design, and ship new features, ensuring the best user experience and performance.\n\n**Key Responsibilities:**\n\n-   Design and build advanced applications for the Android platform.\n-   Collaborate with cross-functional teams to define, design, and implement new features.\n-   Ensure the performance, quality, and responsiveness of applications.\n-   Identify and fix bugs and performance bottlenecks.\n-   Work with external APIs and data sources to integrate functionalities.\n-   Stay updated with the latest Android development trends and technologies.\n-   Continuously discover, evaluate, and implement new technologies to maximize development efficiency.\n-   Follow best practices for code maintenance, testing, and deployment.\n\n**Qualifications and Skills:**\n\n-   Proven experience in Android app development.\n-   Proficiency in Kotlin and Java.\n-   Strong knowledge of Android SDK, Android Studio, and frameworks.\n-   Familiarity with RESTful APIs and JSON for app integration.\n-   Understanding of MVVM/MVP architecture patterns.\n-   Experience with third-party libraries and APIs (e.g., Retrofit, Glide).\n-   Familiarity with Android UI design principles, patterns, and best practices.\n-   Knowledge of Git/version control tools.\n-   Excellent problem-solving and debugging skills.\n-   Strong communication and teamwork skills.\n\n**Preferred Qualifications (Optional):**\n\n-   Experience with Jetpack Compose.\n-   Knowledge of CI/CD pipelines for Android apps.\n-   Familiarity with Google Play Store deployment process.\n-   Experience with reactive programming (RxJava, Coroutines).\n-   Previous experience in Agile/Scrum development environments.\n\n**What We Offer:**\n\n-   Competitive salary and benefits.\n-   Opportunities for professional growth and development.\n-   Collaborative and inclusive work environment.\n-   Flexible working hours and remote work options (if applicable).\n\nJob Type: Full-time\n\nWork Location: Remote"
  },
  {
    "companyName": "E.L.F. BEAUTY",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-e-l-f-beauty-4104794432?position=3&pageNum=0&refId=YYwE%2FsuMkLEGzsezm6cu7g%3D%3D&trackingId=ZF06tHGNGBoN5Q2Zg43%2BVg%3D%3D",
    "description": "**About The Company**  \n  \ne.l.f. Beauty, Inc. stands with every eye, lip, face and paw. Our deep commitment to clean, cruelty free beauty at an incredible value has fueled the success of our flagship brand e.l.f. Cosmetics since 2004 and driven our portfolio expansion. Today, our multi-brand portfolio includes e.l.f. Cosmetics, e.l.f. SKIN, pioneering clean beauty brand Well People, Keys Soulcare, a groundbreaking lifestyle beauty brand created with Alicia Keys and Naturium, high-performance, biocompatible, clinically-effective and accessible skincare.  \n  \nIn our Fiscal year 24, we had net sales of $1 Billion and our business performance has been nothing short of extraordinary with 23 consecutive quarters of net sales growth. We are the #2 mass cosmetics brand in the US and are the fastest growing mass cosmetics brand among the top 5. Our total compensation philosophy offers every full-time new hire competitive pay and benefits, bonus eligibility (200% of target over the last four fiscal years), equity, flexible time off, year-round half-day Fridays, and a hybrid 3 day in office, 2 day at home work environment. We believe the combination of our unique culture, total compensation, workplace flexibility and care for the team is unmatched across not just beauty but any industry.  \n  \nVisit our Career Page to learn more about our team: https://www.elfbeauty.com/work-with-us  \n  \n**Job Summary**  \n  \nWe are seeking a talented and motivated Android Developer to join our highly collaborative and growing multinational team. The ideal candidate will have strong proficiency in Kotlin, the Android SDK, Android Studio, and Jetpack libraries. A deep understanding of software development principles such as SOLID, along with principles of Test-Driven Development (TDD) and Behavior Driven Development (BDD), is essential. The candidate must also have experience with geolocation, API integration, and eCommerce. Additionally, the candidate should have at least one app published in the Google Play Store. This role requires close collaboration with global teams, including our mobile eCommerce partner based in the UK, while primarily working during USA East Coast hours.  \n  \n**Responsibilities**  \n  \n\n-   Design and build advanced applications for the Android platform using Kotlin. Collaborate closely with cross-functional teams to define, design, and ship new features.\n-   Work hand-in-hand with our mobile eCommerce partner in the UK to deliver high-quality, performant mobile solutions.\n-   Engage in an open and collaborative team environment, where teamwork is key to driving innovation and delivering outstanding products.\n-   Ensure the performance, quality, and responsiveness of applications.\n-   Integrate geolocation services and functionality within Android apps, ensuring accurate and efficient data processing.\n-   Develop robust solutions through API integration with various third-party services.\n-   Implement eCommerce functionality, ensuring secure and seamless transactions and user experiences.\n-   Identify and correct bottlenecks and fix bugs.\n-   Help maintain code quality, organization, and automation.\n-   Write clean, maintainable code and follow best practices.\n-   Contribute to the improvement of the development process and codebase in a collaborative environment.\n-   Stay up to date with the latest Android development trends, libraries, and techniques\n\n_This job description is intended to describe the general nature and level of work being performed in this position. It also reflects the general details considered necessary to describe the principal functions of the job identified, and shall not be considered, as detailed description of all the work required inherent in the job. It is not an exhaustive list of responsibilities, and it is subject to changes and exceptions at the supervisors’ discretion.  \n  \n__e.l.f. Beauty respects your privacy. Please see our Job Applicant Privacy Notice (www.elfbeauty.com/us-job-applicant-privacy-notice) for how your personal information is used and shared._"
  },
  {
    "companyName": "Teamic",
    "externalUrl": "https://in.linkedin.com/jobs/view/frontend-developer-at-teamic-4140496662?position=38&pageNum=0&refId=PB3U603nSAtOp48%2BckNOWw%3D%3D&trackingId=pG7N9tEIiXMNUbtSOby0fA%3D%3D",
    "description": "**Company Description**\n\nTeamic empowers businesses by leveraging informational data, conclusive strategy, and end-to-end execution to drive growth and success.\n\n  \n\n**Role Description**\n\nThis is a full-time hybrid role for a Frontend Developer at Teamic. The Frontend Developer will be responsible for developing and implementing user-friendly interfaces, ensuring the responsiveness of applications, and collaborating with the Back-End Development team. This role is based in Pune but offers some work-from-home flexibility.\n\n  \n\n**Qualifications**\n\n-   Excellent problem-solving and communication skills.\n-   Master of Ideation and conceptualization.\n-   Front-end development and Optimized Responsive iOS/Android & Web Design skills.\n-   Experience in Software Development and Web Development.\n-   Strong understanding of Back-End Web Development principles.\n-   Proficiency in technologies such as JavaScript, React and CSS.\n-   Ability to work in a team and independently.\n-   Bachelor's degree in Computer Science."
  },
  {
    "companyName": "Vithamas Tech",
    "externalUrl": "https://in.linkedin.com/jobs/view/software-sr-software-engineer-android-at-vithamas-tech-4140487746?position=3&pageNum=0&refId=AUqZKuaTsh3mLFIjNfc0cw%3D%3D&trackingId=AEp%2FkgIeK36%2FF9c7TJehYA%3D%3D",
    "description": "Roles & Responsibilities: 2-3 years of Experience developing mobile apps.  Have an Experience indeveloping nativeAndroid apps(depth knowledgeof Android SDK, NDK)  Depth knowledgeof SQLite andRoom  Excellentin JAVA, Kotlin language with agooddebugging Skills  Expertin usingAndroid StudioandGit .  Developing universalapplication, which can run on most available androiddevices.  Must have good understanding ofObject-OrientedProgramming  Good eye formobileapp designand productsense  Experience in cross platformToolslike Appcelerator  Internallymotivated, abletowork proficiently both independently and in a team environment.  Good communication skills with both internal teammembers and external business stakeholders  Strong initiativeto find ways to improve solutions,systems, and processes.  Experience ofworking onAndroid Studio.  Good in data structure and Algorithms.  Very Sound knowledge of Android Components.  \n  \nCandidate Required:  \n  \n\n-   Excellentcommunication skills\n-   ProficientinmobileappUI development and bestpractices\n-   Ability to understand that business needsmay shift yourpriorities and adjustaccordingly\n-   Exceptionalwritten and oral communicationskills.\n-   Exceptional interpersonalskills, with a focus on listening and questioningskills.\n-   Proven analytical and problem-solving abilities.\n-   Ability to effectively prioritizeand execute tasksin ahigh-pressure environment Skills:- Model-View-View-Model (MVVM), RxJava, iOS App Development, Java, Kotlin, Debugging, Git, Object Oriented Programming (OOPs), Appcelerator, SQLite and Room"
  },
  {
    "companyName": "Fibonacci X",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-fibonacci-x-4140487953?position=5&pageNum=0&refId=AUqZKuaTsh3mLFIjNfc0cw%3D%3D&trackingId=MZpeUYy70Kmv5Spm8UVTcg%3D%3D",
    "description": "we are looking for a full-time Android Developer to join our team. You’ll be responsible for developing and maintaining high end apps for companies from all over the world.  \n  \nSkills:- Android Development, Java, Kotlin, API and MVVC"
  },
  {
    "companyName": "A1Apps",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-a1apps-4140488920?position=7&pageNum=0&refId=%2B8HvaNjRDq4JHdWfEZgE8g%3D%3D&trackingId=uWy2NSY6QzdJbMdIO0IIng%3D%3D",
    "description": "**Roles and** **Responsibilities**  \n  \nCreate & manage world-class apps that have the potential of reaching millions of users.  \n  \nRoles and responsibilities include -  \n  \n\n-   Addition of new features to existing app and making sure minimal crash rate and ANR\n-   Adding new AI models built by the data science team into the android environment\n-   Creating reasonable timelines and making sure delivery is according to planned schedules\n\nNOTE -  \n  \n\n-   Premier institute(s) preferred - but not a requirement for the job.\n-   Salary is negotiable based on your skillset\n\nSkills:- Model-View-View-Model (MVVM), RxJava and iOS App Development"
  },
  {
    "companyName": "SATMAT TECHNOLOGIES",
    "externalUrl": "https://in.linkedin.com/jobs/view/senior-android-developer-at-satmat-technologies-4141533152?position=5&pageNum=0&refId=%2B8HvaNjRDq4JHdWfEZgE8g%3D%3D&trackingId=NaTumbTmzGof53tJYL9dYA%3D%3D",
    "description": "**Skills:**  \nKotlin, Java, Android Jetpack, MVVM Architecture, Coroutines, Retrofit, Firebase, Flutter,  \n  \n**Title: Sr. Developer Mobile**  \n  \n**Openings**: 1  \n  \n**Experience**: 8-10 Years  \n  \n**Responsibilities**  \n  \nWe are seeking a highly skilled Senior Android Developer with extensive experience in Android application development and a strong focus on Flutter for cross-platform deployment. The ideal candidate will have a deep understanding of software architecture, creating reusable components, and implementing best practices for code segregation. You will work on complex applications tailored for multiple banking products while leveraging your expertise in Flutter to deploy new applications effectively.  \n  \n**Key Responsibilities**  \n  \n**Architect and Design:** Lead the architecture and design of robust Android and Flutter applications, ensuring modularity and code reusability.  \n  \n**Development:** Develop, build, and deploy high-quality Android and Flutter applications with a strong emphasis on performance and user experience.  \n  \n**Integration:** Seamlessly integrate third-party APIs and REST APIs into applications.  \n  \n**Code Management:** Implement best practices for code organization, utilizing multiple libraries to ensure effective code segregation.  \n  \n**Troubleshooting:** Proactively resolve application crashes and performance issues through efficient debugging and troubleshooting techniques.  \n  \n**Security Implementation:** Design and implement security measures, including encryption, digital signatures, and secure data handling.  \n  \n**New Technology Adoption:** Stay up-to-date with emerging technologies and trends, demonstrating a keen interest in learning and implementing new tools and frameworks.  \n  \n**Collaboration:** Work closely with cross-functional teams, including product managers and designers, to translate requirements into technical specifications.  \n  \n**Mentorship:** Provide guidance and mentorship to junior developers, fostering a culture of learning and continuous improvement.  \n  \n**Key Skills**  \n  \n**Programming Languages:** Expertise in OOP, Core Java, Kotlin, and strong experience with Flutter for mobile application development.  \n  \n**Flutter Deployment:** Proven track record of deploying new applications using Flutter, including experience with its architecture and best practices.  \n  \n**Architecture Patterns:** Strong understanding of architectural patterns such as MVP, MVVM, or Clean Architecture.  \n  \n**Android App Development:** Extensive experience in developing complex Android applications with intricate UI designs.  \n  \n**SDK Integration:** Proven experience in integrating various SDKs and managing dependencies effectively.  \n  \n**API Integration:** In-depth knowledge of integrating and working with third-party and RESTful APIs.  \n  \n**Security Best Practices:** Solid understanding of application security practices, including encryption and digital signatures.  \n  \n**Performance Optimization:** Experience in optimizing app performance and responsiveness.  \n  \n**Version Control:** Proficient in using Git and other version control systems.  \n  \n**Preferred Qualifications**  \n  \nBachelors degree in Computer Science or a related field.  \n  \nExperience in the banking or financial services sector is a plus.  \n  \nStrong problem-solving skills and attention to detail.  \n  \nExcellent communication and interpersonal skills."
  },
  {
    "companyName": "KAFQA",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-development-at-kafqa-4140490876?position=4&pageNum=0&refId=%2B8HvaNjRDq4JHdWfEZgE8g%3D%3D&trackingId=zbTuGhc0%2BURs6fHYXhFGIQ%3D%3D",
    "description": "**About Kafqa**  \n  \nAt Kafqa, we are building the next generation performing arts platform. Our mission is to transform how India learns, performs, and watches performing arts. Our launch services consist of technology-enabled dance classes in our proprietary studios, production facilities, and social media broadcasting and competitions.  \n  \n**Founder And Team**  \n  \nThe founder is Shariq Plasticwala. He is a graduate of IIT Bombay & Stanford GSB. He was part of the founding team of Amazon India where he played a key role for over 8 years.  \n  \nAmong his roles at Amazon, he was the CEO of Amazon’s first joint venture in India and a board member of Amazon’s payments business. The other members of the founding team consisted of senior executives from Shiamak Davar & Byju’s.  \n  \n**Responsibilities**  \n  \n\n-   Develop, test, deploy and release new user-facing features\n-   Set continuous delivery and continuous improvement in front-end development,\n-   Developing scalable, reusable components and front-end libraries,\n-   Translating UI designs and UX wireframes into high-quality codes\n-   Optimizing components for maximum performance,\n-   An advocate of general engineering best practices such as domain-driven code architecture, encapsulation, separation of concerns, single responsibility, clean code practices, etc.\n\n**Requirements**  \n  \n\n-   3-5 Years of experience in react native.\n-   A knack for writing clean, readable React-Native code\n-   Solid understanding of object-oriented programming\n-   Understanding and grasp of Agile development and Scrum practices\n-   Familiarity with version control Git (Github or Gitlab)\n-   Flexibility and deadline-driven. Skills:- Model-View-View-Model (MVVM), RxJava and iOS App Development"
  },
  {
    "companyName": "Recro",
    "externalUrl": "https://in.linkedin.com/jobs/view/mobile-application-developer-at-recro-4140792809?position=15&pageNum=0&refId=Aqz4hGFcwUcuV8cvTa8hJw%3D%3D&trackingId=6x90G1rdXAQedqZ6WOs6gQ%3D%3D",
    "description": "We are seeking a Senior Engineer - Android/iOS to join our development team. In this role as a Senior Engineer - Android/iOS, you will play a key role in leading and developing features that will impact our valuable customers. Leveraging your expertise in creating scalable Mobile applications and migrating existing native Android/iOS applications to Flutter, you will be responsible for designing, developing, and optimizing our applications to deliver unparalleled experiences With a proven track record of collaborating with cross-functional teams, you will work alongside a diverse ecosystem of talented engineers, designers, analysts, product experts, and other team members to leverage system design, create technical solutions, dive deep into complex problems.\n\n  \n\n**Responsibilities:**\n\n-   Design and implement features by writing readable, testable, and maintainable code in Dart, Kotlin/Swift,\n-   Write test cases to ensure the accuracy and reliability of implementations.\n-   Provide guidance and mentorship of native Android/iOS developers transitioning to Flutter.\n-   Participate in Scrum team activities, engaging in various stages of feature development.\n-   Collaborate with cross-functional teams to understand and design features that meet project requirements.\n-   Identify and resolve bugs through thorough code analysis, debugging, and determining root causes, then providing practical solutions.\n-   Contribute to team effectiveness by sharing expertise and experience and adhering to team standards and best practices.\n-   Participate in improving project efficiency, component quality, and automation processes when needed.\n\n  \n\n**Requirements:**\n\n-   Minimum 2 years in Android/iOS development\n-   Strong proficiency in using Dart with Kotlin, or Swift.\n-   You must have experience in both Dart and Kotlin/Swift.\n-   Familiarity with Flutter widgets and state management solutions like Provider, BLoC, or Riverpod.\n-   Comprehensive understanding of S. O. L. I. D principles and Design Patterns.\n-   Ability to develop features that support various screen sizes, ensure proper localization, and compatibility with different versions of iOS and Android.\n-   Awareness of security best practices to safeguard sensitive data usage and storage.\n-   Experience in optimizing memory usage and enhancing performance is a plus.\n-   Knowledgeable in working with multi-module projects is a plus.\n-   Deeply understand the advantages and disadvantages of hybrid versus native mobile development.\n-   Ability to design solutions for medium to complex features that involve different teams.\n-   Professional experience in working on Agile/Scrum projects is a must.\n-   Demonstrated teamwork skills with a dedication to collaborative problem-solving and conflict resolution.\n-   Effective task prioritization and organizational skills, enabling independent work with minimal supervision.\n-   Your tech stacks also include Git-flow, Git, REST APIs with JSON, Material design, and Cloud messaging."
  },
  {
    "companyName": "Jobot Consulting",
    "externalUrl": "https://www.linkedin.com/jobs/view/android-engineer-at-jobot-consulting-4140480895?position=12&pageNum=0&refId=%2BHHN%2F967jk8jmmfX6F%2B0ig%3D%3D&trackingId=yg4PSBL7NhfKM%2BMGGtuk%2Bg%3D%3D",
    "description": "Want to learn more about this role and Jobot Consulting? Click our Jobot Consulting logo and follow our LinkedIn page!  \n  \nJob details  \n  \n**100% Remote - Contract - Java - Kotlin**  \n  \nThis Jobot Consulting Job is hosted by Chuck Wirtz  \n  \nAre you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.  \n  \nSalary $40 - $45 per hour  \n  \n**A Bit About Us**  \n  \nWe are a well-established mobile-focused agency that builds top platforms for highly recognizable brands.  \n  \n**  \n  \n**Why join us?**  \n  \n**  \nWe are looking for problem-solvers. Contract. Fully remote.  \n  \n**Job Details**  \n  \nAndroid  \n  \nKotlin  \n  \nGraphQL  \n  \nREST APIs  \n  \nReact Native  \n  \nJitPack  \n  \nInterested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.  \n  \n**Want to learn more about this role and Jobot Consulting?**  \n  \nClick our Jobot Consulting logo and follow our LinkedIn page!"
  },
  {
    "companyName": "Jobot Consulting",
    "externalUrl": "https://www.linkedin.com/jobs/view/android-engineer-at-jobot-consulting-4140480823?position=10&pageNum=0&refId=%2BHHN%2F967jk8jmmfX6F%2B0ig%3D%3D&trackingId=LgtfQDTPrjOHcmfz4hahtg%3D%3D",
    "description": "Want to learn more about this role and Jobot Consulting? Click our Jobot Consulting logo and follow our LinkedIn page!  \n  \nJob details  \n  \n**100% Remote - Contract - Java - Kotlin**  \n  \nThis Jobot Consulting Job is hosted by Chuck Wirtz  \n  \nAre you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.  \n  \nSalary $40 - $45 per hour  \n  \n**A Bit About Us**  \n  \nWe are a well-established mobile-focused agency that builds top platforms for highly recognizable brands.  \n  \n**  \n  \n**Why join us?**  \n  \n**  \nWe are looking for problem-solvers. Contract. Fully remote.  \n  \n**Job Details**  \n  \nAndroid  \n  \nKotlin  \n  \nGraphQL  \n  \nREST APIs  \n  \nReact Native  \n  \nJitPack  \n  \nInterested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.  \n  \n**Want to learn more about this role and Jobot Consulting?**  \n  \nClick our Jobot Consulting logo and follow our LinkedIn page!"
  },
  {
    "companyName": "SATMAT TECHNOLOGIES",
    "externalUrl": "https://in.linkedin.com/jobs/view/senior-android-developer-at-satmat-technologies-4141532286?position=4&pageNum=0&refId=KqY0rbtRWiWO3aSvkplNyw%3D%3D&trackingId=kR3lmqTJd9TvokI1Qx26sA%3D%3D",
    "description": "**Skills:**  \nKotlin, Java, Android Jetpack, MVVM Architecture, Coroutines, Retrofit, Firebase, Flutter,  \n  \n**Title: Sr. Developer Mobile**  \n  \n**Openings**: 1  \n  \n**Experience**: 8-10 Years  \n  \n**Responsibilities**  \n  \nWe are seeking a highly skilled Senior Android Developer with extensive experience in Android application development and a strong focus on Flutter for cross-platform deployment. The ideal candidate will have a deep understanding of software architecture, creating reusable components, and implementing best practices for code segregation. You will work on complex applications tailored for multiple banking products while leveraging your expertise in Flutter to deploy new applications effectively.  \n  \n**Key Responsibilities**  \n  \n**Architect and Design:** Lead the architecture and design of robust Android and Flutter applications, ensuring modularity and code reusability.  \n  \n**Development:** Develop, build, and deploy high-quality Android and Flutter applications with a strong emphasis on performance and user experience.  \n  \n**Integration:** Seamlessly integrate third-party APIs and REST APIs into applications.  \n  \n**Code Management:** Implement best practices for code organization, utilizing multiple libraries to ensure effective code segregation.  \n  \n**Troubleshooting:** Proactively resolve application crashes and performance issues through efficient debugging and troubleshooting techniques.  \n  \n**Security Implementation:** Design and implement security measures, including encryption, digital signatures, and secure data handling.  \n  \n**New Technology Adoption:** Stay up-to-date with emerging technologies and trends, demonstrating a keen interest in learning and implementing new tools and frameworks.  \n  \n**Collaboration:** Work closely with cross-functional teams, including product managers and designers, to translate requirements into technical specifications.  \n  \n**Mentorship:** Provide guidance and mentorship to junior developers, fostering a culture of learning and continuous improvement.  \n  \n**Key Skills**  \n  \n**Programming Languages:** Expertise in OOP, Core Java, Kotlin, and strong experience with Flutter for mobile application development.  \n  \n**Flutter Deployment:** Proven track record of deploying new applications using Flutter, including experience with its architecture and best practices.  \n  \n**Architecture Patterns:** Strong understanding of architectural patterns such as MVP, MVVM, or Clean Architecture.  \n  \n**Android App Development:** Extensive experience in developing complex Android applications with intricate UI designs.  \n  \n**SDK Integration:** Proven experience in integrating various SDKs and managing dependencies effectively.  \n  \n**API Integration:** In-depth knowledge of integrating and working with third-party and RESTful APIs.  \n  \n**Security Best Practices:** Solid understanding of application security practices, including encryption and digital signatures.  \n  \n**Performance Optimization:** Experience in optimizing app performance and responsiveness.  \n  \n**Version Control:** Proficient in using Git and other version control systems.  \n  \n**Preferred Qualifications**  \n  \nBachelors degree in Computer Science or a related field.  \n  \nExperience in the banking or financial services sector is a plus.  \n  \nStrong problem-solving skills and attention to detail.  \n  \nExcellent communication and interpersonal skills."
  },
  {
    "companyName": "Zebra Technologies",
    "externalUrl": "https://in.linkedin.com/jobs/view/software-engineer-ii-in-senior-at-zebra-technologies-4104357018?position=38&pageNum=0&refId=9AWRFxHSLIbEpDBK5aJbUA%3D%3D&trackingId=GNF%2BZTLoeGrV6amEn4yFFQ%3D%3D",
    "description": "**Remote Work: No**  \n  \n**Overview:**  \n  \nAt Zebra, we are a community of innovators who come together to create new ways of working to make everyday life better. United by curiosity and care, we develop dynamic solutions that anticipate our customer’s and partner’s needs and solve their challenges.  \n  \nBeing a part of Zebra Nation means being seen, heard, valued, and respected. Drawing from our diverse perspectives, we collaborate to deliver on our purpose. Here you are a part of a team pushing boundaries to redefine the work of tomorrow for organizations, their employees, and those they serve.  \n  \nYou have opportunities to learn and lead at a forward-thinking company, defining your path to a fulfilling career while channeling your skills toward causes that you care about – locally and globally. We’ve only begun reimaging the future – for our people, our customers, and the world.  \n  \nLet’s create tomorrow together.  \n  \nZebra Technologies is looking for engineers skilled in C++/Java/Kotlin development who has strong knowledge of Android internals, Android SDK, NDK, Linux Kernel and System programming. As an Android developer you will be playing a pivotal role in delivering features for one of the core technology teams within Zebra. You would work with scrum teams using agile technical best practices right from defining, designing, delivering and maintaining features. You would be responsible for design and development of code which can be reusable assets. You would be collaborating with various stake holders including product management, program management, cross functional scrum teams, System Test team etc. to discuss the features and solve issues affecting end user experience with a strict compliance to the schedule.  \n  \n**Responsibilities:**  \n  \n\n-   Lead core technology features related to data capture\n-   Bring-up of imagers and camera based scanning on upcoming platforms and products.\n-   Contribute to the delivery of SDK features for data capture.\n-   Debug and resolve issues reported on features, and ensure timely launch of products.\n-   Collaborate with cross functional teams.\n-   Optimize the performance of data capture and vision features on the devices.\n-   Coordinate with geographically spread out teams.\n-   Lead innovation initiatives.\n-   Engage with customer account teams to resolve critical customer issues.\n\n**Qualifications:**  \n  \n\n-   Minimum 7 years of experience in the field of mobile application/platform development.\n-   Working experience in C, C++ or Core / Android Java programming, Android SDK, Android NDK.\n-   Working experience on camera subsystem and/or image processing.\n-   Should have good knowledge and understanding of Android development, debugging tools\n-   Preferable to have good knowledge and understanding of Device Tree, Kernel/Framework interface, CTS failure analysis, GMS integration, system stability, peripheral modules, device drivers, etc.\n-   Should have good knowledge and understanding of OS concepts use of threads/mailbox/semaphore/mutex, Linux Internals, Android Internals (Socket programming, process synchronization)\n-   Experience in embedded system development, preferably Android Mobile platform.\n-   Should have good knowledge and understanding of Android internals (Android N)\n\nTo protect candidates from falling victim to online fraudulent activity involving fake job postings and employment offers, please be aware our recruiters will always connect with you via @zebra.com email accounts. Applications are only accepted through our applicant tracking system and only accept personal identifying information through that system. Our Talent Acquisition team will not ask for you to provide personal identifying information via e-mail or outside of the system. If you are a victim of identity theft contact your local police department."
  },
  {
    "companyName": "HumansHere",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-humanshere-4140706679?position=3&pageNum=7&refId=5vf8yznRGlyiwWNEaC50%2BQ%3D%3D&trackingId=hBbihUaDZ2%2Bko0w5IgEh6w%3D%3D",
    "description": "At HumansHere, we're not just a company; we're a revolution in the making! Imagine a place where technology isn't just about algorithms and code, but about sparking real, human connections. We're on a mission to dismantle the digital disconnect and rebuild a world where conversations and relationships are as authentic as they are deep. Join us, and be part of an electrifying journey where every line of code and marketing strategy contributes to a more connected, empathetic world. With us, it's not just a job - it's a movement towards a future and our product is a collective solution to connection crisis.\n\n  \n\nRole Overview:\n\n  \n\nWe are seeking a confident and skilled Mobile Engineer capable of taking our app from inception to launch. This role requires ownership of the product, a blend of product management and development skills, and the ability to think creatively and strategically. Engineering at HumansHere is challenging but rewarding, especially with the support of large language models.\n\n  \n\nResponsibilities:\n\n  \n\n-   End-to-End Development: Lead the development of our mobile application from concept to deployment for native Android OS\n-   Engineering & Architecture: Strong understanding of database technologies, system architecture with AI & ML stack across different cloud providers (GCP, Azure, AWS)\n-   Product Ownership: Own the mobile product, making key architectural decisions and ensuring high-quality user experience.\n-   Ideation and Brainstorming: Collaborate with the team to brainstorm, ideate, and implement innovative features that align with our product vision.\n-   Creative Problem Solving: Apply creative thinking to solve complex technical problems and improve app performance.\n-   User-Centric Design: Work closely with UI/UX designers to ensure the app is intuitive, engaging, and visually appealing.\n-   Integration: Integrate with backend services, ensuring seamless communication between the mobile app and our cloud infrastructure.\n-   Quality Assurance: Write unit and integration tests to ensure code quality and reliability.\n-   Continuous Improvement: Stay updated with the latest industry trends, technologies, and best practices to continuously improve the app.\n\n  \n\nQualifications:\n\n  \n\n-   Technical Skills: Proficiency in native Android development with a solid understanding of Android development ecosystems, MongoDB Atlas, FireBase, Multi-cloud capabilities.\n-   Experience: Proven track record of developing and launching mobile apps from scratch.\n-   Problem-Solving: Strong analytical and problem-solving skills, with the ability to think outside the box.\n-   Product Mindset: Ability to think like a product owner, balancing technical decisions with user needs and business goals.\n-   Communication: Excellent communication and collaboration skills, with the confidence to lead discussions and make decisions.\n-   Innovative Thinking: Passion for innovation, creativity, and continuous learning.\n\n  \n\nPreferred:\n\n-   Familiarity with AI/ML technologies and their application in mobile apps."
  },
  {
    "companyName": "Ecuzen Software Private Limited",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-ecuzen-software-private-limited-4140220936?position=37&pageNum=0&refId=ySwreZ%2FSdqqrgAZMpk51jQ%3D%3D&trackingId=3XxcHff1TBB0EYveXCPI2w%3D%3D",
    "description": "**Company Description**\n\nEcuzen Software Private Limited is an emerging software development company in India, providing superior value services since 2017. They focus on listening to the customer's needs and delivering the best software solutions by conducting thorough research. Using the latest technology and updated versions, Ecuzen ensures interactive and responsive platforms for their clients, helping in the growth of their businesses.\n\n  \n\nOffering services such as website development, custom software development, mobile app development for Android and iOS, AEPS software, BBPS & Recharge software, Fintech, and Edutech software, Ecuzen also provides web hosting and cloud server solutions.\n\n  \n\n**Role Description**\n\n**This** is a full-time on-site Android developer role based in Jaipur at Ecuzen Software Private Limited. The Android Developer will be responsible for mobile application development, designing Android applications, and software development.\n\n  \n\n**Qualifications**\n\n-   **Mobile** Application Development and Android Development skills\n-   Experience in Mobile Applications and Android Design\n-   Software Development expertise\n-   Proficiency in Java, Kotlin, Android Studio, and other relevant programming languages\n-   Strong problem-solving and analytical skills\n-   Excellent collaboration and communication abilities"
  },
  {
    "companyName": "Terralogic",
    "externalUrl": "https://in.linkedin.com/jobs/view/solution-architect-%E2%80%93-mobile-app-development-at-terralogic-4140973286?position=31&pageNum=0&refId=ySwreZ%2FSdqqrgAZMpk51jQ%3D%3D&trackingId=Nf4LhmhLyv0DVbpoINE6ew%3D%3D",
    "description": "**Total Experience**  \n  \n3+ years  \n  \n**Job Skills**  \n  \n\n-   Must-Have Skills: 8+ years of experience in mobile application development, including at least 3 years in an architectural or lead role.\n-   Proficiency in mobile development frameworks and platforms (e.g., Swift, Objective C, Xcode, Java, Kotlin, Android SDK, React Native, Flutter or Xamarin).\n-   Deep understanding of architectural patterns such as MVVM, MVP, Clean Architecture, and their application in mobile development.\n-   Experience designing modular, reusable components and managing complex state and data flows.\n-   Strong knowledge of RESTful APIs, GraphQL, and web services integration.\n-   Experience with cloud platforms (AWS, Azure, Google Cloud) and mobile-specific cloud solutions.\n-   Techniques for profiling and optimizing mobile applications, including memory management, network performance, and responsiveness.\n-   Experience with tools and methodologies for performance testing and debugging.\n-   Expertise in mobile security principles, including data encryption, secure authentication, and vulnerability management.\n-   Familiarity with industry standards and regulations such as GDPR, HIPAA, and OWASP.\n-   Experience with continuous integration and continuous deployment (CI/CD) pipelines and tools (e.g., Jenkins, GitLab CI/CD, Bitrise).\n-   Knowledge of automated testing frameworks and strategies for mobile applications. Professional Attributes:\n-   Good problem-solving and analytical skills.\n-   Strong written and verbal communication skills, with the ability to effectively communicate technical concepts to both technical and non-technical stakeholders.\n\n**Responsibilities**  \n  \n\n-   Create and implement comprehensive mobile application architectures for both iOS and Android platforms, focusing on scalability, performance, and maintainability.\n-   Lead and mentor development teams, conduct code reviews, provide guidance on best practices, and ensure adherence to architectural standards.\n-   Translate business requirements into detailed technical solutions, including high-level design documents and architecture blueprints.\n-   Assess and recommend emerging technologies, frameworks, and tools to enhance mobile application development and ensure alignment with industry trends.\n-   Oversee the integration of mobile applications with backend services, APIs, and third-party systems, ensuring seamless functionality and data flow.\n-   Identify and address performance bottlenecks, optimize application performance, and ensure a high-quality user experience.\n-   Apply security best practices to protect user data, ensure compliance with relevant regulations, and safeguard against potential threats\n-   Work closely with product managers, UX/UI designers, and other stakeholders to ensure that mobile solutions meet business needs and deliver exceptional user experiences.\n-   Maintain detailed documentation of architectural decisions, design patterns, and development processes to ensure consistency and knowledge sharing."
  }
]