[
  {
    "companyName": "Rebel Foods",
    "externalUrl": "https://in.linkedin.com/jobs/view/senior-android-developer-java-kotlin-at-rebel-foods-4145941576?position=12&pageNum=0&refId=lsSP3hXT8yprQ0LoAIehNQ%3D%3D&trackingId=6Zx%2Bav2YnLvPvM57tsOYlQ%3D%3D",
    "description": "**Android Developer-II @ REBEL FOODS**\n\n  \n\nWe are surrounded by the world's leading consumer companies led by technology - Amazon for retail, Airbnb for hospitality, Uber for mobility, Netflix and Spotify for entertainment, etc. Food & Beverage is the only consumer sector where large players are still traditional restaurant companies. At Rebel Foods, we are challenging this status quo as we are building the world's most valuable restaurant company on the internet, superfast.\n\n  \n\nThe opportunity for us is immense due to the exponential growth in the food delivery business worldwide which has helped us build 'The World's Largest Internet Restaurant Company' in the last few years. Rebel Foods' current presence is India, Indonesia, UAE, UK & KSA with close to 50 brands and 4500+ internet restaurants has been built on The Rebel Operating System.\n\n  \n\nWhile for us it is still Day 1, we know we are in the middle of a revolution towards creating never seen before customer-first experiences. We bring you a once-in-a-lifetime opportunity to disrupt the 500-year-old industry with technology at its core.\n\n  \n\nWe urge you to refer to the below to understand how we are changing the restaurant industry before applying at Rebel Foods.\n\n  \n\nhttps://spirit.rebelfoods.com/why-is-rebel-foods-hiring-super-talented-engineers-b88586223ebe\n\n  \n\nhttps://spirit.rebelfoods.com/how-to-build-1000-restaurants-in-24-months-the-rebel-method-cb5b0cea4dc8\n\n  \n\nhttps://spirit.rebelfoods.com/winning-the-last-frontier-for-consumer-internet-5f2a659c43db\n\n  \n\nhttps://spirit.rebelfoods.com/a-unique-take-on-food-tech-dcef8c51ba41\n\n  \n\n**The Role**\n\n**You will enjoy working with us, if you are passionate to**\n\n-   Design and build advanced applications for the Android platform\n-   Collaborate with cross-functional teams to define, design, and ship new features\n-   Android Architecture Components, (Example LiveData, Room Persistence Library, Paging etc..)\n\n  \n\n**We’re excited about you if you have:**\n\n-   3 to 5 years of experience in Android development and Android architecture Components, (Example LiveData, Room Persistence Library, Paging etc..)\n-   Excellent programming skills in one or more languages: Java, Kotlin\n-   Knowledge of MVVM with Clean Architecture.\n-   Working experience in bug fixing and improving application performance.\n-   Have published at least two native Android apps.\n-   Experience working with remote data via REST and JSON\n-   Excellent troubleshooting and problem-solving skills\n-   The ability to work in an Agile environment\n-   The ability to collaborate effectively within and across engineering, product and business teams\n\n  \n\n**You will mostly spend time on the following:**\n\n-   You'll work closely with UX (User Experience) designers and the Backend (server-side) team leading the implementation of android apps.\n-   Driving engineering initiatives for your team with a focus on quality, maintainability, availability, scalability, security, performance and stability\n-   Writing efficient, maintainable, scalable, high quality code\n-   Reviewing code and tests\n-   Refactoring and improving code\n-   Teaching and mentoring team members\n\n  \n\n**We value engineers who are:**\n\n-   Crazy about customer experience\n-   Willing to challenge the status quo and innovate\n-   Obsessed with quality, performance and frugality\n-   Willing to take complete responsibility and ownership of results\n-   Team players, teachers, mentors\n\n  \n\n**The Rebel Culture**\n\nWe believe in empowering and growing people to perform the best at their job functions. We follow outcome-oriented, fail-fast iterative & collaborative culture to move fast in building tech solutions. Rebel is not a usual workplace. The following slides will give you a sense of our culture, how Rebel conducts itself and who will be the best fit for our company. We suggest you go through it before making up your mind.\n\n  \n\nhttps://drive.google.com/file/d/1f8BsKluXEu\\_Ey04iFoFtG1ktoBs1-YRD/view",
    "created_at": "2025-02-07 18:10:49.382341+00"
  },
  {
    "companyName": "EPAM Systems",
    "externalUrl": "https://lt.linkedin.com/jobs/view/senior-lead-android-developer-at-epam-systems-4145771861?position=52&pageNum=0&refId=rptMurepdyh8RlT4Fa9Tmw%3D%3D&trackingId=S6hXfDlAS%2BxjPWO0g6o4wg%3D%3D",
    "description": "We are seeking a highly skilled and experienced **Senior/Lead Android Developer** to lead our team in developing cutting-edge mobile applications.  \n  \nThe ideal candidate will have a strong background in Android development and be well-versed in the latest technologies and best practices.  \n  \n**Responsibilities**  \n  \n  \n\n-   Design and develop high-quality Android applications using the latest technologies and best practices\n-   Collaborate with cross-functional teams to define project requirements and deliver solutions that meet customer needs\n-   Ensure the performance, quality, and responsiveness of applications by conducting thorough code reviews and testing\n-   Maintain code integrity, organization, and documentation\n\n**Requirements**  \n  \n  \n\n-   Proficiency in Kotlin and Android SDK\n-   Background in using standard Android libraries like Retrofit and Glide\n-   Skills in implementing architectural patterns like MVP and MVVM\n-   Knowledge of Android architecture components (optional)\n-   Understanding of animations, custom views, transitions, and complex layouts\n-   Familiarity with RxJava2 and mobile database solutions like Realm and Room (optional)\n-   Capability to adjust CI/CD pipelines using Bitrise (nice to have)\n-   Competency in refactoring and conducting code reviews (nice to have)\n\n**We offer**  \n  \n  \n\n-   Engineering Heritage: Best-in-class experts sharing a culture of engineering excellence and tackling complex engineering challenges for over 30 years.\n-   Advanced Tech Stack: Innovative projects where you can apply or enhance your expertise in Cloud, Data, AI, and other emerging technologies\n-   World-Class Clients: Work closely with 295+ of the Forbes Global 2000 on creating disruptive solutions that make a global impact\n-   Professional Growth: Exceptional support for career development with comprehensive resources for upskilling or reskilling in pioneering practices\n-   GenAI Community: Strong AI competencies with 600+ experts across 55+ locations driving GenAI-enabled transformation journeys\n-   Entrepreneurial Culture: If you're passionate and dedicated to improving business transformation, we provide the support you need to bring your ideas to life\n-   Hybrid Setup: The flexibility to work from any location in Lithuania, whether it's your home or our dynamic offices in Vilnius and Kaunas\n-   Other Benefits: Additional vacation and trust days, private health insurance, Employee Stock Purchase Plan and more\n\n**About EPAM**  \n  \n  \nEPAM is a leading global provider of digital platform engineering and development services. For over 30 years, our team has helped leading brands navigate the waves of digital transformation, building solutions that help them stay competitive through constant market disruption.  \n  \nWith offices in 55+ countries, EPAM has grown in Lithuania to over 1,200+ talented innovators in just 4 years. We foster creativity and unconventional ways of doing things, welcoming like-minded professionals to join us  \n  \n_Salary range €4.5K-€6.5K gross, based on your experience and interview results.  \n  \n__Feel free to work remotely from anywhere across Lithuania or connect with colleagues at our Vilnius and Kaunas offices.  \n  \n_",
    "created_at": "2025-02-07 18:10:47.776169+00"
  },
  {
    "companyName": "Astek",
    "externalUrl": "https://pl.linkedin.com/jobs/view/android-developer-at-astek-4145942815?position=19&pageNum=0&refId=rptMurepdyh8RlT4Fa9Tmw%3D%3D&trackingId=ZmBMjpaTDXCaTPzQNXvXUg%3D%3D",
    "description": "**_ASTEK_** to międzynarodowa firma o francuskich korzeniach, która istnieje od ponad 30 lat. **_Astek Group_** jest globalnym graczem w obszarze konsultingu usług IT obecnym na 5 kontynentach. W Polsce na naszym pokładzie jest obecnie 1700 konsultantów o profilach głównie IT i non-IT. To co nas wyróżnia to duża ilość projektów informatycznych z wielu branż takich jak: bankowość, telekomunikacja, ubezpieczenia, pharma, finance, hi-tech.\n\n  \n\nAktualnie poszukujemy proaktywnej osoby na stanowisko Android Developera gotowej na nowe wyzwania :)\n\n  \n\n**_Lokalizacja:_**\n\nPraca zdalna100%\n\n  \n\n**Stawka:**\n\nUoP: 16000-18000 zł brutto\n\nB2B: 1080-1200 zł netto + vat/dzień\n\n  \n\n**Twoje codzienne zadania:**\n\n-   rozwój aplikacji Soft Phone (VoIP & SIP),\n-   współpraca z zespołem UX/UI w celu tworzenia intuicyjnych interfejsów użytkownika,\n-   udział w analizie wymagań i planowaniu funkcjonalności aplikacji,\n-   testowanie aplikacji, zapewnianie wysokiej jakości kodu oraz rozwiązywanie problemów związanych z błędami,\n-   współpraca z zespołem backendowym w celu integracji aplikacji z systemami serwerowymi.\n\n.\n\n**Czego oczekujemy od Ciebie?**\n\n  \n\n-   masz minimum 4 lata doświadczenia na stanowisku Android Developera,\n-   masz duże doświadczeniem w technologiach VoIP, w szczególności SIP,\n-   posiadasz doświadczenie w rozwoju zarówno backendu i frontendu,\n-   masz doświadczenie w tworzeniu interfejsu na zasadach user-friendly,\n-   znasz język angielski na poziomie umożliwiającym swobodną komunikację w mowie i piśmie (min. B2).\n\n  \n\n**Co Ci oferujemy?**\n\n-   Atrakcyjny i przejrzysty system płatności\n-   Stabilne zatrudnienie w oparciu o umowę o pracę\n-   Szkolenia\n-   Możliwość rozwoju zawodowego w międzynarodowym środowisku - naszymi klientami są znane polskie i światowe marki\n-   Wymiana wiedzy i doświadczeń z innymi współpracownikami\n-   Budowanie sieci zawodowych i nawiązywanie kontaktów\n-   Tworzenie Centrów Kompetencyjnych do gromadzenia wiedzy\n-   Organizacja wydarzeń wewnętrznych i zewnętrznych dla doskonalenia umiejętności\n-   Dostęp do nowych możliwości rozwoju zawodowego\n-   Wsparcie ze strony Managerów Centrów Kompetencyjnych i Zasobów\n-   Uczestnictwo w prestiżowych szkoleniach prowadzonych przez Ekspertów\n-   Analiza trendów technologicznych i tworzenie podgrup kompetencyjnych\n\n  \n\n_Dołączając do Nas stajesz się częścią Centrum Kompetencyjnego poświęconego Twojej ekspertyzie!_\n\n  \n\n_🙋 To nie o Tobie? Poleć nam znajomego i zgarnij bonus do 7000 zł!_\n\n_Szczegóły: astek.pl/system-rekomendacji/_",
    "created_at": "2025-02-07 18:10:47.776169+00"
  },
  {
    "companyName": "Greenely",
    "externalUrl": "https://se.linkedin.com/jobs/view/android-developer-contractor-position-at-greenely-4122416138?position=17&pageNum=0&refId=rptMurepdyh8RlT4Fa9Tmw%3D%3D&trackingId=EmulhJmTxMsoHsdiw96wLg%3D%3D",
    "description": "Are you ready to make a powerful impact in the world of sustainable energy? Greenely is on a mission to revolutionize how families manage their electricity needs, and we're looking for a talented Android Developer to join our dynamic team. At Greenely, we're not just about reducing energy bills; we're empowering households to become champions of Europe's energy transition. As an Android Developer, you'll play a vital role in enhancing our core services within the Greenely app.  \n  \n**What You'll Be Doing**  \n  \n\n-   Transforming user stories into innovative technical solutions that enhance the Greenely Android app experience.\n-   Collaborating closely with our diverse team of engineers, designers, and backend experts from concept to release.\n-   Implementing analytics to ensure performance, quality, and responsiveness are always top-notch.\n-   Identifying and resolving bugs and performance bottlenecks to maintain a seamless user experience.\n-   Build reusable components and frameworks with a focus on code reusability and modularization.\n-   Implement and maintain a robust testing strategy, including unit testing, UI testing, and integration testing.\n-   Managing CI/CD pipelines to automate builds, testing, and deployment processes.\n-   Mentoring junior developers and contribute to team growth through knowledge sharing and code reviews.\n-   Leveraging modern AI tools and automation to improve development efficiency and scalability.\n\n**What You'll Need To Succeed**  \n  \nWe believe that you’re passionate about creating user-centric experiences that solve real-world problems. Your analytical mindset allows you to break down complex issues into actionable solutions. As a person who thrives in startup environments, you excel at problem-solving and collaboration. You're also a confident communicator who isn't afraid to challenge conventions. We also believe that you have;  \n  \n\n-   5+ years of experience as an Android Developer, with a strong portfolio showcasing your expertise.\n-   A solid understanding of software architecture, design principles, and relevant patterns.\n-   Proficiency in Kotlin programming language and asynchronous programming concepts.\n-   Experience with Android SDK, Android Studio, and Git.\n-   Familiarity with RESTful APIs and Agile methodologies.\n\nIt’s meritorious if you are familiar with Jetpack Compose, Kotlin Coroutines, and Flows is also a bonus.  \n  \n**What We Can Offer You 🏢👩‍💻**  \n  \n\n-   Flexibility: Enjoy working remotely from your preferred location that's +/- 3 hours from the CET timezone.\n-   Growth: Even though you're working on a consulting basis - we make sure to give opportunities for skill development, challenging projects, and advancement within our forward-thinking organization.\n-   Influence and Impact: Your voice matters. Shape the future of energy by contributing your ideas, expertise, and playing a key role in decision-making.\n-   Innovative Environment: Thrive in an ever-changing industry, working on cutting-edge projects and staying ahead of the curve in a dynamic and pioneering work atmosphere.\n\n**About Greenely**  \n  \nGreenely aims to create the best customer experience for the modern energy consumer through technology. Greenely’s integrated mobile application enables households to optimize their energy consumption, reduce their electricity costs, and participate in grid-balancing services. By connecting various energy assets in the home, Greenely’s platform allows consumers to manage their energy usage efficiently while contributing to the stability of the power system. Greenely’s solution addresses the challenges of the modern energy landscape and promotes a more efficient, sustainable, and reliable power system. By providing consumers with savings and new revenue streams, Greenely drives the transition to a cleaner and more resilient energy system.  \n  \nWE ARE **bold and push the limit.**  \n  \nWE BELIEVE THAT **f******ast is better than slow.**  \n**  \nWE **t********hink like owners.**  \n**  \n**WE ****lead with knowledge.****  \nGreenely is on a mission to create the best customer experience for the modern energy consumer by using technology. We are a digital energy provider that helps people reduce their electricity costs by optimizing the home and car's electricity usage with smart technology in an app.  \n  \nGreenely, with the support of Nordic venture capital companies, has a mission to make it possible for households all over the world to connect, control and optimize their energy usage. We ultimately believe that the best electricity is the one that is not used at all, both for the wallet and the planet!",
    "created_at": "2025-02-07 18:10:47.776169+00"
  },
  {
    "companyName": "RedRock Resourcing",
    "externalUrl": "https://uk.linkedin.com/jobs/view/senior-android-developer-x-2-3-new%21-refgj5-at-redrock-resourcing-4146913493?position=8&pageNum=0&refId=rptMurepdyh8RlT4Fa9Tmw%3D%3D&trackingId=Hvx5tSVQr%2BB9bbzz71yByg%3D%3D",
    "description": "**Senior Android Developer x 2/3 - New! (REFGJ5)**\n\n  \n\n**Salary:** Up to £70k per annum + Excellent benefits\n\n  \n\nDue to periods of growth and expansion a leading organisation is recruiting now. My client is looking for talented Android Developers to assist the development of complex features and architectural enhancements, ensuring scalability, performance, and maintainability of a Android app.\n\n  \n\n**Ideal candidates will have the following:**\n\n  \n\n-   Proven experience as an Android engineer, with a significant portion of that experience at fast-paced, consumer-focused companies.\n-   Proven track record of successfully delivering and scaling Android applications with a large user base.\n-   Strong proficiency in Android Kotlin and deep understanding of Android frameworks and APIs.\n-   Strong experience with CI/CD & frequent release cadence.\n-   Experience with engineering complex mobile app architectures, including data modelling, networking, caching, and synchronisation.\n-   Excellent problem-solving and debugging skills, with a passion for writing clean, efficient, and maintainable code.\n-   Effectively convey complex technical concepts to both technical and non-technical stakeholders.\n-   Proactive and self-driven, with the ability to take ownership of projects and drive them to completion.\n\n  \n\n**Key Responsibilities:**\n\n  \n\n-   Collaborate closely with product, design, and other cross-functional teams to define and drive the technical roadmap and architecture for the Android application.\n-   Comfortably contribute to the development of complex features and architectural enhancements, ensuring scalability, performance, and maintainability of the Android app.\n-   Champion the delivery high-quality code while operation as a high performing engineer.\n-   Conduct thorough code reviews, ensuring adherence to best practices, code standards, and design principles.\n-   Continuously work with backend, frontend and leadership teams to enhance the Android App Design.\n\n  \n\nExcellent opportunity to join a leading organisation during a period of growth and change.\n\n  \n\nPlease send CV for full job description and an informal chat.",
    "created_at": "2025-02-07 18:10:47.776169+00"
  },
  {
    "companyName": "RedRock Resourcing",
    "externalUrl": "https://uk.linkedin.com/jobs/view/senior-android-developer-x-2-3-new%21-refgj5-at-redrock-resourcing-4146915255?position=4&pageNum=0&refId=rptMurepdyh8RlT4Fa9Tmw%3D%3D&trackingId=b8Sl8dpp5Rinnc%2BfwGM2%2FA%3D%3D",
    "description": "**Senior Android Developer x 2/3 - New! (REFGJ5)**\n\n  \n\n**Salary:** Up to £70k per annum + Excellent benefits\n\n  \n\nDue to periods of growth and expansion a leading organisation is recruiting now. My client is looking for talented Android Developers to assist the development of complex features and architectural enhancements, ensuring scalability, performance, and maintainability of a Android app.\n\n  \n\n**Ideal candidates will have the following:**\n\n  \n\n-   Proven experience as an Android engineer, with a significant portion of that experience at fast-paced, consumer-focused companies.\n-   Proven track record of successfully delivering and scaling Android applications with a large user base.\n-   Strong proficiency in Android Kotlin and deep understanding of Android frameworks and APIs.\n-   Strong experience with CI/CD & frequent release cadence.\n-   Experience with engineering complex mobile app architectures, including data modelling, networking, caching, and synchronisation.\n-   Excellent problem-solving and debugging skills, with a passion for writing clean, efficient, and maintainable code.\n-   Effectively convey complex technical concepts to both technical and non-technical stakeholders.\n-   Proactive and self-driven, with the ability to take ownership of projects and drive them to completion.\n\n  \n\n**Key Responsibilities:**\n\n  \n\n-   Collaborate closely with product, design, and other cross-functional teams to define and drive the technical roadmap and architecture for the Android application.\n-   Comfortably contribute to the development of complex features and architectural enhancements, ensuring scalability, performance, and maintainability of the Android app.\n-   Champion the delivery high-quality code while operation as a high performing engineer.\n-   Conduct thorough code reviews, ensuring adherence to best practices, code standards, and design principles.\n-   Continuously work with backend, frontend and leadership teams to enhance the Android App Design.\n\n  \n\nExcellent opportunity to join a leading organisation during a period of growth and change.\n\n  \n\nPlease send CV for full job description and an informal chat.",
    "created_at": "2025-02-07 18:10:47.776169+00"
  },
  {
    "companyName": "Pochies Home Services",
    "externalUrl": "https://www.glassdoor.co.in/job-listing/android-backend-developer-pochies-home-services-JV_KO0,25_KE26,47.htm?jl=1009628366992",
    "description": "**Responsibilities:**\n\n-   Design and implement robust and scalable backend solutions for Android applications.\n-   Develop and maintain RESTful APIs and other backend services.\n-   Integrate Android applications with existing backend systems and third-party services.\n-   Write clean, well-documented, and testable code.\n-   Collaborate with Android developers, product managers, and other stakeholders to define and implement features.\n-   Optimize backend performance and ensure data integrity.\n-   Monitor and troubleshoot backend issues.\n-   Stay up-to-date with the latest technologies and trends in backend development and Android ecosystem.\n-   Contribute to the improvement of our development processes and best practices.\n-   Participate in code reviews and provide constructive feedback.\n-   Deploy and maintain backend services in cloud environments (e.g., AWS, GCP, Azure).\n-   Work with databases (e.g., SQL, NoSQL) to store and retrieve data efficiently.\n\n**Required Skills:**\n\n-   Strong understanding of backend development principles and best practices.\n-   Proficiency in at least one backend programming language (e.g., Java, Kotlin, Python, Node.js, Go). Experience with Kotlin is a plus.\n-   Experience with RESTful API design and development.\n-   Familiarity with database technologies (e.g., MySQL, PostgreSQL, MongoDB, Redis).\n-   Experience with cloud platforms (e.g., AWS, GCP, Azure).\n-   Understanding of version control systems (e.g., Git).\n-   Excellent problem-solving and debugging skills.\n-   Strong communication and collaboration skills.\n-   Experience with Agile development methodologies.\n\n**Preferred Skills:**\n\n-   Experience with Android app development.\n-   Knowledge of mobile backend as a service (MBaaS) platforms (e.g., Firebase, AWS Amplify).\n-   Experience with containerization technologies (e.g., Docker, Kubernetes).\n-   Familiarity with CI/CD pipelines.\n-   Understanding of security best practices for backend development.\n-   Experience with performance optimization and scaling backend systems.\n\nJob Type: Full-time\n\nPay: ₹25,364.63 - ₹35,000.14 per month\n\nSchedule:\n\n-   Day shift\n\nEducation:\n\n-   Bachelor's (Preferred)\n\nExperience:\n\n-   Programming: 10 years (Preferred)\n-   total work: 6 years (Preferred)\n\nWork Location: Remote",
    "created_at": "2025-02-06 08:17:31.213029+00"
  },
  {
    "companyName": "Sporty Group",
    "externalUrl": "https://www.indeed.com/rc/clk?jk=ead243dbd148f264&bb=OkPI1flybyKZl37dSvOYI1Eb1YCKWaFiM2p-WJAx6orPM0-q9vcVxULIvGOeY3dwleUe_RyB5VSl9JEheTPGvF-McZCsaZ8AuSrdOZZeQT2QweZBT2wCF86j2_Elbjxe&xkcb=SoDE67M32tCjNuRYVJ0GbzkdCdPP&fccid=b51b360fa7cacea7&vjs=3",
    "description": "**Who We Are**\n\nSporty Group is a consumer internet and technology business with an unrivalled sports media, gaming, social and fintech platform, which serves millions of daily active users across the globe via technology and operations hubs in more than 10 countries and 3 continents.\n\nThe recipe for our success is to discover intelligent and energetic people, who are passionate about our products and serving our users and attract and retain them with a dynamic and flexible work life, which empowers them to create value and rewards them generously based upon their contribution.\n\nWe have already built a capable and proven team of 450+ high achievers from a diverse set of backgrounds and we are looking for more talented individuals to drive further growth and contribute to the innovation, creativity and hard work that currently serves our users further via their grit and innovation.\n\n  \nSporty's sites are some of the most popular on the internet, consistently staying in Alexa's list of top websites for the countries they operate in.\n\n  \nAs an Android Engineer at Sporty you’ll be responsible for applying the latest and greatest technologies and frameworks to ensure a smooth user experience for a massive user base.\n\n**Our Stack**\n\n  \nLanguages: Java / Kotlin\n\nArchitecture: MVVM\n\nNetwork: Retrofit, Okhttp, Protocol buffers\n\nDependency Injection: Dagger 2\n\nCI/CD: Jenkins\n\nOther: Android JetPack, Glide, Git, ExoPlayer\n\n**Responsibilities**\n\n  \nCollaborate with Product Managers, Designers and Backend Engineers to design and deliver high-quality products on Android\n\nBuild end-to-end features of the app: networking, persistence, business logic, and UI\n\nBuild efficient and reusable mobile components and architect reliable, performant, and scalable mobile solutions\n\nIdentify areas of improvement and advocate for mobile best practices\n\nAnalyze and optimize UI and infrastructure application code for quality, efficiency, and performance\n\nMentoring less experienced team members\n\n**Requirements**\n\n  \n4+ years of application development experience in Android\n\nProficiency with Java, Kotlin and the Android development ecosystem\n\nEnjoy working on mobile apps at all levels – from networking up to user interfaces and everything in between\n\nUnderstand and have experience making decisions about mobile application architecture, including data modeling, networking and data synchronization and concurrency\n\nExperience building maintainable and testable code bases, including API design and unit testing techniques\n\nExperience with multithreading programming and mobile memory management\n\nGood communication and collaboration skills to be able to work in a fast paced and distributed environment\n\nPrevious history of working with a remote, distributed team would be beneficial\n\n**Bonus Requirement**\n\n  \nExperience with mobile video playback and streaming technologies\n\n  \n\n**Benefits**\n\n  \nPermanent remote based\n\nQuarterly Performance Bonus\n\nTop-of-the-line Equipment (MacBook Pro)\n\nReferral Hire Bonus\n\nHealth and Life Insurance\n\nOn-call payment\n\nPaid leaves of 21 days (excluding 12 public holidays)\n\n5 Days working\n\nTeam Fun activities\n\nAnnual company retreat - Dubai in 2022 and Phuket in 2023\n\nHighly talented, dependable co-workers in a global, multicultural organisation\n\nOur teams are small enough for you to be impactful\n\nOur business is globally established and successful, offering stability and security to our Team Members\n\n**Our Mission**\n\n  \nOur mission is to be an everyday entertainment platform for everyone\n\n**Our Operating Principles**\n\n  \n1\\. Create Value for Users\n\n2\\. Act in the Long-Term Interests of Sporty\n\n3\\. Focus on Product Improvements & Innovation\n\n4\\. Be Responsible\n\n5\\. Preserve Integrity & Honesty\n\n6\\. Respect Confidentiality & Privacy\n\n7\\. Ensure Stability, Security & Scalability\n\n8\\. Work Hard with Passion & Pride\n\n**Interview Process**\n\n  \n60 min HackerRank Test\n\nRemote video screening with our Talent Acquisition Team\n\nRemote 90 min video interview loop with 3 x Team Members (30 mins each)\n\nPre-offer call with Talent Acquisition Team\n\n24-72 hour feedback loops throughout process  \n\n  \n\n**Working at Sporty**\n\n  \nThe top-down mentality at Sporty is high performance-based, meaning we trust you to do your job with an emphasis on support to help you achieve, grow and de-block any issues when they're in your way.\n\nGenerally employees can choose their own hours, as long as they are collaborating and doing stand-ups etc. The emphasis is really on results.\n\n  \nAs we are a highly structured and established company we are able to offer the security and support of a global business with the allure of a startup environment. Sporty is independently managed and financed, meaning we don’t have arbitrary shareholder or VC targets to cater to.\n\n  \nWe literally build, spend and make decisions based on the ethos of building THE best platform of its kind. We are truly a tech company to the core and take excellent care of our Team Members.",
    "created_at": "2025-02-06 08:17:25.149125+00"
  },
  {
    "companyName": "Bridgenext",
    "externalUrl": "https://in.linkedin.com/jobs/view/sr-android-developer-at-bridgenext-4145546517?position=9&pageNum=0&refId=kwYTs%2B%2BKOUOBbg8hwJoKog%3D%3D&trackingId=oUgwPvEdbZIyaYppGFXlfA%3D%3D",
    "description": "**Job ID:** Sr-ETP-Pun-971  \n  \n**Location:** Pune  \n  \n\n-   5+ years experience in developing Android applications\n-   Strong proficiency in Android SDK\n-   Thorough understanding of Kotlin and its core concepts\n-   Complete understanding of application lifecycle.\n-   Experience with Push Notifications and RESTful / SOAP APIs\n-   Good experience with UI development, Jetpack Compose.\n-   Experience with View-State management\n-   Experience with Offline data storage, Concurrency, and Performance tuning\n-   Familiarity with code versioning tool Git and task management tools like Jira\n-   Adapt with unit, integration, performance, and UI testing.",
    "created_at": "2025-02-06 08:17:12.763468+00"
  },
  {
    "companyName": "PLAYTOMIC",
    "externalUrl": "https://es.linkedin.com/jobs/view/senior-mobile-developer-payments-at-playtomic-4146239945?position=20&pageNum=0&refId=bqVlETWmvsUNNk1iaQuTyg%3D%3D&trackingId=LvU0vzweHURA7jqQdYbhUA%3D%3D",
    "description": "****🎯 Your mission**  \n**  \nAs a Senior Mobile Engineer in the Payments team at Playtomic, you will be responsible for developing robust and scalable payments solutions for our product. You’ll also work collaboratively with the Payments team in order to ensure high performance and consistent and secure transactions.  \n  \n**👩🏽‍💻 What You’ll Be Doing**  \n  \n\n-   Support the entire development lifecycle (concept, design, test, release and support)\n-   Build and improve our existing payments layer app-side\n-   Produce fully functional app features writing clean code\n-   Collaborate with the team setting up new quality standards and research plans\n-   Write unit tests to identify malfunctions\n-   Troubleshoot and debug to optimize performance\n-   Design interfaces to improve user experience\n-   Liaise with Product development team to plan new features\n-   Stay up-to-date with new technology trends\n\n**👥 Who You’ll Be Playing With**  \n  \nYou will be part of the engineering team (30 people) reporting directly to an Engineering Manager, working in the Payments team in daily collaboration with Product and other engineers.  \n  \n****🦄 Our Ideal \"Player\"**  \n**  \n\n-   Experience with payment gateway integrations and secure transaction processing is a must.\n-   Solid experience in iOS or Android, with at least some minor experience in the other platform.\n-   Solid experience in at least one of Swift or Kotlin\n-   Experience building UI with UIKit or Android views\n-   Strong background on unit testing\n-   Strong communication skills to convey complex technical concepts to non-technical stakeholders.\n-   Strong analytical and problem-solving skills with a proactive approach to identifying and addressing technical challenges.\n-   Ability to adapt to a fast-paced and dynamic work environment, with a focus on delivering high-quality solutions within specified timelines.\n-   Located in Madrid or able to travel to Madrid when needed\n-   Excellent spoken and written English is a must\n-   Degree in Computer Science, Engineering, or related field\n\n****🤓 Extra points**  \n**  \n\n-   Proven track record in designing and implementing payment systems or financial platforms.\n-   Experience working with remote and partially remote and multicultural teams.\n-   Experience working in start-ups and scale-ups\n-   Located in Madrid or able to commute to Madrid several times per month\n\n**🤝 What’s In It For You**  \n  \n\n-   Salary: 55-70K €\n-   23 days of vacation + day off on your birthday + 2 days off for Wellness days in August.\n-   1 additional day off per year worked.\n-   Hybrid / Remote work.\n-   Flexibility to attend team-building events.\n-   Social benefits (63€ a month in one of these: health insurance/tickets restaurant), flexible spending (pre-tax) in training, kindergarten, and transportation.\n-   Gympass discount.\n-   Perks related to the brand and our sponsorship agreements.\n-   Summer work schedule (July-August: 7h/day, Monday to Friday).\n\n****➡️ Our hiring process**  \n**  \n\n-   Cultural fit with People - 30 min\n-   Tech assessment (online test) - 40min\n-   Technical interview with Tech Leads - 60 min\n-   Cultural fit + technical interview with EM's - 60 min\n-   Cultural fit with Product- 30 min\n\n**About PLAYTOMIC 🎾**  \n  \nWe are world’s largest racket sports App for players and clubs. Our goal is to socialize sports practice: through the app, players can book courts, find other players with similar skill levels, and join a social community dedicated to playing.  \n  \nSince 2017, Playtomic has earned the trust of national and international investors, consolidating it as one of the main world players in sports digitalization. You will find +150 co-workers around the world with headquarters in Spain and offices in Madrid, Italy, Portugal, Sweden, Finland, Belgium, UK, EEUU and Mexico.  \n  \nTake a look to our candidate playbook!",
    "created_at": "2025-02-07 05:46:18.634976+00"
  },
  {
    "companyName": "SEPAL",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-sepal-3155820841?position=60&pageNum=0&refId=NtBXI8fZuHFpqRk3MO6byA%3D%3D&trackingId=qR52HhPrRMMMcdhUmx%2Fq7A%3D%3D",
    "description": "**Job description**\n\nWe are a young startup working towards revolutionizing the bike riding experience for millions of people across the globe. Our cutting-edge solution is designed to convert any regular 2-wheeler into a smart bike with all the features of android-auto and more.\n\nOn this hyper exciting path, we are looking for a highly skilled, passionate developers who is comfortable with both front and back end programming. Full stack developers are responsible for developing and designing front end web/app architecture, ensuring the responsiveness of applications, and working alongside graphic designers for web design features, among other duties.\n\nYou will be required to see out a project from conception to final product, requiring good organizational skills and attention to detail.\n\nWe are looking for Core member who is capable of taking complete responsibility for the APP development and drive the growth with ingenuity and technical knowledge. Accordingly, we will be compensating you with a mixture of Cash and ESOPs with massive potential.\n\n**Roles and Responsibilities**\n\n-   Developing front end Android/ Website architecture.\n-   Implementing immersive and intricate user-experience\n-   In-Depth Knowledge in building Android application\n-   In-Depth of knowledge of implementing google API’s and other SDKs\n-   Knowledge of integrating Bluetooth, NFC and OTG devices\n-   Ensuring cross-platform optimization for mobile phones.\n-   Ensuring responsiveness of applications.\n-   Working alongside graphic designers for app design features.\n-   Seeing through a project from conception to finished product.\n-   Designing and developing APIs, SDKs for our application\n-   Meeting both technical and consumer needs.\n-   Staying abreast of developments in web applications and programming languages.\n\n**Desired Candidate Profile**\n\n-   Degree in computer science.\n-   Strong organizational and project management skills.\n-   Experience in working with **SQLite Database, Google Maps API, GPS Location Data**, and experience in web service protocols such as **JSON, XML, SOAP, REST.**\n-   Experience in working with apps related to **NFC, BLUETOOTH, WIFI**.\n-   Experience in protocols such as **XMPP, SIP** and experience in using **Version Control (SVN,GITHUB,SOURCE TREE). Experience in using RETROFIT and Volley Library.**\n-   Experience in use of popular **public APIs, such as Google, Facebook, YouTube and Twitter**.\n-   Experience using social media APIs.\n-   Experience in native applications **(NDK)**\n-   Good communication skills: during development of the mobile applications.\n-   Experience in **AIDL** for intercommunication between applications.\n-   Familiarity with JavaScript frameworks such as Angular JS, React, and Amber.\n-   Proficiency with server-side languages such as Python, Ruby, Java, PHP, and .Net.\n-   Excellent verbal communication skills.\n-   Good problem-solving skills.\n-   Attention to detail.",
    "created_at": "2025-02-07 05:46:17.69739+00"
  },
  {
    "companyName": "KAURI ONE Inc",
    "externalUrl": "https://ua.linkedin.com/jobs/view/middle-android-developer-at-kauri-one-inc-4145059846?position=2&pageNum=0&refId=bqVlETWmvsUNNk1iaQuTyg%3D%3D&trackingId=Irf8Vfi0Ta0w5sC8dDmiTw%3D%3D",
    "description": "Kauri One is a software development company that creates Fintech-blockchain projects. We implement the entire range of financial instruments for processing fiat and cryptocurrencies in one system - Neo Bank. \n\nWe are looking for an enthusiastic and talented Android Developer to join our team. In this role, you will be responsible for building high-quality Android applications using modern technologies and best practices. You'll have the opportunity to work with Kotlin, Jetpack Compose, Firebase, and many other cutting-edge tools and libraries.\n\n  \n\n**What you need to have:**\n\n-   Proficiency in Kotlin, including Coroutines, Flow, and working with collections and data structures.\n-   Hands-on experience building modern UIs using Jetpack Compose, along with familiarity with Material Design principles.\n-   Solid understanding and practical experience with MVVM or Clean Architecture.\n-   Expertise in working with Retrofit, OkHttp, and Gson to handle API responses, optimize network requests, and improve performance.\n-   In-depth experience working with Room, including schema migrations and local data storage.\n-   Proficiency in integrating Firebase services (Crashlytics, Analytics, Remote Config, Messaging).\n-   Strong skills in writing unit tests and working with UI testing tools like Espresso and the Compose Test Framework.\n\n  \n\n**Will be a plus:**\n\n-   Experience working with Build Flavors and CI/CD pipelines.\n-   Knowledge of ProGuard/R8 for code shrinking and obfuscation.\n-   Experience working with SDKs like Trust Wallet for cryptocurrency management or SumSub for KYC verification.\n-   Familiarity with Biometric API for authentication and security.\n-   Understanding of localization and resource management.\n-   Web3 experience\n\n  \n\n**Responsibilities:**\n\n-   Design and develop Android apps with Kotlin using Android Studio and Jetpack Compose.\n-   Work within an MVVM architecture to ensure clean and maintainable code.\n-   Integrate Firebase SDKs for features like Crashlytics, Analytics, Remote Config, Messaging, etc.\n-   Use Room for local data storage with Kotlin Coroutines and Flow for efficient asynchronous programming.\n-   Collaborate on network integrations with Retrofit, OkHttp, and Gson to handle API communication.\n-   Contribute to unit testing and UI testing (JUnit, Espresso, Compose Test Framework).\n-   Participate in code reviews, follow best practices for app performance, and ensure a seamless user experience.\n\n  \n\n**We offer:**\n\n-   Worthy compensation based on interview\n-   Remote company with employees concentrated in Ukraine and Europe (Cyprus)\n-   Continuing education and support for select graduate programs\n-   Working with a team of open-minded specialists with a low hierarchy\n-   Career development opportunities with professional training programs\n-   The company is open to innovations and suggestions from the employee.\n\n  \n\n**If you are interested, please, send your updated CV and Telegram link :)**",
    "created_at": "2025-02-07 05:46:18.634976+00"
  },
  {
    "companyName": "Point Pi",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-point-pi-4142790496?position=34&pageNum=0&refId=NtBXI8fZuHFpqRk3MO6byA%3D%3D&trackingId=ixcJoT9HR7%2B10iff1Lv3JQ%3D%3D",
    "description": "**Description**  \n  \nWe are looking for a stellar Mobile App developer to help us build our next Android app for our IoT Devices/Application.  \n  \n**Responsibilities**  \n  \n\n-   Build our Android app for our IoT Devices/Applications\n-   Work with product owners to spec the requirements.\n-   Design, code, test and deliver various features in our product roadmap\n-   Fix customer issues as needed.\n-   Integration with Amazon Alexa, Google Home Kit and other third party platforms.\n\n**Requirements**  \n  \n**Required Skills:**  \n  \n\n-   4+ yrs experience in building Mobile apps for Android for Phone and tablet using Java\n-   2+ yrs experience in building Mobile apps for Android using Kotlin\n-   Strong UI development skills in terms of design\n-   2+ yrs in building/consuming APIs\n-   Hands on knowledge of IoT\n-   Hands on knowledge of Unix/Linux.\n-   Knowledge of any of the Application servers like Apache/ NginX\n-   Good oral and written communication skills in English\n\n**Preferred Skills**  \n  \n\n-   1+ yrs in building IoT/Embedded devices.\n-   2+ years experience in HTML, JS, AJAX, and related browser side web technology\n-   2+ yrs in Python, Php, Java, Node.js is desirable\n-   Strong networking knowledge.\n-   Experience with scrum development, Jira & Git\n\nSkills:- Android Development, Java and Kotlin",
    "created_at": "2025-02-07 05:46:17.69739+00"
  },
  {
    "companyName": "CGB SOLUTIONS",
    "externalUrl": "https://in.linkedin.com/jobs/view/sr-andriod-developer-at-cgb-solutions-4145487664?position=31&pageNum=0&refId=NtBXI8fZuHFpqRk3MO6byA%3D%3D&trackingId=WPtNnTpRSmIaB4oKkCXYbA%3D%3D",
    "description": "**Company Description**\n\nCGB Solutions is a Niche Player specializing in delivering customer solutions on Finacle, Oracle & ServiceNow. With an established presence in BFSI, we provide support to leading banks through our 300+ Finacle resources. Our Oracle Global Delivery Practice offers unmatched global and industry expertise across the full suite of Oracle Cloud Solutions.\n\n  \n\n**Role Description**\n\nThis is a full-time, on-site senior Android Developer role located in Bengaluru. The senior Android Developer will be responsible for developing and maintaining Android applications, collaborating with cross-functional teams to define, design, and ship new features. They will also ensure the performance and quality of applications, identify and correct bottlenecks, fix bugs, and maintain code quality.\n\n  \n\n**Location – Bangalore, Client Location**\n\n**Work from office**\n\n  \n\n**Qualifications**\n\n**Required Skills & Qualifications:**\n\n-   **5 to 10 years of experience in Android development.**\n-   **Strong knowledge of Kotlin, Java, and Android SDK.**\n-   **Proven experience as an iOS/Android Developer, with a strong portfolio of iOS applications on the App Store.**\n-    **Solid experience with Swift and Objective-C development languages.**\n-   **Strong experience integrating iOS applications with IoT technologies (e.g., Bluetooth, Wi-Fi).**\n-   **Familiarity with IoT protocols and standards (BLE, MQTT, HTTP/RESTful APIs, WebSockets).**\n-   **Experience with mobile app architecture and design patterns (MVC, MVVM, etc.).**\n-   **Solid understanding of networking concepts and how they relate to mobile applications (e.g., handling low-bandwidth, and latency issues).**\n-   **Hands-on experience with CoreBluetooth, CoreLocation, or other location-based services.**\n-   **Knowledge of REST APIs, and working with JSON or XML data formats.**\n-   **Familiarity with Xcode/Android Studio, Instruments, and debugging tools.**\n-   **Experience with Version Control Systems such as Git.**\n-   **Experience with unit testing, UI testing, and other automated testing frameworks.**\n-   **Good understanding of security best practices in mobile app development (e.g., OAuth, SSL/TLS, encryption).**\n-   **Excellent problem-solving skills and ability to work independently or as part of a team.**\n-   **Strong verbal and written communication skills, with the ability to collaborate across functions**\n-   **Experience with Android Jetpack Components (LiveData, ViewModel, Navigation, Room, WorkManager, etc.).**\n-   **Strong understanding of MVVM, MVP, and Clean Architecture.**\n-    **Familiarity with Xcode/Android Studio, Instruments, and debugging tools.**\n-   **Experience with RESTful APIs, Retrofit, OkHttp, and WebSockets.**\n-   **Hands-on experience with Google Play Store deployment & app maintenance.**\n-   **Good to have experience integrating iOS applications with IoT technologies (e.g., Bluetooth, Wi-Fi).**\n-   **Experience in performance optimization, debugging, and memory management.**\n-   **Proficiency in writing unit tests and UI tests.**\n-   **Familiarity with CI/CD pipelines, Jenkins, and GitHub Actions.**\n-   **Strong problem-solving and analytical skills.**\n-   **Good communication and teamwork skills.**",
    "created_at": "2025-02-07 05:46:17.69739+00"
  },
  {
    "companyName": "Where U Elevate",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-where-u-elevate-4145642956?position=18&pageNum=0&refId=NtBXI8fZuHFpqRk3MO6byA%3D%3D&trackingId=bWOiuMp1oN6IYtYC4kv2yw%3D%3D",
    "description": "**Job Summary:**\n\nWe are seeking an experienced **Android Developer** with **6+ years of experience** in **Kotlin and Core Java** to join our team.The ideal candidate will be responsible for understanding project requirements, modifying and enhancing existing Android applications, and developing new flows without disrupting current functionalities.\n\n**Responsibilities:**\n\n1.  Understand the requirements, and user story from the project stakeholders and implement the requirements\n2.  Understand the existing Android applications and should be able to modify the existing flows, fix the issues in the applications.\n3.  Create new flows without disrupting or breaking any existing application flows.\n4.  Perform the code reviews\n5.  Create design documents if needed\n6.  Provide the detailed status of the task\n\n**Qualification:**\n\n-   Bachelor’s degree in computer or IT\n-   6+ years of IT experience in Android development using Kotlin, Core Java\n-   Good Communication skills\n-   Experienced with following Agile processes",
    "created_at": "2025-02-07 05:46:17.69739+00"
  },
  {
    "companyName": "Bright Vision Technologies",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-bright-vision-technologies-4145087076?position=17&pageNum=0&refId=NtBXI8fZuHFpqRk3MO6byA%3D%3D&trackingId=OcwqanCoD7j4Ch048miFXw%3D%3D",
    "description": "Bright Vision Technologies has an immediate Full-time opportunity for Android Developer.  \n  \nJob Role: Android Developer  \n  \n**Bright Vision Technologies**  \n  \n**Your Path to a Successful Career in the U.S. Starts Here!**  \n  \n&#128188; **Now Accepting Applications for the H1B 2025 Lottery!**  \n  \nAt Bright Vision Technologies, we specialize in turning aspirations into reality. Whether you're an IT professional looking for growth or a recent graduate planning your next step, **we’ve got you covered!**  \n  \n**Why Partner with Us?**  \n  \n&#128313; **Proven Success**: A trusted partner in successful H1B filings for over a decade.  \n  \n&#128313; **End-to-End Support**: From documentation to final approval, we handle it all.  \n  \n&#128313; **Top Clients**: Access premium opportunities with Fortune 500 companies.  \n  \n&#128313; **Transparent Process**: Regular updates and personalized attention at every stage.  \n  \n&#128313; **Green Card Sponsorship**: Pathways to long-term residency for eligible candidates.  \n  \nAbout Bright Vision Technologies: Bright Vision Technologies is a rapidly expanding technology company specializing in innovative mobile solutions. We are dedicated to developing cutting-edge applications that enhance user experiences. We are currently seeking a skilled Android Developer to join our dynamic team and contribute to the creation of industry-leading mobile applications.  \n  \nJob Description: We are looking for a talented Android Developer to design, develop, and maintain high-quality mobile applications for the Android platform. As an Android Developer at Bright Vision Technologies, you will collaborate with cross-functional teams to deliver exceptional user experiences through intuitive and visually appealing interfaces. Your expertise in Android development will be vital in driving the success of our mobile applications.  \n  \nResponsibilities:  \n  \n\n-   Design, develop, and maintain efficient, reliable, and high-quality Android applications\n-   Collaborate with cross-functional teams to define, design, and implement new features\n-   Identify and resolve performance and usability issues\n-   Ensure the best possible performance, quality, and responsiveness of applications\n-   Continuously discover, evaluate, and implement new technologies to maximize development efficiency\n-   Stay up-to-date with the latest industry trends, best practices, and advancements in Android development\n-   Perform thorough testing to identify and fix bugs and improve application performance\n-   Participate in code reviews to maintain code quality standards\n-   Contribute to the entire app lifecycle, from concept to deployment and maintenance\n\nRequirements:  \n  \n\n-   Proven experience as an Android Developer or similar role, with a strong portfolio of Android applications\n-   Proficient in Java and Kotlin programming languages\n-   Solid understanding of the Android SDK, Android Jetpack, and other relevant frameworks\n-   Experience with RESTful APIs to connect Android applications to back-end services\n-   Knowledge of Android UI/UX design principles and best practices\n-   Familiarity with third-party libraries and APIs\n-   Strong understanding of the full mobile development life cycle\n-   Strong analytical and problem-solving skills\n-   Excellent teamwork and communication skills\n-   Self-motivated with a passion for mobile application development\n-   Ability to adapt to a fast-paced and collaborative work environment\n\nPreferred Qualifications:  \n  \n\n-   Bachelor's degree in Computer Science, Software Engineering, or a related field\n-   Experience with version control systems, such as Git\n-   Familiarity with Agile development methodologies\n-   Knowledge of continuous integration and deployment practices\n-   Experience with automated testing and debugging techniques\n\nJoin the Bright Vision Technologies team and be part of an exciting journey to shape the future of mobile applications. As an Android Developer, you will have the opportunity to work on innovative projects, collaborate with talented professionals, and contribute to the growth and success of our organization.  \n  \nTo apply, please submit your resume, portfolio, and any relevant code samples demonstrating your Android development skills. We look forward to reviewing your application and exploring the potential of working together to create exceptional mobile experiences.  \n  \nWould you like to know more about this opportunity? For immediate consideration, please send your resume directly to Dinesh Reddy at dinesh@bvteck.com  \n  \nAt BVTeck, we are committed to providing equal employment opportunities and fostering an inclusive work environment. We encourage applications from all qualified individuals regardless of race, ethnicity, religion, gender identity, sexual orientation, age, disability, or any other protected status. If you require accommodations during the recruitment process, please let us know.  \n  \nPowered by JazzHR  \n  \nbkprQI0zz8",
    "created_at": "2025-02-07 05:46:17.69739+00"
  },
  {
    "companyName": "Bee Talent Solutions",
    "externalUrl": "https://in.linkedin.com/jobs/view/senior-android-developer-at-bee-talent-solutions-4132542841?position=16&pageNum=0&refId=NtBXI8fZuHFpqRk3MO6byA%3D%3D&trackingId=zOOQ6BKxhYu1MwYrUPwYYw%3D%3D",
    "description": "We are looking for an experienced Android Engineer for our client in Bengaluru.\n\n  \n\nAs an Android engineer, you will use those superpowers to build and maintain SDKs and libraries, improve their entire onboarding process, SDKs, Quickstarts, Docs, and provide direct assistance to developers in their support channels. You will be the internal and external steward of the experience for the technologies that you love working with every day.\n\n  \n\nYou will be working in a cross-functional team alongside the developer evangelist, onboarding, growth, dashboard, community, tooling, and SDK teams to provide the best developer experience for the technologies you own. The most important qualifications for this position are software engineering expertise, empathy, and self-direction.\n\n  \n\n**Responsibilities:**\n\n-   Writing, curating, editing developer resources: tutorials, examples, guides, and documentation.\n-   Directly shaping and developing our open-source SDKs.\n-   Owning the code samples and implementation guidance.\n-   Gathering and channeling user feedback within the company to improve the experience for developers.\n-   The go-to expert in the company, internally and externally, providing domain knowledge and reviews in these technologies.\n-   Sharing your technical expertise at conferences and other tech events.\n-   Working on our Quickstart guides to delight our developers.\n-   Troubleshooting and fixing issues with our libraries.\n\n  \n\n**Skills:**\n\n-   5 + years of expertise in Android development\n-   Have developed Android libraries or SDKs to be consumed by other developers\n-   Have a good understanding of the Android frameworks & ecosystem and have created mobile applications that have seen the light of day\n-   Have hybrid library development experience (React Native, Flutter)\n-   Understanding of CI platforms such as GitHub Actions or CircleCI\n-   Understanding of testing mobile applications in a CI environment\n-   You are able to work in a team environment, have good communication skills and understand the value of collaboration\n-   A deep understanding of writing, running, maintaining and debugging applications.\n-   Excellent written and verbal communication skills: presenting, documenting, troubleshooting.\n-   Demonstrable experience authoring developer documentation (tutorials, blog posts, docs).\n-   The ability to be self-directed and be effective working independently, yet feel equally comfortable contributing in a global team environment.\n\n  \n\n**Bonus points if you have:**\n\n-   Experience with iOS (Swift & Objective-C))\n-   Experience working in distributed teams and work environments.\n-   Created open-source material or have contributed to open-source projects.\n-   Your own technical blog or published articles on popular Android sites.\n-   Knowledge in the identity and access management space.",
    "created_at": "2025-02-07 05:46:17.69739+00"
  },
  {
    "companyName": "Societe Generale Global Solution Centre",
    "externalUrl": "https://in.linkedin.com/jobs/view/senior-software-engineer-andriod-mobile-development-native-at-societe-generale-global-solution-centre-4146018899?position=4&pageNum=0&refId=NtBXI8fZuHFpqRk3MO6byA%3D%3D&trackingId=8ebwGxZQDMTlPnDPmSSR4g%3D%3D",
    "description": "**Responsibilities:**\n\n-   Collaborate with cross-functional teams to define, design, and ship new features\n-   Write clean, maintainable and reusable code following best practices (SOLID principles, Clean Architecture)\n-   **Implement robust application architecture (MVVM, MVI or MVP) to ensure scalability and maintainability**\n-   Designing and building advanced applications for the Android platform\n-   Collaborate with the rest of the engineering team to design and launch new features.\n-   Monitor the performance of apps and make improvements as required.\n-   Write and maintain codes.\n-   Work on bug fixing and improving application performance\n-   Research continuously and acquire the latest technologies for maximum efficiency.\n-   Maintain code integrity and organization.\n-   Knowledge sharing across the team\n\n  \n\n**Profile Required:**\n\n-   **5+ years solid and proven work experience in Android development (banking experience would be a plus)**\n-   **5+ years Software experience in coding with Kotlin**\n-   **Deep understanding of Android SDK, Jetpack libraries and material design principles**\n-   **Experience in Mobile API design, performance optimization, client architecture, or tools in the mobile space.**\n-   Experience working with remote data via REST and JSON\n-   Experience with third-party libraries and APIs\n-   Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies\n-   **Experience with Google Approval & Distribution Process (would be a plus)**\n-   Ability to become a T-shape engineer with specialized knowledge who can also think broadly about a variety of areas and apply their knowledge at work.( would be a plus)\n-   Solid understanding of the full mobile development life cycle\n-   Proficient understanding of code versioning tools\n-   Unit-test code for robustness, including edge cases, usability, and general reliability\n-   Familiarity with continuous integration\n-   **Collaborative tools: Jira, GIT, Confluence**\n-   Experience with CI/CD pipelines would be a plus\n-   Open minded about learning new mobile technologies;\n-   **Strong problem-solving skills and ability to think critically**\n-   Excellent communication and collaboration skills\n-   Ability to mentor junior developers and lead technical discussions\n-   Good understanding of Agile and Scrum methodologies;\n\nYou are able to work in a global multi-cultural environment\n\n  \n\n  \n\n**Environment**\n\nAt Société Générale, we are convinced that people are drivers of change, and that the world of tomorrow will be shaped by all their initiatives, from the smallest to the most ambitious.\n\nWhether you’re joining us for a period of months, years or your entire career, together we can have a positive impact on the future. Creating, daring, innovating and taking action are part of our DNA.\n\nIf you too want to be directly involved, grow in a stimulating and caring environment, feel useful on a daily basis and develop or strengthen your expertise, you will feel right at home with us!\n\n**Still hesitating?**\n\nYou should know that our employees can dedicate several days per year to solidarity actions during their working hours, including sponsoring people struggling with their orientation or professional integration, participating in the financial education of young apprentices and sharing their skills with charities. There are many ways to get involved.\n\nWe are committed to support accelerating our Group’s ESG strategy by implementing ESG principles in all our activities and policies. They are translated in our business activity (ESG assessment, reporting, project management or IT activities), our work environment and in our responsible practices for environment protection.\n\n**Why Join Us**\n\n“We are committed to creating a diverse environment and are proud to be an equal opportunity employer. All qualified applicants receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status”.",
    "created_at": "2025-02-07 05:46:17.69739+00"
  },
  {
    "companyName": "Discoveries Quintessential",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-discoveries-quintessential-4143737984?position=54&pageNum=0&refId=oi4Ci6QOFOckHWY1qMQ%2B%2Fw%3D%3D&trackingId=Ufc%2BkfJuX615iqwPB9aMmw%3D%3D",
    "description": "**Position:** Android Developer\n\n**Location**: Pune\n\n**Department:** Engineering\n\n  \n\n**Overview:**\n\nWe are looking for a talented Android Developer with experience in building high-performance,\n\nscalable, and secure mobile applications for the Android platform. The ideal candidate will\n\nhave good grasp in Java and/or Kotlin and the Android SDK, as well as a solid understanding\n\nof mobile app lifecycle, UI/UX best practices, and performance optimization. You will be\n\nresponsible for developing and maintaining Android apps, collaborating with backend\n\ndevelopers to integrate APIs, and ensuring a seamless user experience across devices.\n\n  \n\n**Key Responsibilities:**\n\n● Design, develop, and maintain mobile applications for the Android platform using Java\n\nand/or Kotlin.\n\n● Work closely with the backend team to integrate RESTful APIs and ensure smooth\n\ncommunication between the mobile app and backend services.\n\n● Optimize mobile apps for performance, reliability, and scalability, ensuring smooth user\n\nexperiences even in resource-constrained environments.\n\n● Leverage Android NDK for performance-sensitive features or to work with low-level\n\nsystem libraries and hardware components.\n\n● Knowledge of app security best practices (e.g., data encryption, securing API keys)\n\n● Implement secure authentication and authorization mechanisms (e.g., OAuth, JWT)\n\nto safeguard user data and ensure app security.\n\n● Write unit and integration tests to ensure code quality and prevent regressions using\n\ntools such as JUnit and Espresso.\n\n● Debug and troubleshoot issues across a variety of Android devices and OS versions,\n\nensuring cross-device compatibility.\n\n● Participate in code reviews, ensuring the code is clean, well-structured, and\n\nmaintainable.\n\n● Handle the app deployment process to Google Play Store, including versioning,\n\ncompliance, and submission requirements.\n\n● Open to learn and work in any and all latest technologies.\n\n  \n\n**Technologies Required:**\n\n● Kotlin or Java for Android development\n\n● Android SDK and Android Studio for app development and testing\n\n● Android NDK (Native Development Kit) for building native libraries and performance-\n\ncritical features\n\n● RESTful API integration\n\n● Gradle for project automation and dependency management\n\n● Version control using Git (GitHub, GitLab, Bitbucket, etc.)\n\n● JSON for data interchange between mobile app and backend services\n\n● Push Notifications (Firebase Cloud Messaging, etc.)\n\n● Knowledge of SQLite and Room Database for local storage on Android\n\n● Firebase for authentication, cloud messaging, push notifications, and real-time data\n\n● Android Jetpack libraries (e.g., Navigation, LiveData, ViewModel, etc.)\n\n● Familiarity with Google Play Console for app submission, versioning, and compliance\n\nwith Google’s app store policies\n\n● Knowledge of App bundles and Gradle build flavors for app distribution\n\n  \n\nNice to Have:\n\n● Develop intuitive and responsive user interfaces following the Material Design\n\nguidelines to ensure the best user experience across various screen sizes.\n\n● Implement third-party libraries and APIs (e.g., Firebase, Google Maps, Push\n\nNotifications) to extend app functionality.\n\n● Experience in integrating third-party SDKs and APIs (e.g., payment gateways, social\n\nmedia logins)\n\n● Familiarity with App Architecture Patterns like MVVM or MVP for Android development\n\n● Experience with mobile analytics platforms (e.g., Firebase Analytics, Google\n\nAnalytics)",
    "created_at": "2025-02-07 06:30:15.411584+00"
  },
  {
    "companyName": "PayPay Corporation",
    "externalUrl": "https://jp.linkedin.com/jobs/view/android-engineer-at-paypay-corporation-4072082380?position=17&pageNum=0&refId=EccKAxOccA3xTcPjRXglAQ%3D%3D&trackingId=E3hzm8KH8dWZqLtxZdR8ig%3D%3D",
    "description": "PayPay is looking for an Android Engineer to work on our payment product to deliver the best payment experience for our Japanese customers.\n\n  \n\n  \n\n**Team Missions**\n\n  \n\n-   Grow finance mobile service as user's first touch point of PayPay.\n-   Actively follow new technology and make our app more convenient using it.\n-   Build new features rapidly along with a variety of technical approach, native OS / KMM / own SDK etc and deliver with high quality.\n\n  \n\n  \n\n**Main Responsibilities**\n\n  \n\n-   Work closely with our product team to customize the payment experience\n-   Prototype new and redesign features\n-   Focus on UI/UX design principles and product driven development\n-   Work with an elite and focused team of app developers\n\n  \n\n**Tech Stack**\n\n| Kotlin\n\n| Simple Stack, RxJava,Koin, Picasso, CardIO,Moshi, Okhttp, Mapbox,Lottie\n\n| Github, Android Studio\n\n| Firebase, AppsFlyer\n\n| Figma\n\n| Slack, Zoom\n\n  \n\n**Qualifications**\n\n  \n\n-   Deep understanding of modern mobile development\n-   Strong in Object Oriented design and Kotlin\n-   Experience with the Android development\n-   Strong passion for code quality and are not allergic to test cases\n-   Familiarity with integration of Rest API\n-   Strong sense of ownership\n-   At least one mobile app you can show off in the interview\n-   At least 6 years of professional experience.\n\n  \n\n**Preferred Qualifications**\n\n-   Experience with CI/CD tool(e.g. Bitrise)\n-   Ability to develop features while conducting unit tests\n-   Knowledge of performance optimization\n-   Ability to communicate with product members and other development team in English\n-   Familiarity with Agile development\n-   Experience integrating and development payment service",
    "created_at": "2025-02-07 06:30:16.065605+00"
  },
  {
    "companyName": "NEEVEE",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-neevee-4146523650?position=59&pageNum=0&refId=jHsR4L8r9yPAsEKqMAEYlQ%3D%3D&trackingId=nnry8N8rgJPOXOJyhLLvbA%3D%3D",
    "description": "Responsibilities:\n\n1\\. Collaborate with the product management and design teams to understand project requirements and translate them into technical specifications.\n\n2\\. Design, develop, and maintain high-quality Android applications using Kotlin and Java, with a focus on Jetpack Compose for modern UI development, ensuring performance, reliability, and usability.\n\n3\\. Write clean, maintainable, and e icient code using industry best practices and coding standards.\n\n4\\. Conduct thorough testing and debugging to identify and resolve issues and optimize application performance.\n\n5\\. Collaborate with cross-functional teams, including backend developers, designers, and QA engineers, to deliver seamless integration and functionality.\n\n6\\. Stay up-to-date with the latest industry trends, technologies, and best practices in Android app development.\n\n7\\. Conduct code reviews and provide constructive feedback to ensure code quality and adherence to established standards.\n\n8\\. Optimize application performance, implement memory management techniques, and address security vulnerabilities.\n\n9\\. Continuously improve development processes and workflows to enhance productivity and e iciency.\n\n10\\. Troubleshoot and resolve issues reported by users, providing timely support and updates as needed.\n\n11\\. Create and maintain applications for wearable devices, ensuring optimal user experience and performance. \n\n  \n\nQualifications:\n\n1\\. Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent work experience).\n\n2\\. Proven experience in developing and maintaining Android applications, with a strong portfolio of past projects.\n\n3\\. Proficiency in Java and/or Kotlin programming languages for Android development.\n\n4\\. Solid understanding of the Android SDK, Android Studio, and related development tools.\n\n5\\. Familiarity with RESTful APIs and integration of third-party libraries and APIs.\n\n6\\. Experience with version control systems, such as Git, for code collaboration and management.\n\n7\\. Knowledge of mobile UI/UX design principles and best practices, including responsive design and material design guidelines.\n\n8\\. Strong analytical and problem-solving skills, with the ability to debug and resolve complex technical issues.\n\n9\\. Excellent communication and collaboration skills, with the ability to work e ectively in a team environment.\n\n10\\. Self-motivated and proactive, with a passion for staying updated with the latest developments in mobile app technologies.\n\n  \n\nPreferred Qualifications:\n\n1\\. Experience with cross-platform mobile app development frameworks, such as React Native or Flutter.\n\n2\\. Familiarity with backend technologies and server-side development.\n\n3\\. Knowledge of software testing methodologies and automated testing frameworks for Android apps.\n\n4\\. Experience with Agile/Scrum development methodologies.\n\n5\\. Published apps in the Google Play Store or other app marketplaces.\n\n  \n\nTechnology Stack:\n\n• Java and/or Kotlin\n\n• Jetpack Compose for UI\n\n• Android SDK\n\n• Android Studio\n\n• RESTful APIs\n\n• Git (Version Control)\n\n• Mobile UI/UX design principles\n\n• Responsive design\n\n• Material Design guidelines Preferred Technologies:\n\n• React Native or Flutter (cross-platform development)\n\n• Backend technologies and server-side development\n\n• Software testing methodologies and automated testing frameworks\n\n• Agile/Scrum development methodologies",
    "created_at": "2025-02-07 07:00:16.578031+00"
  },
  {
    "companyName": "L&T Technology Services",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-l-t-technology-services-4146529313?position=5&pageNum=0&refId=jHsR4L8r9yPAsEKqMAEYlQ%3D%3D&trackingId=E%2FTdyg6C5SmpgIl8mefRCA%3D%3D",
    "description": "**Android Developer:**\n\n  \n\nExperience - 4 to 7 Years\n\n  \n\n**Skills:**\n\n-   Strong understanding of the Android SDK and different versions of Android.\n-   Strong proficiency in Kotlin, with a solid understanding of object-oriented programming.\n-   Experience in multi-threading using coroutines for asynchronous programming.\n-   In-depth knowledge of memory management and optimization techniques on Android.\n-   Good understanding of Java and its application in Android development.\n-   Proficiency with Git for version control and collaboration.\n-   Knowledge of Jetpack Compose is a plus.\n\n  \n\n**Responsibilities:**\n\n-   Translate designs and wireframes into high-quality, maintainable code.\n-   Design, build, and maintain high-performance, reusable, and reliable code in Kotlin and Java.\n-   Ensure the best possible performance, quality, and responsiveness of applications.\n-   Work closely with cross-functional teams to understand business requirements and translate them into technical solutions.\n-   Stay updated with the latest trends and technologies in Android development, and contribute to the continuous improvement of development processes.",
    "created_at": "2025-02-07 07:00:16.578031+00"
  },
  {
    "companyName": "XM",
    "externalUrl": "https://gr.linkedin.com/jobs/view/android-developer-at-xm-4144107896?position=56&pageNum=0&refId=N5b3ZO6Pd9qd6dZpuE4LQw%3D%3D&trackingId=qYzfiDFGnLsnL76Uqc4c%2FQ%3D%3D",
    "description": "**The Role:**\n\n  \n\nThis is a great career opportunity for an enthusiastic and self-motivated individual to join one of our affiliated Companies. We are looking for an Android Developer who has a passion for pushing mobile technologies to the limits and will work with our talented Engineers team to develop the company’s enterprise suite of Android applications.\n\n  \n\n**The main responsibilities include:**\n\n-   Be part of the development of the company’s composite mobile application (challenging requirements such as security, live updates and complex business rules)\n-   Emphasise on code quality delivery: unit and snapshot testing, UI testing\n-   Follow continuous integration and Agile Methods; read and submit merge requests\n-   Invest in multiple areas of the mobile development cycle: CI/CD, app health monitoring and alerting, data-driven analysis\n-   Present ideas for system improvements and help to shape our company’s future\n-   Continuously monitor and improve application, reliability and performance optimisation\n-   Participate in design sprints when building new features or products\n\n  \n\n**Main requirements:**\n\n-   BSc/MSc in Computer Science, Engineering or any other relevant degree\n-   2+ years of experience in Android development (i.e. Java, Kotlin and the Android SDK, Android Studio, Material Spec)\n-   Have successfully published at least one Android application on Google Play (portfolio of apps)\n-   Solid understanding of the full mobile development life cycle\n-   A keen interest in benchmarking and optimisation\n-   Passion for mobile applications and a keen interest in personal development\n-   Showcase of open-source projects and technical blogs will be considered a plus\n-   Proactive, sharp, efficient and organised\n-   Excellent teamwork skills\n\n  \n\n  \n\n**Benefit from:**\n\n-   Attractive remuneration package plus performance-related rewards\n-   Private health insurance\n-   Corporate pension fund\n-   Intellectually stimulating work environment\n-   Continuous personal development and international training opportunities\n\n  \n\nType of employment: Full-time\n\n  \n\nLocation: Cyprus, Greece or Remote\n\n  \n\nPlease visit this link https://tinyurl.com/mr6s234x to submit your online application for this position.\n\n**All applications will be treated with strict confidentiality!**",
    "created_at": "2025-02-07 10:30:14.446394+00"
  },
  {
    "companyName": "Teachable",
    "externalUrl": "https://br.linkedin.com/jobs/view/android-engineer-mid-level-pleno-at-teachable-4123108618?position=52&pageNum=0&refId=n7x6V0cktJyxZl7IDTGlrQ%3D%3D&trackingId=NHqM9hwm%2FdwmolaGRaf1PQ%3D%3D",
    "description": "What is Teachable?  \n  \nTeachable is trusted by creator-educators around the world to grow their impact and income. From online courses and communities to memberships and downloads, Teachable's digital learning products help creator-educators drive meaningful connection and sustainable revenue. With industry-best ecommerce tools, easily toggled on directly within the platform, creators can confidently maximize their earnings, while getting paid directly by their audience. Teachable's unmatched focus on the student learning experience also ensures creators can make a positive and influential impact on their communities—entirely on their own terms. Today, tens of thousands of creator-educators use Teachable to share their knowledge, reaching millions of students around the world. To learn more, visit teachable.com.  \n  \nAre you ready to join a dynamic, cross-cultural team at an exciting turning point in our company’s journey? Now part of the global Hotmart Company portfolio, **whose platforms have helped creators earn more than $10 billion,** Teachable continues to take the creator economy by storm as a true industry leader. Together, Teachable and Hotmart are delivering market-leading products that prioritize creator control and flexibility, alongside meaningful partnership and support from our team. If you have big ideas, relish the chance to challenge convention, and deeply believe in the power of creators to shape the future, we want you on our team!  \n  \n**About Your Team**  \n  \nAs part of Teachable’s first mobile engineering team, you’ll have an incredible opportunity to help shape and define the future of our mobile products. As a member of this team, you will be at the forefront of developing innovative solutions that meet the needs of our Creators and drive business growth. This is a unique chance to be part of an international team that will have a significant impact on our companies’ success and to be part of a community of professionals who share your passion for mobile development. This team has already revamped our legacy app and is planning to do so much more, and wants you to be part of it! As the first Android engineer of this pod, you will act as a connector unlocking opportunities across other parts of Teachable’s engineering teams that will deliver more value to our customers. In addition, there are Android and iOS teams at Hotmart, which can provide support for you too. And at Teachable, there is already an iOS team, which will also help with the beginning of Android development.  \n  \n**What is the role?**  \n  \nAs am Android Engineer you will be responsible for designing, developing, and maintaining our Android application. You will work closely with cross-functional teams from Hotmart and Teachable to evolve our code, as well as collaborate with product managers, designers and other developers.Our creators want a best-in-class mobile experience and we want to help them achieve their goals by building an Android app to expand our mobile audience. Android represents a big part of our web traffic, this is an opportunity and audience we’re excited to serve!  \n  \nIn this position, you will work remotely with Teachable’s US based teams as well as Hotmart employees based in Belo Horizonte and São Paulo. **We are hiring talented engineers in Brazil.  \n  \nThis is a CLT contract that pays in $BRL.**  \n  \n**In this role you'll:**  \n  \n\n-   Collaborate with Engineers, Product Managers, Designers, and QA engineers to build high-quality products with third party integrations\n-   Contribute to the technical design and architecture of services, databases and applications across the organization\n-   Execute on our product development roadmap to drive the progression of our stack and our team at large\n-   Write simple, clean, high-quality, well-tested software that delivers user value\n-   Seek out ways to bring in new perspective to our design, coding and testing best practices as well as supporting review processes (i.e. design, code, postmortem)\n-   Contribute and shape the overall culture and collaboration practices of the team\n\n**What You'll Bring:**  \n  \n\n-   With 2-3+ years of hands-on experience of experience in Android application development with a focus on Kotlin, ideally in an agile, startup environment\n-   Who has a knowledge of RESTful APIs and integration with backend services\n-   Who has demonstrated capacity to clearly and concisely communicate about complex technical, architectural, and/or organizational problems and propose thorough iterative solutions\n-   Who embodies the “leave the code base better than how you found it” mentality\n-   Who has played a key role in designing and implementing technical projects with multiple team members with varying experiences\n-   Who has contributed to architecture discussions to drive technical decisions on your team\n-   Who is humble, collaborative, service-oriented and a fast learner\n-   Who upholds Teachable and Hotmart’s Engineering values, including working as part of a diverse team\n-   Technical knowledge in:\n\n-   Clean architecture, SOLID principles and design patterns.\n-   Architectural patterns: MVVM e MVI.\n-   Unit and automated tests\n-   Modularization and dependency injection\n-   Async processing using Coroutines and Kotlin Flow.\n-   Android Jetpack components.\n-   Android Compose.\n\nNice to have:  \n  \n\n-   Player: Exoplayer and Media3.\n-   CI/CD pipelines\n-   Publishing apps (Play console and Firebase)\n-   Code obfuscation (proguard, dexguard)\n-   Memory management (memory leak)\n\nAdditional Details:  \n  \nAt Teachable, we are committed to providing fair and competitive pay (using market data to inform our pay bands), rewarding high performance, and ensuring all employees have the opportunity and ability to impact Teachable’s overall company value. Salaries will be reviewed at regular intervals throughout the year, typically following performance review cycles currently conducted bi-annually or in conjunction with a promotion.  \n  \nWhile Teachable maintains our NY office for local employees to use, we operate as a **remote-first culture** in order to give our employees added flexibility. In order to maintain connection and create a community beyond the screen, Teachable holds in-person events throughout the year, where employees and teams can come together for bonding, strategic alignment, goal-setting, and celebrations!  \n  \n_Teachable encourages individuals from a broad diversity of backgrounds to apply for positions. We are an equal opportunity employer, meaning we're committed to a fair and consistent interview process. Please tell us in your application if you require an accommodation to apply for a job or to perform your job._",
    "created_at": "2025-02-07 11:00:17.02494+00"
  },
  {
    "companyName": "Deliveroo",
    "externalUrl": "https://in.linkedin.com/jobs/view/senior-software-engineer-android-at-deliveroo-4146609537?position=25&pageNum=0&refId=%2F3KW2GSx4Ohx7pnciU0olg%3D%3D&trackingId=MY0hazZZItaQsxeTSl1j0A%3D%3D",
    "description": "**Location: Hyderabad, India - Hybrid**\n\n  \n\n**What you'll do?**\n\n  \n\nAs a Senior Software Engineer at Deliveroo, your individual work contributes to achieving goals in across your team. While you will work with your team and you may lead projects, some of your work will contribute outside of your direct remit. You will report to managers and group leads and together deliver the results.\n\n  \n\n**Technical Execution:**\n\n  \n\n  \n-     \n    \n    You will improve code structure, have an impact on architecture, and review code of any scope produced by your team.\n    \n  \n-     \n    \n    You'll aim to simplify the maintenance and operation of production systems, visibility, operational readiness, and health of your team's systems.\n    \n  \n\n  \n\n**Collaboration & Leadership:**\n\n  \n\n  \n-     \n    \n    As well as leading from the front regarding technical execution, you'll build relationships with other engineering teams and, identify collaboration opportunities.\n    \n  \n-     \n    \n    You'll own larger pieces of work, assist with design and technical / implementation choices and influence the roadmap within your team.\n    \n  \n-     \n    \n    You will take an active role in the hiring process and conducting engineering interviews. This will also extend to the current team where you will support the personal growth of colleagues, encouraging efficiency in their roles.\n    \n  \n\n  \n\n**Expectations:**\n\n  \n\nWe want to emphasise that we don't expect you to meet all of the below but would love you to have experience in some of these areas.\n\n  \n\n  \n-     \n    \n    Take pride in readable, well-designed and well-tested software\n    \n  \n-     \n    \n    You will have experience in building Android applications at scale\n    \n  \n-     \n    \n    Kotlin and/or Java experience\n    \n  \n-     \n    \n    Accomplished in scaling Android architecture\n    \n  \n-     \n    \n    Experience with Android development tools like Android Studio\n    \n  \n-     \n    \n    Working in a cross-functional team\n    \n  \n-     \n    \n    Knowledge of the Android SDK and AndroidX\n    \n  \n-     \n    \n    Interested in writing Kotlin\n    \n  \n\n  \n\n**Why Deliveroo?**\n\n  \n\nOur mission is to transform the way you shop and eat, bringing the neighbourhood to your door by connecting consumers, restaurants, shops and riders. We are transforming the way the world eats and shops by making access to food and products more convenient and enjoyable. We give people the opportunity to buy what they want, as they want it, when and where they want it.\n\n  \n\nWe are a technology-driven company at the forefront of the most rapidly expanding industry in the world. We are still a small team, making a very large impact, looking to answer some of the most interesting questions out there. We move fast, value autonomy and ownership, and we are always looking for new ideas.\n\n  \n\n**Workplace & Benefits**\n\n  \n\nAt Deliveroo we know that people are the heart of the business and we prioritise their welfare. Benefits differ by country, but we offer many benefits in areas including healthcare, well-being, parental leave, pensions, and generous annual leave allowances, including time off to support a charitable cause of your choice. Benefits are country-specific, please ask your recruiter for more information.\n\n  \n\n**Diversity**\n\n  \n\nAt Deliveroo, we believe a great workplace is one that represents the world we live in and how beautifully diverse it can be. That means we have no judgement when it comes to any one of the things that make you who you are - your gender, race, sexuality, religion or a secret aversion to coriander. All you need is a passion for (most) food and a desire to be part of one of the fastest-growing businesses in a rapidly growing industry.\n\n  \n\nWe are committed to diversity, equity and inclusion in all aspects of our hiring process. We recognise that some candidates may require adjustments to apply for a position or fairly participate in the interview process. If you require any adjustments, please don't hesitate to let us know. We will make every effort to provide the necessary adjustments to ensure you have an equitable opportunity to succeed.\n\nPlease click here to view our candidate privacy policy.",
    "created_at": "2025-02-07 11:00:13.92697+00"
  },
  {
    "companyName": "Inito",
    "externalUrl": "https://in.linkedin.com/jobs/view/lead-android-at-inito-4146615693?position=30&pageNum=0&refId=u0fBNpPmjXZ4Rbl9hCdT7Q%3D%3D&trackingId=Mi8H4jW6E4C%2Ba9Ym4n61xw%3D%3D",
    "description": "**Job Overview**  \n  \nThe Team Lead (Android) will manage a team of Android developers, fostering their technical growth, overseeing daily operations, and ensuring app stability and integration with our devices. The ideal candidate is a hands-on leader and mentor, with a strong background in Android development, product-focused engineering, and a dedication to delivering a top-notch user experience.  \n  \n**Key Responsibilities**  \n  \n**Project Management and Delivery**  \n  \nCollaborate with Product Management to scope, plan, and prioritize new features and improvements.  \n  \nDevelop and maintain project timelines, allocate tasks, and monitor progress to ensure timely and high-quality project delivery.  \n  \n**Team Leadership and Mentorship**  \n  \nLead and mentor a team of junior to mid-level Android developers, providing technical guidance and career growth support.  \n  \nConduct regular one-on-one sessions, set clear performance goals, and provide constructive feedback to support skill development.  \n  \n**Quality and Best Practices**  \n  \nEstablish coding standards and best practices across the Android team, with a focus on maintainable, clean, and scalable code.  \n  \nImplement and oversee a peer code review process, focusing on quality, performance, and security in the app’s architecture.  \n  \n**Technical Innovation and Process Optimization**  \n  \nDrive continuous improvement initiatives, identifying new tools, libraries, and frameworks that improve efficiency and app functionality.  \n  \nLead the team in resolving complex technical challenges, particularly around IoT integration, data handling, and device-to-app communication.  \n  \n**Cross-Functional Collaboration**  \n  \nCoordinate with backend, firmware, QA, and product teams to ensure alignment and resolve technical challenges.  \n  \nFacilitate smooth collaboration between the Android team and other stakeholders to enhance integration and functionality.  \n  \n**User Experience And Product Focus**  \n  \nFocus on optimizing the app’s user experience, especially in cycle tracking, test guidance, and results display.  \n  \nReview user feedback and app analytics to identify and prioritize feature enhancements for a seamless user journey.  \n  \n**Metrics and Reporting**  \n  \nDefine and track metrics for code quality, team productivity, and app performance to inform data-driven decisions.  \n  \nRegularly report progress, risks, and key performance indicators to upper management, ensuring transparency.  \n  \n**Qualifications**  \n  \n6+ years of Android development experience, with expertise in building, maintaining, and scaling Android applications.  \n  \nMinimum of 2 years in a leadership or team management role, including mentorship and performance management.  \n  \nStrong command of Kotlin and familiarity with essential Android frameworks such as Jetpack, AndroidX, and Material Components.  \n  \nProficiency in using Jetpack Compose for building modern, responsive UIs on Android, with experience in deciding between Compose and XML-based UI implementations.  \n  \nExperience with RESTful APIs, asynchronous data handling, and version control systems (e.g., Git).  \n  \nExperience with app analytics tools such as Firebase Analytics or Mixpanel, and optimizing app performance with high data volumes.  \n  \nStrong organizational skills in project planning, task allocation, and managing deadlines, with familiarity in agile methodologies and project management tools.  \n  \n**Nice to Have**  \n  \nExperience in IoT development or integrating apps with external hardware, with knowledge of Bluetooth or other connectivity protocols.  \n  \nFamiliarity with cloud services and backend integration, particularly with Firebase or AWS.  \n  \nBackground in health or wellness apps, especially in data tracking, cycle prediction, or health data visualization, with a strong sense of UI/UX design principles.  \n  \nKnowledge of Android testing frameworks, automated testing, and CI/CD pipelines, including tools like Jenkins or Bitrise.  \n  \nExposure to hybrid app development frameworks such as Flutter or React Native, with an understanding of when hybrid solutions are appropriate versus native Android development.",
    "created_at": "2025-02-07 11:30:14.868261+00"
  },
  {
    "companyName": "ElevenLabs",
    "externalUrl": "https://uk.linkedin.com/jobs/view/android-developer-at-elevenlabs-4018573543?position=1&pageNum=0&refId=knQdp402PZTVHTwo9lricg%3D%3D&trackingId=ETB88VN71SFOYMJ1qctZGw%3D%3D",
    "description": "This role is remote, so it can be executed globally. If you prefer, you can work from our offices in New York, London and Warsaw.  \n  \n**About ElevenLabs**  \n  \nAt ElevenLabs, we are pioneering voice technology with our cutting-edge research and products.  \n  \nWe launched in January 2023 and have since reached over 1 million users globally and have partnered with the world’s biggest names (see customer stories). We have closed our Series-B funding at 1.1B valuation earlier this year and are backed by the leading names in tech and AI (Nat Fridman, Daniel Gross, Andreessen Horowitz, Instagram co-founder Mike Krieger, Oculus VR co-founder Brendan Iribe, Deepmind & Inflection co-founder Mustafa Suleyman, and many others).  \n  \nWe are at an exciting phase of our growth and innovation and are looking for ambitious people to help us further push the boundaries of voice AI. This is a rare chance to be an early member of a company on the rise. If this excites you, we want to meet you!  \n  \n**Who We Are**  \n  \nA global team of passionate and innovative individuals united by curiosity and a shared goal: to be the first choice for AI audio solutions. Together, we are shaping a new technology and market from the ground up. We innovate quickly and take pride in getting things right, from the big picture initiatives to the details that keep us moving smoothly every day. We work with high autonomy and accountability where the best idea wins at any time and from anyone.  \n  \n**About The Role**  \n  \nWe are looking for an experienced Android developer to join our growing mobile team to spearhead high-impact projects in the audio AI space. Your role will include the delivery of new features to our reader app, ensuring seamless integration with our AI-driven audio functionalities. As part of our dynamic team, you will have the opportunity to identify pivotal areas where strategic initiatives or incremental efforts can drive significant impact.  \n  \nWe value engineers who are impact-driven, autonomous, and adept at discerning crucial insights from experimental results.  \n  \nA strong background in native Android development with a proven track record is required.  \n  \n**In this role, you will**  \n  \n\n-   Drive the development of innovative features in our reader app through a combination of data analysis, product ideation, and experimentation to optimize user experiences.\n-   Plan and deploy mobile platform infrastructure necessary to build, test, and deploy these product experiences.\n-   Collaborate closely with design, product, research, and data science teams to achieve product goals.\n-   Contribute to the architecture and technical direction of the app.\n-   Ensure the performance, quality, and responsiveness of the application.\n-   Participate in code reviews and contribute to best practices and coding standards.\n-   Continuously discover, evaluate, and implement new technologies to maximize development efficiency.\n\nLooking ahead, you will also play a key role in creating a new, confidential project within the audio AI space, leveraging your expertise to shape its success.  \n  \n**Who You Are**  \n  \nWe're looking for exceptional individuals who combine technical excellence with ethical awareness, who are excited by hard problems and motivated by human impact. You’ll strive with us if you:  \n  \n\n-   Are passionate about audio AI driven by a desire to make content universally accessible and breaking the frontiers of new tech.\n-   Are a highly motivated and driven individual with a strong work ethic. Our team is aware of this critical moment of audio AI evolution and is committed to going the extra mile to lead.\n-   Are analytical, efficient, and strive on solving complex challenges with a first principles mindset.\n-   Consistently strive for excellence, delivering high-quality work quickly and exceeding expectations.\n-   Take initiative and work autonomously from day one, prioritizing learning and contribution while leaving ego aside.\n\n**What You Bring**  \n  \n\n-   Have shipped features on Android that optimize user experiences and drive engagement.\n-   Are highly analytical and have experience designing and implementing A/B tests, with a scientific approach to data-based experiments.\n-   Have a voracious and intrinsic desire to learn and fill in missing skills, and an equally strong talent for sharing that information clearly and concisely with others.\n-   Are comfortable with ambiguity and rapidly changing conditions, viewing changes as an opportunity to add structure and order when necessary.\n-   Are located between GMT+3 and GMT -7\n\nThis is an exciting opportunity to work on cutting-edge technologies and make a significant impact on the future of audio AI applications.  \n  \n**What We Offer**  \n  \n\n-   High-velocity innovation: Rapid experimentation, lean autonomous teams, and minimal bureaucracy.\n-   A truly global team: Collaboration with teammates across 30+ countries, a global customer footprint and office hubs in New York, London and Warsaw. Annual company offsite for the whole team to get together (the last one in Croatia!)\n-   Remote first: We prioritize your talent, not your location, with structured asynchronous workflows for maximum impact and minimal meetings.\n-   Continuous growth: Collaborate with AI leaders, shape your path, and contribute where you excel most.",
    "created_at": "2025-02-07 11:30:14.142767+00"
  },
  {
    "companyName": "Vertex Advisory Services",
    "externalUrl": "https://www.linkedin.com/jobs/view/senior-android-developer-at-vertex-advisory-services-4144749238?position=3&pageNum=0&refId=Wq47jT12niYfdfjUC%2BwDlQ%3D%3D&trackingId=CeBRGRLNBVMPca3%2FHVqWPA%3D%3D",
    "description": "**Responsibilities**  \n  \n\n-   Design and develop navigation applications on Android OS\n-   Collaborate with cross-functional teams, including product and UI/UX design teams to define application features\n-   Identify potential problems and resolve application bottlenecks for performance optimizations\n-   Triage, debug, and fix application issues before final release\n-   Perform code reviews and practice continuous integration and development\n-   Write test code to test for quality, robustness, and functional correctness, including edge cases\n-   Design and implement subsequent application updates and releases\n-   Grow your skills with continual learning, workshops, conferences, and talks\n\n**Qualifications**  \n  \n\n-   Bachelor’s degree in Computer Science or Software Engineering (MS preferred)\n-   Proven Android app developer with 5+ years of experience\n-   Proficiency in Kotlin, Java, and C++\n-   Ability to manage your workload with minimal supervision\n-   Proficiency in using Android and Android Jetpack APIs, including knowledge of Android NDK and JNI\n-   Knowledge of Android design principles and application interface guidelines\n-   Knowledge of Android’s performance and testing framework\n-   Familiarity with embedded Android framework services\n-   Excellent coding and proofreading skills\n-   Familiarity with the best-in-class Software development practices\n-   Knowledge and experience with Jetpack libraries\n-   Proficient in code versioning tools including Git, Bitbucket and others\n-   Experience with continuous integration tools, such as Jenkins\n-   Excellent inter-personal skills with the ability to collaboratively work with and influence cross-functional teams\n-   Top-notch teamwork and communication skills\n\nPowered by JazzHR  \n  \nv5t2yRd9t9",
    "created_at": "2025-02-06 08:17:11.151049+00"
  },
  {
    "companyName": "Rounds",
    "externalUrl": "https://ro.linkedin.com/jobs/view/android-developer-at-rounds-4144441784?position=1&pageNum=0&refId=Wq47jT12niYfdfjUC%2BwDlQ%3D%3D&trackingId=pMhkh7mSf3xMgI7ibKlG7Q%3D%3D",
    "description": "**SNEAK PEEK**  \n  \n**⇨ Location:** Remote, GMT+0/GMT+4  \n  \n**⇨ Interview process:** HR interview ⇨ take-home challenge ⇨ technical discussion ⇨ ⇨ final interview ⇨ offer  \n  \n**⇨ Contact:** For questions please reach out to: hr@rounds.com  \n  \n**WHO ARE WE?**  \n  \nAt Rounds, we believe in harnessing the power of cutting-edge technology to drive business success. Our transformative, machine-learning technology identifies and optimizes mobile assets, while our team of experts, with their unparalleled human capital and business acumen, provides the strategic direction and support to turn mobile assets into profitable businesses. Together, we are revolutionizing the mobile industry. You can find out more info about us here: www.rounds.com.  \n  \n**THE ROLE**  \n  \nWe are looking for a talented developer for challenging work on Android apps with millions of downloads. In this role, you will help our R&D team create, code, test and maintain various Android apps. You will work closely with other developers and QA testers, using the Agile methodology and a quality-first approach.  \n  \n**WHAT ARE WE LOOKING FOR?**  \n  \n\n-   3+ years of experience developing Android applications in both Java and Kotlin\n-   Proficient UI programming skills\n-   Familiar with a wide variety of android related tasks (sdk updates, permission handling, etc.)\n-   Experience with commonly used Android components and libraries (Coroutines, Glide, Retrofit, OkHttp)\n-   Familiar with legacy Android libraries (RxJava, AsyncTasks, Views)\n-   Expertise with peripheral development tools (Android Studio, git, Firebase, etc.)\n-   Advantage: familiarity with CI\n-   Experience in the development of an app that was released on Google Play (100,000+ downloads)\n-   Familiarity with Agile management: Kanban\n-   Excellent communication skills in both written and verbal English\n\n**HOW DO WE WORK?**  \n  \nWe are a distributed team of more than 130 people all working remotely. We value open communication, proactivity and work/life balance and we measure our freelancers on performance, rather than on the time spent on the job.  \n  \n**WHAT’S IN IT FOR YOU?**  \n  \n\n-   100% remote work\n-   Flexible full-time working hours\n-   Paid national holidays (of the freelancers’ country of residence)\n-   The opportunity to grow together with the company & take ownership from day 1\n\n**INTERESTED?**  \n  \nOur recruitment process consists of the following steps:  \n  \n\n-   HR interview: 45 min.\n-   take-home challenge (around 3 hours of work)\n-   technical discussion with our Android team leaders: 45 min.\n-   final interview with the VP of R&D: 30 min.\n\nGet in touch at hr@rounds.com. We look forward to hearing from you!",
    "created_at": "2025-02-06 08:17:11.151049+00"
  },
  {
    "companyName": "Rounds",
    "externalUrl": "https://al.linkedin.com/jobs/view/android-developer-at-rounds-4144446331?position=2&pageNum=0&refId=Wq47jT12niYfdfjUC%2BwDlQ%3D%3D&trackingId=3BtiJzmwoGmzPxxy8OiRKQ%3D%3D",
    "description": "**SNEAK PEEK**  \n  \n**⇨ Location:** Remote, GMT+0/GMT+4  \n  \n**⇨ Interview process:** HR interview ⇨ take-home challenge ⇨ technical discussion ⇨ ⇨ final interview ⇨ offer  \n  \n**⇨ Contact:** For questions please reach out to: hr@rounds.com  \n  \n**WHO ARE WE?**  \n  \nAt Rounds, we believe in harnessing the power of cutting-edge technology to drive business success. Our transformative, machine-learning technology identifies and optimizes mobile assets, while our team of experts, with their unparalleled human capital and business acumen, provides the strategic direction and support to turn mobile assets into profitable businesses. Together, we are revolutionizing the mobile industry. You can find out more info about us here: www.rounds.com.  \n  \n**THE ROLE**  \n  \nWe are looking for a talented developer for challenging work on Android apps with millions of downloads. In this role, you will help our R&D team create, code, test and maintain various Android apps. You will work closely with other developers and QA testers, using the Agile methodology and a quality-first approach.  \n  \n**WHAT ARE WE LOOKING FOR?**  \n  \n\n-   3+ years of experience developing Android applications in both Java and Kotlin\n-   Proficient UI programming skills\n-   Familiar with a wide variety of android related tasks (sdk updates, permission handling, etc.)\n-   Experience with commonly used Android components and libraries (Coroutines, Glide, Retrofit, OkHttp)\n-   Familiar with legacy Android libraries (RxJava, AsyncTasks, Views)\n-   Expertise with peripheral development tools (Android Studio, git, Firebase, etc.)\n-   Advantage: familiarity with CI\n-   Experience in the development of an app that was released on Google Play (100,000+ downloads)\n-   Familiarity with Agile management: Kanban\n-   Excellent communication skills in both written and verbal English\n\n**HOW DO WE WORK?**  \n  \nWe are a distributed team of more than 130 people all working remotely. We value open communication, proactivity and work/life balance and we measure our freelancers on performance, rather than on the time spent on the job.  \n  \n**WHAT’S IN IT FOR YOU?**  \n  \n\n-   100% remote work\n-   Flexible full-time working hours\n-   Paid national holidays (of the freelancers’ country of residence)\n-   The opportunity to grow together with the company & take ownership from day 1\n\n**INTERESTED?**  \n  \nOur recruitment process consists of the following steps:  \n  \n\n-   HR interview: 45 min.\n-   take-home challenge (around 3 hours of work)\n-   technical discussion with our Android team leaders: 45 min.\n-   final interview with the VP of R&D: 30 min.\n\nGet in touch at hr@rounds.com. We look forward to hearing from you!",
    "created_at": "2025-02-06 08:17:11.151049+00"
  },
  {
    "companyName": "Bajaj Finserv",
    "externalUrl": "https://in.linkedin.com/jobs/view/senior-mobile-developer-kotlin-multiplatform-at-bajaj-finserv-4144898710?position=45&pageNum=0&refId=F47IrYeZoC3M6s%2Ba49r0rQ%3D%3D&trackingId=GOwqhxfoyGvo3VlWfIUPXw%3D%3D",
    "description": "Company Size  \n  \nStartup / Small Enterprise  \n  \n**Experience Required**  \n  \n2 - 8 years  \n  \nWorking Days  \n  \n5 days/week  \n  \nOffice Location  \n  \nRemote Working  \n  \nRole & Responsibilities  \n  \n\n-   Develop high-quality, scalable mobile applications for iOS and Android platforms using Kotlin and Swift.\n-   Collaborate closely with cross-functional teams to define, design, and implement new features.\n-   Write clean, efficient, and maintainable code, following coding standards and best practices.\n-   Optimise mobile app performance to ensure a smooth and responsive user experience.\n-   Conduct code reviews and provide constructive feedback to team members.\n-   Stay updated with the latest mobile development trends, tools, and technologies.\n-   Troubleshoot and debug issues to maintain application stability.\n-   Participate in the full software development lifecycle, from concept to deployment and support.\n\nIdeal Candidate  \n  \n\n-   Bachelor's degree in Computer Science, Engineering, or a related field.\n-   3-8 years of proven experience in mobile app development, with a focus on Kotlin and Swift.\n-   Strong proficiency in Kotlin and Swift programming languages.\n-   Solid understanding of mobile app architecture, design patterns, and development best practices.\n-   Experience with RESTful APIs, third-party libraries, and mobile UI/UX principles.\n-   Familiarity with Git or other version control systems.\n-   Ability to work effectively in a collaborative, fast-paced environment.\n-   Excellent problem-solving and analytical skills.\n-   Strong communication skills and ability to work with cross-functional teams.\n\nSkills: mobile,swift,mobile ui/ux,problem-solving,analytical skills,restful apis,communication,kotlin,android,git,mobile app development",
    "created_at": "2025-02-05 17:30:14.342497+00"
  }
]