[
  {
    "companyName": "Kajae",
    "externalUrl": "https://www.linkedin.com/jobs/view/mobile-application-developer-at-kajae-4139301874?position=19&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=xWMUaE463ji0BqzGdC8Nmg%3D%3D",
    "description": "_\\*\\*To apply, kindly submit your resume in English. Please note that any other format will not be considered.\\*\\*_\n\n  \n\n**Who we are:**\n\nKajae is a premium staff augmentation company, that connects top global talents to thriving US companies and clients offering fully remote opportunities. Our team hails from over 15 different countries, with the majority coming from the Philippines and Latin America. We pride ourselves on our tight-knit culture and strong bonds, despite working remotely across diverse time zones.\n\n  \n\n**Benefits:**\n\n• Competitive salary. Receive your pay in USD! 100% fully remote work setup. Work from home or work from anywhere in the world— forever! Eliminate the hassles of commuting and be around family more without missing out on life’s biggest moments.\n\n• Healthy work-life balance. There’s nothing we prioritize more. We do regular check-ins with the team for the first few months to provide support and work advice. We also make sure you are working with only the best clients and a healthy work environment.\n\n• Health Insurance. Covered after the third month of the contract.\n\n• Mental Health Support Program. We have an in-house mental health professional to make sure our team members have all the support they need.\n\n• Referral Bonuses. Earn up to USD 100 for every successful candidate you refer (because you'll want to tell your friends!)\n\n• Fun virtual events. We have monthly virtual events where everyone gets together, plays fun games, and celebrates special holidays, with many opportunities to win cash and exciting prizes.\n\n• Kajae Spotlight Bonus. With stellar performance comes the Kajae Spotlight cash bonus!\n\n• We have a tribe! Get the chance to engage with the whole team on our team’s social platform and earn coins along the way. Bid on some of our crazy auctions and get the chance to win prizes like Airpods, Apple Watch, Starbucks gift cards, shopping or experience vouchers, and more!\n\n• Continuing Education. 100% free courses are offered through our university partners in the US to earn academic credits for Master’s or Graduate Degree programs.\n\n• All-Expense Paid Summits. Earn your way to our annual Kajae Summit as a reward for your outstanding performance and tenure. The last two summits were held at Palawan, Philippines, and Cusco, Peru (we saw Machu Picchu together!)\n\n  \n\n**Who we are looking for:**\n\nWe are seeking a **Senior React Native Developer** with **5+ years of experience** in mobile application development. The ideal candidate will have extensive experience with **React Native, JavaScript, and TypeScript**, along with a strong understanding of mobile application architecture, performance optimization, and cross-platform development. This role requires someone who is **proactive, highly collaborative, and detail-oriented**, capable of building scalable mobile applications.\n\n  \n\n**What You'll Do:**\n\n-   **Develop & Maintain Mobile Applications:** Build and maintain high-quality **React Native** applications for both **iOS and Android**.\n-   **Code Optimization & Scalability:** Write **clean, reusable, and efficient** code to improve app performance.\n-   **API Integration:** Implement and integrate **RESTful APIs, GraphQL, and third-party services**.\n-   **State Management:** Work with **Redux, React Context, or similar state management libraries**.\n-   **Performance Optimization:** Identify and resolve issues impacting **app speed, responsiveness, and memory usage**.\n-   **Cross-Functional Collaboration:** Work closely with **UI/UX designers, backend developers, and product managers** to create seamless experiences.\n-   **Testing & Debugging:** Perform **unit and integration testing** to ensure app reliability and stability.\n-   **Version Control & Deployment:** Utilize **Git for source control** and manage deployments to **App Store & Google Play.**\n\n  \n\n**What You’ll Need:**\n\n-   **5+ years of professional experience in React Native development**.\n-   Strong proficiency in **JavaScript, TypeScript, and ES6+**.\n-   Expertise in **React Native frameworks** (React Navigation, Axios, etc.).\n-   Hands-on experience integrating **REST APIs and GraphQL**.\n-   Solid understanding of **Redux, React Context, or similar state management tools**.\n-   Knowledge of **native build tools (Xcode, Android Studio)** for iOS and Android.\n-   Experience with **Firebase, Push Notifications, and Payment Gateway Integrations**.\n-   Strong debugging and problem-solving skills.",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "Motive",
    "externalUrl": "https://in.linkedin.com/jobs/view/software-engineer-android-at-motive-4139133531?position=16&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=mDClwwUdxzf29xEYQZuShA%3D%3D",
    "description": "**Who We Are**  \n  \nMotive empowers the people who run physical operations with tools to make their work safer, more productive, and more profitable. For the first time ever, safety, operations and finance teams can manage their drivers, vehicles, equipment, and fleet related spend in a single system. Combined with industry leading AI, the Motive platform gives you complete visibility and control, and significantly reduces manual workloads by automating and simplifying tasks.  \n  \nMotive serves more than 120,000 customers – from Fortune 500 enterprises to small businesses – across a wide range of industries, including transportation and logistics, construction, energy, field service, manufacturing, agriculture, food and beverage, retail, and the public sector.  \n  \nVisit gomotive.com to learn more.  \n  \n**About The Role**  \n  \nAs a key member of our team, you will play an active part in designing, and managing our flagship mobile app. Your expertise will contribute to redefining our architecture and building a world-class offline-first mobile application with an enthusiastic team. We are looking for candidates who have a forward-thinking mindset aimed at high readability (declarative) code, as well as identifying problems or bottlenecks before they become issues.  \n  \n**What You’ll Do**  \n  \n\n-   Develop new features for our Android (Java & Kotlin) Motive Driver App\n-   Improving one of our many existing features, including GPS tracking (Geofencing), Bluetooth and USB comms, Camera APIs, etc\n-   Work with product team to refine feature specs\n-   Communicate with back end engineers about API requirements or refinements\n-   Help support team to diagnose user problems\n-   Analyze our user's data to identify bugs\n\n**What We’re Looking For**  \n  \n\n-   6+ years experience working on Android apps\n-   Proficiency in Java, Kotlin, Android lifecycle, custom views, database/persistence\n-   An understanding of Android UI/UX and application design paradigms\n-   An appreciation and understanding of automated app testing\n-   Knowledge in Kotlin coroutines, Kotlin flows, RxJava2, Dagger2 is a plus!\n-   Knowledge or interest in commercial vehicles/trucking is a plus!\n\nCreating a diverse and inclusive workplace is one of Motive's core values. We are an equal opportunity employer and welcome people of different backgrounds, experiences, abilities and perspectives.  \n  \nPlease review our Candidate Privacy Notice here.  \n  \n_Creating a diverse and inclusive workplace is one of Motive's core values. We are an equal opportunity employer and welcome people of different backgrounds, experiences, abilities and perspectives.  \n  \n__Please review our Candidate Privacy Notice here.  \n  \n__The applicant must be authorized to receive and access those commodities and technologies controlled under U.S. Export Administration Regulations. It is Motive's policy to require that employees be authorized to receive access to Motive products and technology._",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "AKASJKUMAR ANANDBHAI TANDEL",
    "externalUrl": "https://www.glassdoor.co.in/job-listing/android-developer-akasjkumar-anandbhai-tandel-JV_KO0,17_KE18,45.htm?jl=1009618642158",
    "description": "Application develope as my requirement\n\nJob Type: Full-time\n\nPay: ₹6,000.00 - ₹20,000.00 per month\n\nEducation:\n\n-   Bachelor's (Preferred)\n\nExperience:\n\n-   Android Development: 1 year (Preferred)\n-   total work: 1 year (Preferred)\n\nWork Location: Remote",
    "created_at": "2025-01-31 10:58:03.753201+00"
  },
  {
    "companyName": "Helivena it solutions pvt ltd",
    "externalUrl": "https://www.glassdoor.co.in/job-listing/senior-flutter-developer-helivena-it-solutions-pvt-ltd-JV_KO0,24_KE25,54.htm?jl=1009617484834",
    "description": "**Job Title:** Flutter Developer  \n**Experience:** 2 to 5 Years  \n**Location:** WFH  \n**Job Type:** Part-time\n\n**Job Description:**\n\nHelivena IT Solutions Private Limited is seeking a skilled **Flutter Developer** with 2 to 5 years of experience to join our dynamic team. The ideal candidate should have expertise in **Flutter** and be passionate about building high-performance, cross-platform mobile applications.\n\n**Key Responsibilities:**\n\n-   Develop and maintain **Flutter applications** for both Android and iOS platforms.\n-   Collaborate with UI/UX designers and backend developers to create seamless user experiences.\n-   Optimize app performance and ensure smooth functionality across different devices.\n-   Integrate **REST APIs, third-party libraries, and SDKs**.\n-   Write clean, maintainable, and scalable code following best practices.\n-   Troubleshoot and debug issues, ensuring the app's stability and security.\n-   Stay updated with the latest Flutter trends and technologies.\n\n**Required Skills:**\n\n-   **Strong proficiency in Flutter f**or mobile app development.\n-   Experience with **State Management (Provider, Riverpod, Bloc, etc.)**.\n-   Understanding of **Firebase, GraphQL, or other backend integrations**.\n-   Knowledge of **RESTful APIs and third-party services**.\n-   Familiarity with version control systems like **Git/GitHub/GitLab**.\n-   Experience with app deployment on **Google Play Store and Apple App Store**.\n-   Strong problem-solving skills and attention to detail.\n\n**Preferred Qualifications:**\n\n-   Experience in **native Android (Java/Kotlin) or iOS (Swift/Objective-C)** is a plus.\n-   Knowledge of Agile methodologies and CI/CD pipelines.\n\n**Why Join Us?**\n\nOpportunity to work on exciting projects\n\nGrowth and learning environment  \nCollaborative and innovative team\n\n**How to Apply?**  \nSend your resume to helivenasolutions@gmail.com or apply directly through portal\n\nJoin us and be a part of our growing tech team\n\nJob Type: Part-time\n\nPay: ₹120,000.00 - ₹300,000.00 per year\n\nExpected hours: 10 – 20 per week\n\nSupplemental Pay:\n\n-   Performance bonus\n\nExperience:\n\n-   total work: 2 years (Preferred)\n\nWork Location: Remote",
    "created_at": "2025-01-31 10:58:03.753201+00"
  },
  {
    "companyName": "Allegion",
    "externalUrl": "https://builtin.com/job/lead-software-engineer/3953253",
    "description": "Lead a team of Android developers to design and maintain mobile applications, collaborating with stakeholders to implement software solutions. Provide mentorship, conduct peer reviews, and improve quality and processes. Expert in Android development, Java, and Kotlin, along with CI/CD practices.\n\nSummary Generated by Built In\n\n****Creating Peace of Mind by Pioneering Safety and Security****\n\n_At Allegion, we help keep the people you know and love safe and secure where they live, work and visit. With more than 30 brands, 12,000+ employees globally and products sold in 130 countries, we specialize in security around the doorway and beyond. Additionally, in 2024 we were awarded the Gallup Exceptional Workplace Award, which recognizes the most engaged workplace cultures in the world._\n\n**What You will do :**\n\n-   Lead a team of android developers in design, development, testing and deployment of mobile application.\n-   Responsible for designing, developing, and maintaining software solutions for new and existing Allegion products.\n-   Work closely with product management and other functional stakeholders to understand requirements and translate them to elegant implementation.\n-   Collaborate with global teams for product development\n-   Peer reviews for code and design\n-   Contribute towards the continuous improvement of the quality and process\n-   Provide design/architectural solutions for new developments\n-   Provide mentorship and feedback to teammates to make your team the best version of itself.\n-   Serve as a mobility subject matter expert in the project\n-   Responsible for maintaining and publishing apps to production\n-   Self-directed and able to direct others and be an effective team-leader\n\n**What we are looking for:**\n\n-   Experience building native applications in Android\n-   Expert-level experience with Java and Kotlin\n-   Experience in developing apps that consume web services.\n-   Experience in setting up and maintaining CI/CD\n-   Strong knowledge of software design, design patterns\n-   Experience in Reactive Programming (RxJava) (optional)\n-   Experience in Rapid Prototyping\n-   Experience in Scrum and Agile Philosophy\n-   Thorough understanding of Google’s design principles and interface guidelines.\n-   Experience with performance and memory tuning using tools (Profilers)\n-   At least one versioning tool experience (GIT or SVN)\n-   Effective written, verbal, and presentation skills with the ability to clearly articulate ideas and concepts.\n-   Experience in defining processes and solution architecture as we build our platform out.\n-   Ability to relate to others demonstrated resourcefulness and flexibility, active participation in the decision-making process, ability to assess risk, and act with a sense of urgency.\n\n******We Celebrate Who We Are!****** \n\nAllegion is committed to building and maintaining a diverse and inclusive workplace.  Together, we embrace all differences and similarities among colleagues, as well as the differences and similarities within the relationships that we foster with customers, suppliers and the communities where we live and work. Whatever your background, experience, race, color, national origin, religion, age, gender, gender identity, disability status, sexual orientation, protected veteran status, or any other characteristic protected by law, we will make sure that you have every opportunity to impress us in your application and the opportunity to give your best at work, not because we’re required to, but because it’s the right thing to do.   We are also committed to providing accommodations for persons with disabilities. If for any reason you cannot apply through our career site and require an accommodation or assistance, please contact our Talent Acquisition Team.\n\n© Allegion plc, 2023 | Block D, Iveagh Court, Harcourt Road, Dublin 2, Co. Dublin, Ireland\n\nREGISTERED IN IRELAND WITH LIMITED LIABILITY REGISTERED NUMBER 527370\n\nAllegion is an equal opportunity and affirmative action employer\n\nPrivacy Policy\n\nRead Full Description",
    "created_at": "2025-01-31 10:58:03.246955+00"
  },
  {
    "companyName": "Mitsogo",
    "externalUrl": "https://builtin.com/job/product-support-engineer/3956543",
    "description": "The Product Support Engineer will provide technical support for UEM solutions, addressing customer queries through various communication channels, collaborating with cross-functional teams, and ensuring customer satisfaction by resolving issues and improving product documentation.\n\nSummary Generated by Built In\n\n**About Mitsogo** **| Hexnode**\n\nMitsogo is a global organization that highly values the contributions of each employee. Our ability to attract top talent is a testament to our commitment to fostering a sense of belonging for everyone. We recognize the rapid evolution of technology and society that impacts our industry, and we prioritize equipping our employees with diverse opportunities and empowering them with a wide range of skills. \n\nHexnode, the Enterprise software division of Mitsogo Inc., was founded to simplify how people work. Operating in over 100 countries, Hexnode UEM empowers organizations in diverse sectors. Fueling the transformation to a seamless ecosystem of connected tools, Hexnode is revolutionizing the enterprise software and cybersecurity landscape.\n\n**Job Overview:**\n\nWe are seeking motivated and talented individuals who thrive on solving technical challenges to join our Product Support team. As the first point of contact for our UEM product solutions, they field and triage all customer requests, working directly with IT Admins (B2B) to address a wide variety of technical issues. Our focus is on delivering amazing and quality customer experience.\n\n**Responsibilities:**\n\n-   Provide end-to-end technical support to customers via Chat, Email, and Phone.\n-   Troubleshoot and resolve customer queries/problems with our Products or Solutions.\n-   Communicate best practices to customers to help achieve maximum value from our Products.\n-   Collaborate with cross-functional teams, like Sales, Pre-Sales, and Engineering, to address customer needs and improve product solutions.\n-   Share customer feedback with the Engineering team to improve our Products.\n-   Keep customers updated on their issue status and resolution progress.\n-   Ensure SLAs are honoured and KPIs are met.\n-   Proactively identify and report cases that require escalation.\n-   Help improve Product documentation for internal and external use.\n\n**Requirements:**\n\n-   Minimum 1 year of Support experience (in Product/Application support preferred).\n-   Experience with Technical Support via Chat, Email, or Phone.\n-   Hands-on working experience in at least one - Android / iOS / Windows / Linux / MacOS platforms.\n-   Willingness to work in a dynamic 24/5 work environment.\n-   Excellent communication skills and a customer-focused mindset.\n-   Strong problem-solving skills and the ability to troubleshoot complex technical issues.\n-   Bachelor's degree in Computer Science, Information Technology or a related field.\n-   Quick learner with a passion for learning technology.\n-   Ability to handle multiple tickets and tasks simultaneously.\n\n**Desired Skills:**\n\n-   Ability to thrive in a fast-paced environment with lots of technical variety.\n-   Experience with MDM/UEM products or similar technologies is an added advantage.\n-   IT Technical Certifications on any technology to showcase expertise will add value.\n-   Experience with ticketing platforms or similar tools like Zendesk, Salesforce, and ClickUp.\n\nRead Full Description",
    "created_at": "2025-01-31 10:58:03.246955+00"
  },
  {
    "companyName": "Wayfair",
    "externalUrl": "https://builtin.com/job/software-engineer-iii-storefront/3969540",
    "description": "Lead development for mobile projects focused on user onboarding and experience. Collaborate with cross-functional teams, manage stakeholders, review code, and improve app performance. Ensure high quality and test coverage in software development and provide mentoring to junior engineers.\n\nSummary Generated by Built In\n\n_Candidates for this position are preferred to be based in Bangalore, India and will be expected to comply with their team's hybrid work schedule requirements._\n\n**Who We Are:**\n\nWayfair runs the largest custom e-commerce large parcel network in the United States, approximately 1.6 million square meters of logistics space. The nature of the network is inherently a highly variable ecosystem that requires flexible, reliable, and resilient systems to operate efficiently.Wayfair believes everyone should live in a home they love. Through technology and innovation, we make it possible for shoppers to quickly and easily find exactly what they want from a selection of more than 14 million items across home furnishings, décor, home improvement, housewares, and more. Partnering with Product, Experience Design, Analytics, and business leaders across Wayfair, our Native App Engineering teams contribute to an award-winning mobile experience that makes shopping for your home delightful and engaging. iOS and Android engineers leverage the full capabilities of mobile devices and their SDKs. For example, our apps take advantage of augmented reality, computer vision-assisted product search using the device’s camera, and machine learning to create personalized experiences and improve the speed of the app.\n\nThe App Welcome team charter is to provide fast, reliable, scalable solutions of onboarding customers within the wayfair ecosystem, and provide the necessary platform services that will authenticate, notify, and differentiate their experiences based upon their needs.  We are looking for a driven leader who is passionate about releasing high-quality software and platform services, and empowering our users to have an excellent shopping experience throughout our native apps.  The ideal candidate has experience in native app development (iOS or Android), and a proven track record of managing stakeholders and external partners. This person will leverage their breadth of knowledge in these areas to lead and grow a multi-disciplinary engineering team that delivers features for Wayfair shoppers and platform services to our distributed engineering teams.\n\n****What You’ll Do:****\n\n-   Lead development for in-depth mobile projects surrounding upper-funnel functionality such as homepage, sales, category, authentication, and landing experiences, including architecting and developing new features, application maintenance and refactoring, and increased performance and automation.\n-   Review code and provide guidance for other developers participating in our release approval process.\n-   Being passionate about test coverage and quality engineering are paramount.\n-   Use data and metrics to collaboratively drive impactful changes.\n-   Frequently interface and interact with quality, UX, back-end/API, product, analytics, and other teams.\n-   Though primarily focused on Android, collaborate with iOS and full-stack teams to ensure solutions are robust and aligned.\n-   Lead by example; share knowledge, experience, and best practices through mentoring, tech talks, and presentations.\n\n**We Are a Match Because You Have:**\n\n-   At least 6+ years of professional Android development on publicly available apps.\n-   A passion for writing clean, readable, and thoroughly tested code, and an eagerness to share your expertise with others.\n-   A mastery of Android fundamentals, interacting with endpoints, debugging, and memory management.\n-   Experience having architected or designed complex features with product managers or other stakeholders.\n-   A deep understanding of architecture patterns such as MVP, MVVM, Clean/VIPER, etc., as well as async patterns.\n-   A drive to learn about new libraries and technologies, stay on the cutting edge of the evolving mobile landscape and an eagerness to create experiences that will delight users.\n-   A genuine belief that constructive and respectful code reviews are the bedrock of a healthy team.\n-   Knowledge of Material Design, Android UI/UX development, and best practices\n\n**Experience with the following is nice to have:**\n\n-   Kotlin, Jetpack Compose, and GraphQL\n-   Ruby or similar scripting languages\n-   Working cross-platform with iOS and/or Full-Stack\n\n**About Wayfair Inc.**\n\nWayfair is one of the world’s largest online destinations for the home. Whether you work in our global headquarters in Boston, or in our warehouses or offices throughout the world, we’re reinventing the way people shop for their homes. Through our commitment to industry-leading technology and creative problem-solving, we are confident that Wayfair will be home to the most rewarding work of your career. If you’re looking for rapid growth, constant learning, and dynamic challenges, then you’ll find that amazing career opportunities are knocking.\n\nNo matter who you are, Wayfair is a place you can call home. We’re a community of innovators, risk-takers, and trailblazers who celebrate our differences, and know that our unique perspectives make us stronger, smarter, and well-positioned for success. We value and rely on the collective voices of our employees, customers, community, and suppliers to help guide us as we build a better Wayfair – and world – for all. Every voice, every perspective matters. That’s why we’re proud to be an equal opportunity employer. We do not discriminate on the basis of race, color, ethnicity, ancestry, religion, sex, national origin, sexual orientation, age, citizenship status, marital status, disability, gender identity, gender expression, veteran status, genetic information, or any other legally protected characteristic.\n\nYour personal data is processed in accordance with our Candidate Privacy Notice (https://www.wayfair.com/careers/privacy). If you have any questions or wish to exercise your rights under applicable privacy and data protection laws, please contact us at dataprotectionofficer@wayfair.com.\n\nRead Full Description",
    "created_at": "2025-01-31 10:58:03.246955+00"
  },
  {
    "companyName": "emagine",
    "externalUrl": "https://pl.linkedin.com/jobs/view/android-developer-at-emagine-4139625899?position=4&pageNum=0&refId=TjZH%2FWFxDLMU5g%2Bntli1Lw%3D%3D&trackingId=0LfDUJtzGYdjajpqp9B%2B5g%3D%3D",
    "description": "**Location:** Remote (Poland)  \n  \n**Industry:** Energy sector  \n  \n**Workload:** 32-40h/week  \n  \n**Duration:** Until 31.12.2025 (with possible extension)  \n  \n**Project Overview**  \n  \nJoin a team of 7 specialists (SAP Developers, Back-end Developer, iOS Developer, Android Developer, Front-end Developer) working on a suite of 6 products to optimize workforce management in the energy sector. The role focuses on scheduling work, managing meters, and handling processes like replacements and maintenance.  \n  \n**Technologies & Competencies**  \n  \n\n-   Development: Android Studio, Kotlin, Java\n-   UI: Jetpack Compose, XML Views, ViewBinding\n-   State Management: LiveData, StateFlow\n-   Dependency Injection: Dagger\n-   Networking: Retrofit (REST API)\n-   Data Storage: Room Database, WorkManager for background tasks\n-   Security & Optimization: ProGuard, R8\n-   Asynchronous Programming: Coroutines, Observables\n-   Testing: Espresso, Robolectric, Mockito/MockK\n-   Messaging & Notifications: Firebase Messaging\n-   Camera APIs: CameraX for image handling\n-   CI/CD: Azure Pipeline\n-   Authentication & User Management: Microsoft Authentication Library (MSAL), Azure DevOps\n-   Google Play Console: Release management\n-   Dutch language skills are a plus!\n\n**Responsibilities**  \n  \n\n-   Translating business requirements into user stories.\n-   Developing and maintaining Android app features.\n-   Fixing data-related issues (requires SQL and backend architecture knowledge).\n-   Code reviews and pull request management.\n-   Participating in refinement meetings.\n-   Managing user accounts, roles, and permissions in Azure DevOps.\n-   Training and supporting users (team members, planners, mechanics).\n\n**We offer:**  \n  \n\n-   Private medical care (Medicover) and Multisport card.\n-   Referral program.\n-   emagine mobile application – easy reporting of working time, quick access to new offers.",
    "created_at": "2025-01-31 11:14:46.074655+00"
  },
  {
    "companyName": "Discoveries Quintessential",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-discoveries-quintessential-4139143639?position=58&pageNum=0&refId=vjp7jD8lNqqgqYtu96zXvw%3D%3D&trackingId=P2Q46pptVMbNdrPV11bKtA%3D%3D",
    "description": "**Position:** Android Developer\n\n**Location**: Pune\n\n**Department:** Engineering\n\n  \n\n**Overview:**\n\nWe are looking for a talented Android Developer with experience in building high-performance,\n\nscalable, and secure mobile applications for the Android platform. The ideal candidate will\n\nhave good grasp in Java and/or Kotlin and the Android SDK, as well as a solid understanding\n\nof mobile app lifecycle, UI/UX best practices, and performance optimization. You will be\n\nresponsible for developing and maintaining Android apps, collaborating with backend\n\ndevelopers to integrate APIs, and ensuring a seamless user experience across devices.\n\n  \n\n**Key Responsibilities:**\n\n● Design, develop, and maintain mobile applications for the Android platform using Java\n\nand/or Kotlin.\n\n● Work closely with the backend team to integrate RESTful APIs and ensure smooth\n\ncommunication between the mobile app and backend services.\n\n● Optimize mobile apps for performance, reliability, and scalability, ensuring smooth user\n\nexperiences even in resource-constrained environments.\n\n● Leverage Android NDK for performance-sensitive features or to work with low-level\n\nsystem libraries and hardware components.\n\n● Knowledge of app security best practices (e.g., data encryption, securing API keys)\n\n● Implement secure authentication and authorization mechanisms (e.g., OAuth, JWT)\n\nto safeguard user data and ensure app security.\n\n● Write unit and integration tests to ensure code quality and prevent regressions using\n\ntools such as JUnit and Espresso.\n\n● Debug and troubleshoot issues across a variety of Android devices and OS versions,\n\nensuring cross-device compatibility.\n\n● Participate in code reviews, ensuring the code is clean, well-structured, and\n\nmaintainable.\n\n● Handle the app deployment process to Google Play Store, including versioning,\n\ncompliance, and submission requirements.\n\n● Open to learn and work in any and all latest technologies.\n\n  \n\n**Technologies Required:**\n\n● Kotlin or Java for Android development\n\n● Android SDK and Android Studio for app development and testing\n\n● Android NDK (Native Development Kit) for building native libraries and performance-\n\ncritical features\n\n● RESTful API integration\n\n● Gradle for project automation and dependency management\n\n● Version control using Git (GitHub, GitLab, Bitbucket, etc.)\n\n● JSON for data interchange between mobile app and backend services\n\n● Push Notifications (Firebase Cloud Messaging, etc.)\n\n● Knowledge of SQLite and Room Database for local storage on Android\n\n● Firebase for authentication, cloud messaging, push notifications, and real-time data\n\n● Android Jetpack libraries (e.g., Navigation, LiveData, ViewModel, etc.)\n\n● Familiarity with Google Play Console for app submission, versioning, and compliance\n\nwith Google’s app store policies\n\n● Knowledge of App bundles and Gradle build flavors for app distribution\n\n  \n\nNice to Have:\n\n● Develop intuitive and responsive user interfaces following the Material Design\n\nguidelines to ensure the best user experience across various screen sizes.\n\n● Implement third-party libraries and APIs (e.g., Firebase, Google Maps, Push\n\nNotifications) to extend app functionality.\n\n● Experience in integrating third-party SDKs and APIs (e.g., payment gateways, social\n\nmedia logins)\n\n● Familiarity with App Architecture Patterns like MVVM or MVP for Android development\n\n● Experience with mobile analytics platforms (e.g., Firebase Analytics, Google\n\nAnalytics)",
    "created_at": "2025-01-31 11:14:46.073371+00"
  },
  {
    "companyName": "Qualcomm",
    "externalUrl": "https://in.linkedin.com/jobs/view/automotive-software-engineer-staff-sr-staff-bdc-at-qualcomm-4139853351?position=5&pageNum=7&refId=mI3tvRPxoAgDNHo7%2BKaziQ%3D%3D&trackingId=ty%2Fve64OSzUIJRW6cr%2FXXQ%3D%3D",
    "description": "**Company**  \n  \nQualcomm India Private Limited  \n  \n**Job Area**  \n  \nEngineering Group, Engineering Group > Software Engineering  \n  \n**General Summary**  \n  \nQualcomm is building on its core strengths in wireless and compute technologies and is in the middle of the biggest technology revolution in the Automotive space. While Qualcomm has pioneered connected car technologies for over a decade, it is now playing a critical role in the evolution of Automotive Infotainment, Telematics, ADAS/Autonomous Driving & its supporting technologies. We are investing in several bleeding edge technologies such 5G, Cellular V2X, Computer Vision, AI/Deep Learning etc., and are working closely with global Automakers/Tier-1s, standards bodies, consortiums and operators on pushing the boundaries.  \n  \nQualcomm Automotive Team is looking for dynamic individuals who can make difference on many technology forefronts in Automotive space, join our growing multisite engineering organization.  \n  \n**Minimum Qualifications**  \n  \n\n-   Bachelor's degree in Engineering, Information Systems, Computer Science, or related field and 6+ years of Software Engineering or related work experience.\n\nOR  \n  \nMaster's degree in Engineering, Information Systems, Computer Science, or related field and 5+ years of Software Engineering or related work experience.  \n  \nOR  \n  \nPhD in Engineering, Information Systems, Computer Science, or related field and 4+ years of Software Engineering or related work experience.  \n  \n\n-   3+ years of work experience with Programming Language such as C, C++, Java, Python, etc.\n-   Bachelors or Masters in Engineering\n-   At-least 9 to 16 years experience in below areas.\n-   Hands on experience of driver development on any RTOS\n-   Handson Experience in Autosar software development\n-   Detailed understanding SoC hardware blocks - Clocks, PLLs, GPIO, Interrupt Controllers (GIC), Peripherals (SPI/I2C/PCIE/CAN/Ethernet/USB/UFS), power management\n-   Experience in Linux kernel architecture, device drivers and memory management.\n-   Embedded multimedia product development experience in Android Smartphones, Network based Graphics/Video/Camera/Display/Computer Vision products\n-   Experience in ISO26262/functional safety\n-   Exposure to one or more of below technology areas is a plus:-\n-   Multiprocessor Architecture, ARM processors, caching, interrupts, etc.,\n-   Virtualization technologies across CPU and MM hardware accelerators\n\n**Applicants**: Qualcomm is an equal opportunity employer. If you are an individual with a disability and need an accommodation during the application/hiring process, rest assured that Qualcomm is committed to providing an accessible process. You may e-mail disability-accomodations@qualcomm.com or call Qualcomm's toll-free number found here. Upon request, Qualcomm will provide reasonable accommodations to support individuals with disabilities to be able participate in the hiring process. Qualcomm is also committed to making our workplace accessible for individuals with disabilities. (Keep in mind that this email address is used to provide reasonable accommodations for individuals with disabilities. We will not respond here to requests for updates on applications or resume inquiries).  \n  \nQualcomm expects its employees to abide by all applicable policies and procedures, including but not limited to security and other requirements regarding protection of Company confidential information and other confidential and/or proprietary information, to the extent those requirements are permissible under applicable law.  \n  \n**To all Staffing and Recruiting Agencies**: Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.  \n  \nIf you would like more information about this role, please contact Qualcomm Careers.  \n  \n**3071096**",
    "created_at": "2025-01-31 12:30:13.844702+00"
  },
  {
    "companyName": "Atyourtime Secured Food Delivery",
    "externalUrl": "https://uk.linkedin.com/jobs/view/developer-at-atyourtime-secured-food-delivery-4139655203?position=41&pageNum=0&refId=dq0kCeEvPi%2Fp6ihicdbE5A%3D%3D&trackingId=9RpwOszgn6EPBvNJ2XrdFA%3D%3D",
    "description": "**Atyourtime is redefining secure delivery solutions through innovative technology and the commitment to sustainability. Our mission is to create tamper proof scalable platforms that revolutionise food and packaging worldwide. As a start up we value ambition, collaboration and a hands on approach to problem solving. This is an equity only position, perfect for someone eager to play a pivotal role in shaping the future of a ground breaking company.**\n\n  \n\nWe are hiring!!\n\nWe are looking for experienced, savvy, hands-on Developers to join our growing team. If you are self-motivated, have an entrepreneurial mindset, like to take ownership, and are interested in exciting new product development, this could be the role for you.\n\nIf you have experience in any or all of the following, please read on.\n\n  \n\n**Mobile App Developer - Android**\n\nStrong foundation in Kotlin development together with a working knowledge of Java\n\nExperience integrating third party SDKs\n\nKnowledge of Android architectural patterns such as MVVM, Clean Architecture is a plus\n\n**Mobile App Developer - iOS**\n\nA good understanding in Swift development, with supporting experience in Objective - C\n\nExperience integrating third party SDKs\n\nFamiliarity with iOS architecture patterns and best practice\n\n**Front End Web Application Developer**\n\nHands on experience with Angular JS and modern front end frameworks\n\nStrong understanding of front end workflows and UX/UI principals\n\nExperience in building web based UAC systems\n\n**Back end Application Developer**\n\nExperience developing and refactoring enterprise level scalable Node.js applications\n\nStrong understanding of back end architectures and best practices\n\nExperience with MongoDB and working knowledge of database scalability techniques\n\nExperience building web based UAC systems\n\n**DevOps Engineer & Service Administrator**\n\nProficiency in Linux administration\n\nExperience in setting up automated CI/CD pipelines. Strong expertise in AWS administration tools and services such as EC2, IAM, Cognito, SQS/SNS.\n\nHands on experience with GitHub Actions\n\nExperience of Google Firebase would be a bonus\n\n**What we offer**\n\nPlease note this is currently an equity based package with a view to becoming a salaried role\n\nFlexible working environment but should be able to travel to London on occasions\n\nOpportunity to work with cutting edge technologies\n\nProfessional growth and development opportunities\n\nSupportive and collaborative team culture\n\n**How to apply**\n\nIf you have experience or expertise in any or all of the above and you are eager to work in an exciting and fast paced environment, we would love to hear from you. Send your CV to **People@atyourtime.com** with the subject “Developers -\\[Your name\\]”\n\nJoin us and be part of a team that builds the future of technology.\n\nNo agencies please!",
    "created_at": "2025-01-31 13:30:15.119187+00"
  },
  {
    "companyName": "AKASJKUMAR ANANDBHAI TANDEL",
    "externalUrl": "https://www.indeed.com/rc/clk?jk=8babc35c213addf5&bb=TQlwhQ-7Z5JDaEvg68ZcNNZudA-EVdmpLq2RWxdipGmQsTfISb9BlFs73dkkSensKSktqO2hF4m5Qp-m7rKV_w7xuyJSrbiJwHbGZ82cManA7xFDXMIw3ErSKugH7vq8&xkcb=SoBy67M32eZ9p1TZlh0LbzkdCdPP&fccid=6061ed2e5930d44b&cmp=AKASJKUMAR-ANANDBHAI-TANDEL&ti=Android+Developer&vjs=3",
    "description": "Application develope as my requirement\n\nJob Type: Full-time\n\nPay: ₹6,000.00 - ₹20,000.00 per month\n\nEducation:\n\n-   Bachelor's (Preferred)\n\nExperience:\n\n-   Android Development: 1 year (Preferred)\n-   total work: 1 year (Preferred)\n\nWork Location: Remote",
    "created_at": "2025-01-31 13:30:43.963584+00"
  },
  {
    "companyName": "WebShar4.4",
    "externalUrl": "https://www.glassdoor.co.in/job-listing/senior-react-native-developer-webshar-JV_KO0,29_KE30,37.htm?jl=1009618895928",
    "description": "Senior React Native Developer\n\nJob Description\n\nWe are looking for a Senior React Native developer interested in building performant mobile  \napps on both the iOS and Android platforms. You will be responsible for architecting and  \nbuilding these applications, as well as coordinating with the teams responsible for other layers  \nof the product infrastructure. Building a product is a highly collaborative effort, and as such, a  \nstrong team player with a commitment to perfection is required.\n\nResponsibilities  \n\n-   Develop and maintain high-quality mobile applications using React Native for iOS and\n\nAndroid platforms.  \n\n-   Leverage native APIs for deep integrations with both platforms.\n-   Write clean, maintainable, and efficient code while adhering to best practices.\n-   Participate in code reviews, design discussions, and architecture decisions.\n-   Optimize application performance for maximum speed and scalability.\n-   Diagnose and fix bugs and performance bottlenecks for performance that feels native.\n-   Reach out to the open source community to encourage and help implement\n\nmission-critical software fixes.  \n\n-   Maintain code and write automated tests to ensure the product is of the highest quality.\n-   Transition existing React web apps to React Native.\n\nSkills  \n\n-   Proficiency in JavaScript, TypeScript, and React/React Native.\n-   Knowledge of functional or object-oriented programming\n-   Should have knowledge of redux, redux-saga, hooks, axios\n-   Ability to write well-documented, clean Javascript code\n-   Solid understanding of mobile UI/UX principles and best practices.\n-   Should be aware of app deployment process(for both android and ios)\n-   Rock solid at working with third-party dependencies and debugging dependency\n\nconflicts  \n\n-   Familiarity with native build tools, like XCode, Gradle (Android Studio, IntelliJ)\n-   Should have experience of debugging app on xcode and android studio\n-   Understanding of REST APIs, the document request model, and offline storage\n-   Experience with automated testing suites, like Jest or Mocha\n-   Should have experience of version control tool(git, bitbucket)\n\nRequirements\n\n-   Upto 5-6 years of relevant work experience\n-   BS or higher degree in Computer Science or relevant fields\n\nJob benefits and compensation\n\n-   WebShar offers a very competitive salary depending on experience\n-   MacBook Pro\n-   Flexible time / and availability to work from home from time to time\n-   24 days paid vacation each year (CL, PL, SL), earned at a rate of 2 days per month.\n-   Medical insurance\n-   Team outing and lunches\n-   Reimbursement as per HR policies:\n\n1\\. Internet reimbursement upto 1500  \n2\\. Commutation reimbursement upto 6000  \n3\\. ISD reimbursement",
    "created_at": "2025-01-31 14:01:01.497869+00"
  },
  {
    "companyName": "Motorola Solutions",
    "externalUrl": "https://in.linkedin.com/jobs/view/enterprise-architect-mobile-applications-at-motorola-solutions-4139175116?position=31&pageNum=0&refId=X8smnh5lI4ONVx01dc3QIg%3D%3D&trackingId=fa0LTqpVdSno6Rnq7bq%2FVg%3D%3D",
    "description": "**Company Overview**\n\nAt Motorola Solutions, we're guided by a shared purpose - helping people be their best in the moments that matter - and we live up to our purpose every day by solving for safer. Because people can only be their best when they not only feel safe, but are safe. We're solving for safer by building the best possible technologies across every part of our safety and security ecosystem. That's mission -critical communications devices and networks, AI-powered video security & access control and the ability to unite voice, video and data in a single command center view. We're solving for safer by connecting public safety agencies and enterprises, enabling the collaboration that's critical to connect those in need with those who can help. The work we do here matters.\n\n  \n\n**Department Overview**\n\nMotorola Solutions build and connect technologies to help protect people, property and places, enabling critical collaboration between public safety agencies and enterprises.\n\n  \n\nThe Client Organization, under Unified Communications business unit, builds best-in class broadband-based mobile applications with broad portfolio of secure voice, video and data services which enable businesses and public agencies around the world to communicate and operate effectively and efficiently, providing a unified experience across Land Mobile Radio and Broadband.\n\n  \n\nJob Description\n\nAnalyzes, develops, designs, and maintains software for the organization’s products and systems. Performs system integration of software and hardware to maintain throughput and program consistency. Develops, validates, and tests: structures and user documentation.\n\n  \n\n\\- Collaborate with senior management to formulate AI , next generation cross-platform Mobile Application development framework adoption and integration strategies into Mobile Application Development to enhance user experience, automate test-execution, increase engineering efficiency.\n\n\\- Functioning as a strategic orchestrator, engage with key stakeholders and collaborate closely with cross-functional teams to ensure the effective implementation of strategic initiatives, facilitating communication & coordination across agile teams to drive technology, architectural alignment and ensure the successful execution of strategic initiatives.\n\n\\- Implemented security architecture policies/practices with zero-tolerance compliance and audit.\n\n\\- Integrate AI Based DevOps methodologies to automate Lean-Agile framework, and user engagement model.\n\n\\- Suggest the AI based tool chains to monitor the quality gates of the test automation framework\n\n\\- Translated organization AI vision into architecture strategies for Mobile Applications.\n\n  \n\nBasic Requirements\n\n-   Hands on 5-10 years of experience in development using C, multithreading, data structures on VoIP solution ( SIP, RTP, RTCP, TCP/UDP, H264 protocol, codecs for Video and Audio solution).\n-   2-5 Years of experience in development and integration of AI based tool chains, SDKs such as Tensor Flow, GitHub Copilot, ML Kit, Google Assistant, App Code, Gemini API etc. into Android, iOS based Mobile Application , Test-Automation\n\n  \n\nTravel Requirements\n\nNone\n\n  \n\nRelocation Provided\n\nNone\n\n  \n\nPosition Type\n\nExperienced\n\n  \n\nReferral Payment Plan\n\nYes\n\n  \n\n**_EEO Statement_**\n\n  \n\nMotorola Solutions is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion or belief, sex, sexual orientation, gender identity, national origin, disability, veteran status or any other legally-protected characteristic.\n\n  \n\nWe are proud of our people-first and community-focused culture, empowering every Motorolan to be their most authentic self and to do their best work to deliver on the promise of a safer world. If you’d like to join our team but feel that you don’t quite meet all of the preferred skills, we’d still love to hear why you think you’d be a great addition to our team.",
    "created_at": "2025-01-31 14:00:14.043577+00"
  },
  {
    "companyName": "DefineX - Consulting, Technology & Labs",
    "externalUrl": "https://tr.linkedin.com/jobs/view/senior-android-developer-at-definex-consulting-technology-labs-4139657257?position=27&pageNum=0&refId=dq0kCeEvPi%2Fp6ihicdbE5A%3D%3D&trackingId=TcSvOlzj9V2q%2F62rUJRVgw%3D%3D",
    "description": "**DefineX Team:**\n\nDefineXers are our powerhouse and at the heart of our success: Experts. Innovators. People who are driven by excellence and bring their \"A\" game every day.\n\nThrough our services and platforms, we are here to accelerate digital transformation and liberate business world via technology. We are aspired to define \"the next\" globally.\n\nYOU? You deserve to do what you love, and love what you do – a career that works as hard for you as you do. At DefineX we are 320 DefineXers, delivering superior value for our clients through leading technology, targeted innovation and excellence in everything we do. You have choices – if you strive to be a part of a team driven to create with purpose, now is your chance to Find your Forward as **“Senior Android Developer”** with DefineX.\n\n  \n\n**Your Impact:**\n\n-   Developing **Android** applications for banking projects,\n-   Supporting the entire application lifecycle,\n-   Bringing new technology and ideas to the table,\n-   Producing fully functional mobile applications,\n-   Eligible to work in Turkey.\n\n  \n\n**What You Bring to the Table:**\n\n-   Bachelor’s degree in Computer Science, Information Technology Management or Engineering or other comparable degrees,\n-   **5+ years** hands-on native Android Development Experience,\n-   Proficient on Android Development with **Kotlin**,\n-   Extensive knowledge of OOP, Design Patterns and SOLID principles,\n-   Understanding of web services; RESTFUL Architecture, JSON with their use in mobile implementation.\n\n  \n\n**Benefits and Perks:**\n\n**We highly value** A mentally and physically enabling environment where Best People want to be part of; we always respect and invest in talent to foster team success.\n\n**Growth and Development**: Be part of a growing global team of professionals with training and support to help you grow. Every DefineXer has a Growth Coach to accelerate their growth through feedback!\n\n**Independence and Ownership**: Blur in creative and challenging business and technology transformation projects.\n\n**Time Off:** 20 vacation days per annum.\n\n**We love to Give Back**: You will get certain hours a year to volunteer and organize office volunteer programs with local NGOs.\n\n**Health and Wellness:** Competitive private health and life insurance coverage.\n\n  \n\nNeed more convincing that DefineX is a great place to work?\n\n-   Follow us on Instagram to take a deep dive into who we really are: IG **@teamdefinex!**\n-   Get to know more about our **extraordinary minds**,\n-   Also, **hear** from our tech leaders as they talk about why they love what they do and how the culture at DefineX enables them to take part in exciting projects!\n\n  \n\n_At DefineX, we don't just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of TeamDefineX! We are proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, marital status, disability, gender identity or veteran status. TeamDefineX will advocate for, and provide reasonable accommodations to those applicants requiring them, based on the Turkish Disabilities Act, to ensure equal opportunity in the application process._",
    "created_at": "2025-01-31 13:30:15.119187+00"
  },
  {
    "companyName": "Annachy (by Saravana Stores)",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-annachy-by-saravana-stores-4139850054?position=3&pageNum=7&refId=Nh8ryIKygw8lB7SbQsia2g%3D%3D&trackingId=0VfCaqonTkjzawI%2BCisfkw%3D%3D",
    "description": "**About Us**:\n\n  \n\nWe are an early-stage ecommerce venture, part of a renowned South Indian retail chain with a 50+ year legacy. Our mission is to deliver a seamless online shopping experience to value conscious customers.\n\n  \n\n**Why Annachy?**\n\n  \n\nGrowth Potential: You will get to play a pivotal role in building a high-growth company from the ground up; a unique opportunity to shape the future of value e-commerce, for crores of customers, starting with South India.\n\n  \n\nAttractive compensation and benefits for the right candidate. \n\n  \n\n**Relevant Experience**: Above 4 to 8 years\n\n**Responsibilities:**\n\n-   Design and develop advanced applications for the Android platform using **Kotlin**.\n-   Implement responsive UI and user-centric features with **Jetpack Compose**.\n-   Collaborate with cross-functional teams to define, design, and ship new features.\n-   Identify and fix bottlenecks and bugs to ensure application performance.\n-   Follow **MVVM** architecture and ensure adherence to **Clean Architecture** principles.\n-   Stay updated with the latest industry trends and technologies.\n\n**Required Skills:**\n\n-   Strong proficiency in **Kotlin**.\n-   Hands-on experience with **Jetpack Compose**.\n-   Familiarity with **Android Studio**, **Gradle**, and version control tools like **Git**.\n\n**Added Advantage:**\n\n-   Familiarity with **Flutter**.\n\n  \n\n**Preferred:**\n\nStart-up Experience: Comfortable working in a fast-paced environment to build things from scratch.\n\nE-commerce/B2C Marketplace Experience: Hands-on experience working on e-commerce platforms, B2C apps, or marketplaces.\n\nLocation: Chennai",
    "created_at": "2025-01-31 11:02:16.464527+00"
  },
  {
    "companyName": "Entri",
    "externalUrl": "https://in.linkedin.com/jobs/view/entri-senior-ios-developer-swift-kotlin-multiplatform-at-entri-4139519757?position=2&pageNum=7&refId=Nh8ryIKygw8lB7SbQsia2g%3D%3D&trackingId=y47XF%2BBT1qnimyiaLlsxcA%3D%3D",
    "description": "job Title: Senior iOS Developer  \n  \nLocation: Kochi, Kerala (Work from Office)  \n  \nExperience: 5+ years  \n  \nEmployment Type: Full-Time  \n  \nWe're Entri, a fast-growing, EdTech startup from Kochi and we're on the lookout for a passionate and skilled Mobile Product Engineer with a focus on iOS to join our pioneering Product Team.  \n  \nSkill and adaptability are at our core, and we're seeking a professional with 5+ years of iOS development expertise to help shape the future of educational technology with us.  \n  \n**What We Offer**  \n  \n\n-   A culture of continuous learning and immense growth opportunities.\n-   The chance to undertake challenging and fulfilling roles in a cutting-edge environment.\n-   The opportunity to do impactful work and make significant contributions to our rapidly evolving products.\n\n**Job Description**  \n  \nWe are seeking an experienced Senior iOS Developer to join our team in building an advanced iOS application.  \n  \nThe app utilizes SwiftUI for most of the user interface, with Kotlin Multiplatform for shared business logic and Compose Multiplatform for specific UI components where appropriate.  \n  \nThe ideal candidate is a seasoned iOS developer with experience in Swift and expertise in managing Push Notifications, In-App Purchases (IAP), and App Store distribution processes and CI/CD pipelines.  \n  \n**Responsibilities**  \n  \n\n-   App Development :\n-   Design, build, and maintain high-quality iOS applications, primarily using SwiftUI for UI development.\n-   Collaborate with the team to explore Kotlin Multiplatform for shared business logic where necessary.\n-   Ensure the performance, quality, and responsiveness of applications.\n-   Architecture & Code Quality :\n-   Work with cross-functional teams to define, design, and ship new features.\n-   Write clean, maintainable, and testable code following MVVM and other suitable architectural patterns.\n-   App Store Management :\n-   Handle the complete lifecycle of app distribution, from development to deployment and App Store release.\n-   Ensure compliance with App Store policies and manage updates effectively.\n-   Collaboration :\n-   Work closely with designers, backend developers, and product managers to deliver high-quality, seamless user experiences.\n-   Conduct code reviews and mentor junior developers on best practices.\n-   CI/CD Implementation :\n-   Set up and maintain CI/CD pipelines for streamlined development and deployment processes.\n-   Automate testing, builds, and deployments to ensure high code quality and faster delivery.\n-   Testing & Optimization :\n-   Implement unit and UI tests to maintain code quality.\n-   Optimize app performance for memory efficiency and smooth user experience.\n\n**Key Requirements**  \n  \nTechnical Skills :  \n  \n\n-   Proficiency in Swift and SwiftUI for iOS development.\n-   Strong knowledge of UIKit and Objective-C.\n-   Experience implementing and managing Push Notifications and In-App Purchases (IAP), ensuring compliance with App Store guidelines.\n-   Experience with App Store distribution processes.\n-   Familiarity with Core Data, Core Animation, and Grand Central Dispatch (GCD) and Combine Frameworks\n-   Experience with RESTful APIs and backend integration.\n-   Familiarity with version control workflows using Git and dependency management tools like CocoaPods or Swift Package Manager\n-   Nice to Have :\n-   Experience with Android Kotlin and Jetpack Compose for potential cross-platform development.\n-   Experience with Kotlin Multiplatform (KMM) for shared business logic and Compose Multiplatform for UI components.\n\n**Soft Skills**  \n  \n\n-   Strong problem-solving skills and attention to detail.\n-   Excellent communication and teamwork abilities.\n-   Proven ability to work independently and meet project timelines.\n\n(ref:hirist.tech)",
    "created_at": "2025-01-31 11:02:16.464527+00"
  },
  {
    "companyName": "InPost",
    "externalUrl": "https://pl.linkedin.com/jobs/view/senior-android-developer-at-inpost-4139650753?position=7&pageNum=0&refId=dq0kCeEvPi%2Fp6ihicdbE5A%3D%3D&trackingId=cqE5lGchG5fsUoh6GtwL%2BQ%3D%3D",
    "description": "InPost Group is an innovative European out-of-home delivery company, revolutionizing the way parcels are delivered to customers. With operations across several countries, our network of intelligent lockers provides customers with a fast, convenient, and secure delivery option. InPost Group is a publicly tr_ad_ed company, with a market capitalization of about $5 billion as of March 2023. With about 30,000 employees worldwide, InPost Group is one of the largest out-of-home delivery providers in Europe, committed to providing sustainable and efficient delivery solutions to meet the evolving needs of customers in today's rapidly changing landscape.  \n  \n  \n  \n\n**Job Description**  \n  \n\nAt InPost we have built one of the most well-recognized and appreciated mobile applications in the European Logistics sector, with 10+ million users, and we are not stopping there. Our next step is conquering the international European market and scaling our Mobile platform and applications across Europe.  \n  \n\nWe are looking for experienced Android developers to join us in that journey - heavily influence our platform build, improve processes, and help us deliver the best native app experience in the market.  \n  \n\n**Responsibilities**  \n  \n\n-   Develop test-covered code at a high quality and take part in team decisions to build scalable and maintainable apps.\n-   Participate in code reviews to ensure code quality, best practices, and standards are followed.\n-   Document technical specifications, installation procedures, and other relevant information for applications.\n-   Collaborate with cross-functional teams to define, design, and ship new features\n-   Continuously discover, evaluate, and implement new technologies to maximize development efficiency\n\n  \n  \n\n**Technologies used:**  \nKotlin, Jetpack Compose, Coroutines, RXJava, Retrofit, Room, Dagger Hilt, Modularized code base, Clean architecture.  \n  \n  \n  \n\n**Qualifications**  \n  \n\n-   Be comfortable working in an agile cross-functional team.\n-   The ability to comfortably work independently in Kotlin & Java, refactoring existing code to improve its design while working in an agile environment.\n-   An understanding of Mobile Software architectures including MVVM, Clean Architecture, and SOLID principles.\n-   Experience in Continuous Integration / Continues Deployment, and release process. A good understanding of how to use git.\n-   Good understanding of UI/UX design principles and material design.\n\n**Additional Information**  \n  \n\n**Why InPost?**  \n  \n\n-   Professional growth within the company.\n-   Excellent working environment.\n-   Chances to broaden your skill set and acquire new competencies.\n-   Remote work.\n-   Private healthcare, Multisport card, and group insurance.\n-   Access to the Worksmile platform.\n-   Workation programme.\n-   Flexible working hours.",
    "created_at": "2025-01-31 13:30:15.119187+00"
  },
  {
    "companyName": "MISTO",
    "externalUrl": "https://ua.linkedin.com/jobs/view/mobile-team-lead-at-misto-4136782442?position=26&pageNum=0&refId=PokO8KwkoDpNkQvGGGvpvQ%3D%3D&trackingId=0aqFzi2ywc1texWcn0jvdg%3D%3D",
    "description": "**About Us**\n\nWe are seeking an experienced **Mobile Team Lead** to manage and mentor our mobile development team. In this role, you will provide technical leadership, oversee the development of mobile applications, and ensure the successful delivery of high-quality software. The ideal candidate has a strong technical background in both iOS and Android development, along with proven experience in team management and mobile architecture.\n\n**Responsibilities**\n\n-   Lead and mentor a team of **iOS and Android developers**, fostering a culture of technical excellence.\n-   Act as the primary decision-maker for mobile **architecture, tools, and frameworks**.\n-   Oversee the **design, development, and maintenance** of mobile applications.\n-   Ensure the delivery of **scalable, high-quality, and maintainable** mobile solutions.\n-   Stay hands-on by contributing to development, troubleshooting, and resolving critical issues.\n-   Define and enforce **best practices, coding standards, and development workflows**.\n-   Monitor **application performance** and implement optimizations as needed.\n-   Collaborate with **backend engineers, QAs, product managers, and other stakeholders**.\n-   Support and improve **CI/CD pipelines** to streamline development and deployment processes.\n-   Facilitate task planning, decomposition, and sprint grooming sessions.\n-   Hire, onboard, and support the growth of new mobile developers.\n\n**Requirements**\n\n-   **5+ years** of experience in **iOS and Android** mobile application development.\n-   Proven experience **leading and mentoring** development teams.\n-   Strong expertise in **Swift and Kotlin** (experience with React Native or Flutter is a plus).\n-   Extensive experience in **mobile architecture, scalability, and performance optimization**.\n-   Hands-on experience with **CI/CD pipelines, version control (Git), and cloud services**.\n-   Experience publishing and maintaining apps on the **App Store and Google Play**.\n-   Strong problem-solving skills and the ability to make strategic technical decisions.\n-   Excellent communication and leadership skills, with the ability to collaborate across teams.\n\n**Preferred Qualifications**\n\n-   Experience with **cross-platform development** (React Native, Flutter).\n-   Knowledge of **mobile security best practices**.\n-   Familiarity with **Agile development methodologies**.\n\n**What We Offer**\n\n-   The opportunity to **lead a growing mobile development team**.\n-   A **collaborative and supportive** work environment.\n-   Competitive salary and **career growth opportunities**.\n-   Flexible work arrangements and **a strong focus on professional development**.\n\nIf you are passionate about mobile technologies, leadership, and innovation, we encourage you to apply.",
    "created_at": "2025-01-31 15:00:14.642538+00"
  },
  {
    "companyName": "Intellectsoft",
    "externalUrl": "https://pl.linkedin.com/jobs/view/senior-android-developer-at-intellectsoft-4139612204?position=2&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=uMq27%2FnlC7%2Byri%2BKCpECCg%3D%3D",
    "description": "Intellectsoft is a software development company delivering innovative solutions since 2007. We operate across North America, Latin America, the Nordic region, the UK, and Europe.We specialize in industries like Fintech, Healthcare, EdTech, Construction, Hospitality, and more, partnering with startups, mid-sized businesses, and Fortune 500 companies to drive growth and scalability. Our clients include Jaguar Motors, Universal Pictures, Harley-Davidson, Qualcomm, and London Stock Exchange.Together, our team delivers solutions that make a difference. Learn more at www.intellectsoft.net  \n  \n**Requirements**  \n  \n\n-   Bachelor's deegree in a technical field, or equivalent work or training experience\n-   Minimum of 5 years working on native Android development\n-   Proficiency with Kotlin and Android Studio, RxJava, Dagger2, Retrofit2, Room\n-   Experience with collections, multithreading, synchronization\n-   Understanding of mobile architecture patterns (MVVM, MVC, etc.)\n-   Experience with RESTful APIs to connect mobile applications to back-end services\n-   Understanding of Google's Material Design Guidelines\n-   Knowledge of mobile app distribution processes (Google Play Store)\n-   Understanding of automated testing frameworks for mobile applications, experience in unit tests (JUnit, Mockito, Robolectric)\n-   Git, gitflow, pull request, code review - are the everyday words/tools for you\n\n**Nice To Have Skills**  \n  \n\n-   Experience with Firebase\n-   Knowledge of Cloud Services\n-   Understanding of CI/CD principles for mobile development\n-   Experience with app analytics tools like Google Analytics, Firebase Analytics\n-   Experience designing, building, and maintaining REST APIs, using tools like Swagger, MITM\n\n**Responsibilities:**  \n  \n\n-   Collaborate with the team to design, implement, and deploy new mobile applications and improvements\n-   to existing mobile applications\n-   Develop new functionalities\n-   Maintain production systems, perform root cause analysis of issues\n-   Active participation in the Scrum process\n-   Ensure good testing coverage of unit and integration testing\n-   Participate in peer design and code reviews\n-   Proactively collaborate with teammates\n\n**Benefits**  \n  \n\n-   35 paid absence days per year for work-life balance of each specialist + 1 additional day for each following year of cooperation with the company\n-   Up to 15 unused absence days can be add to income after 12 month of cooperation\n-   Health insurance for you and your family!\n-   Depreciation coverage for personal laptop usage for project needs\n-   Udemy courses of your choice\n-   Regular soft-skills trainings\n-   Excellence Сenters meetups",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "seamless.ly",
    "externalUrl": "https://uk.linkedin.com/jobs/view/mobile-developer-at-seamless-ly-4139490580?position=6&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=a9p%2BfyjTc6huok6OJ2uI%2Bw%3D%3D",
    "description": "**About the Role**\n\nWe are looking for an experienced Mobile Developer with expertise in both iOS (Swift) and Android (Kotlin) development. Your primary responsibility will be to convert our existing iOS app into a fully functional Android application, ensuring performance, scalability, and a seamless user experience.\n\n  \n\n**Responsibilities**\n\n-   Convert our existing iOS app (Swift) into an equivalent Android app (Kotlin) while maintaining all core functionalities\n-   Ensure a smooth and consistent user experience across both platforms\n-   Debug, test, and resolve platform-specific challenges during the conversion process\n-   Collaborate with our team to align development efforts with business goals\n-   Implement best practices for code quality, performance, and security\n\n  \n\n**Requirements**\n\n-   Proven experience in developing both iOS (Swift) and Android (Kotlin) applications\n-   Strong understanding of platform differences, UI/UX guidelines, and performance optimization\n-   Experience with third-party APIs, cloud services, and offline-first architectures\n-   Familiarity with Firebase, Salesforce SDKs, and Google Cloud (preferred but not required)\n-   Ability to work independently, communicate effectively, and deliver high-quality code\n-   Experience with GitHub for version control\n\n  \n\n**Why Join Us?**\n\n-   Fully remote contract opportunity\n-   Flexible work arrangements\n-   Potential for future collaboration on new projects\n\n  \n\nIf you have experience in cross-platform development and are looking for a new challenge, we’d love to hear from you.",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "Nimber",
    "externalUrl": "https://pt.linkedin.com/jobs/view/android-developer-at-nimber-4139325892?position=1&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=o694R%2B1POeAPkKtMQBdQHQ%3D%3D",
    "description": "Hey there, think you stumbled upon this job posting by chance? We don't believe in chance at Nimber.  \n  \nCaught your eye? Great. Keep going...  \n  \nWe are Nimber, and we are not just filling positions, we are building a team that is ready to shake things up. If you are ready to rewrite the rules and make a real impact, this is your moment.  \n  \nJoin us and lets put the future where it belongs. In the hands of passionate people.  \n  \n**But what does Nimber mean?**  \n  \nIn mathematics and game theory, they are numbers with special properties of addition and multiplication. And what we really want is to add value to customers' projects.  \n  \n**Job Title: Android Developer**  \n  \n**Location:** Remote, living in Portugal  \n  \n**Required qualifications to be successful in this role:**  \n  \n\n-   3 years of experience minimum in Android\n-   English mandatory\n\nIf you're tired of feeling like just a number, send us your application and become a Nimber.",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "AiDash",
    "externalUrl": "https://builtin.com/job/software-development-engineer-ii-android/3679877",
    "description": "The Software Development Engineer II - Android role involves designing and building a new Maps Interaction feature, contributing to product design and implementation, collaborating with teams to create functional features, and owning core product components. The position requires strong Android and Flutter development expertise, especially in consumer and enterprise applications.\n\nSummary Generated by Built In\n\n**About AiDASH?**\n\nAiDash is making critical infrastructure industries climate-resilient and sustainable with satellites and AI. Using our full-stack SaaS solutions, electric, gas, and water utilities, transportation, and construction customers are transforming asset inspection and maintenance—and complying with biodiversity net gain mandates and carbon capture goals. Our customers deliver ROI in their first year of deployment with reduced costs, improved reliability, and achieved sustainability goals. Learn more at www.aidash.com. \n\n  \n\nWe are a Series C climate tech startup backed by leading investors (including National Grid Partners, G2 Venture Partners, Lightrock, BGV, and Marubeni, among others) and by our customers-turned-advocates (Duke Energy & National Grid Partners, among others)! We have been recognised by Forbes two years in a row as one of “America’s Best Startup Employers.\" We are also proud to be one of the few climate software companies in Time Magazine’s “America’s Top GreenTech Companies 2024.\". \n\n  \n\n**How You’ll Make an Impact**\n\n-   Design and Build a completely new Maps Interaction for our Sustainability initiatives \n-   Contribute to the design and implementation of new features and products. \n-   Collaborate with product managers, developers, and creative designers to translate requirements and mock-ups into fully functional features. \n-   Rapidly learn and master new technologies to improve usability and performance ﻿ \n-   Play a key role in the design and implementation of new products and features. \n-   Translate requirements and mock-ups into fully functional features by working closely with product managers, developers, and creative designers. \n-   Break features into simpler granular tasks, estimate the effort required and identify dependencies. \n-   Write efficient and readable code based on a good understanding of design principles. \n-   Drive the product roadmap and take ownership of several core components of the product. \n\n**What we're looking for:**\n\n-   Android Development Consumer/Enterprise Application Development Experience. \n-   4+ years of solid experience designing and developing modern mobile Hybrid applications \n-   Flutter's experience in building scalable hybrid apps along with native. \n-   Experience in building and shipping complexes and business-critical hybrid apps with frequent iteration. \n-   Deep understanding of design patterns and principles with a broad knowledge of the Android & Flutter Tech stack. \n-   Deep understanding of Android SDK to create scalable, dynamic, and highly performant Ul components. \n-   Working knowledge of remote APIs, concurrency, layouts, transitions, animations, client-side persistence, and architectural patterns on mobile apps. \n-   Strong aptitude, algorithms, and data structures in AR-VR. \n-   B Tech/BE degree with a specialisation in computer science or equivalent degree from Tier 1 or Tier 2 colleges. \n\nWe are proud to be an equal-opportunity employer. We are committed to embracing diversity and inclusion in our hiring practices, and we promote a work environment where everyone, from any race, color, religion, sex, sexual orientation, gender identity, or national origin, can do their best work. \n\n  \n\nWe are committed to providing an inclusive and accessible interview experience for all candidates. Please let us know if you require any accommodation during the interview process, and we will make every effort to meet your needs.\n\nRead Full Description",
    "created_at": "2025-01-31 10:58:03.246955+00"
  },
  {
    "companyName": "HARMAN India",
    "externalUrl": "https://in.linkedin.com/jobs/view/principal-engineer-android-security-at-harman-india-4139127106?position=37&pageNum=0&refId=G3HbENa0gxGlOS3m%2Fk2M7w%3D%3D&trackingId=3biPdYRWaX6vR5Mpdz6xBA%3D%3D",
    "description": "**Company Description**\n\nHARMAN is a global leader in designing and engineering connected products and solutions for automakers, consumers, and enterprises worldwide. With leading brands in audio and visual products, HARMAN is admired by audiophiles and musicians around the world. More than 50 million automobiles on the road today are equipped with HARMAN audio and connected car systems. The company has a workforce of approximately 30,000 people across the Americas, Europe, and Asia, and has been at the core of innovations in India since 2009.\n\n  \n\n**Role Description**\n\nThis is a full-time hybrid role for a Principal Engineer - Android Security located in Bengaluru. The role involves design, development & debugging of Security components & features efficiently in quick time ensuring stability, quality & KPI.\n\n  \n\n**About Role :**\n\n-   Technical interface to Customer, Product Owner & Security Architect.\n-   Leads the design, development & debugging of Security components & features efficiently in quick time ensuring stability, quality & KPI.\n-   Bring new ideas (Debugging tools, Methodologies) to increase development efficient and speed up development work within team & across domains.\n-   Participates in hiring for security domain.\n-   Drives and handles RFQ topics, Architecture knowledge sharing sessions.\n-   Ensure effective code reviews within team.\n-   Up skills junior team members to own or drive components independently.\n-   Shows high commitment & ownership in customer delivery as per timeline.\n-   Interacts with Security Architect to understand the architecture & guides team in design & technical clarifications.\n-   Ensure Agile Scrum Methodology is used.\n-   Ensure ASPICE process is followed in team for all features deliverables to customer.\n\n**Required Skills:**\n\n-   Software development experience with Android based embedded system (5 years+). Android porting on hardware, Android version upgrade handing, Expertise in overall Android Architecture including Drivers, HAL layer, framework and applications. Understanding of Android Security Architecture, Android Verified boot, SELinux, Sandboxing, permission model etc.\n-   Must have software architecture skills, Operating system and programming fundamentals. Software requirement analysis, Software design, Code review.\n-   \"Must have working experience with HSM or ARM Trustzone based trusted OS\"\n-   Experience with Embedded/Automotive security concepts, like secure boot, RPMB, One Time programmable memory, Software signing.\n-   Experience with cryptography, authentication algorithms and protocols' PKI, RSA, ECDSA, AES, PKCS standards, TLS, OpenSSL.\n-   Experience with any other Linux based embedded system like embedded Linux, QNX.",
    "created_at": "2025-01-31 10:57:16.055604+00"
  },
  {
    "companyName": "ACL Digital",
    "externalUrl": "https://in.linkedin.com/jobs/view/senior-android-developer-at-acl-digital-4138583993?position=29&pageNum=0&refId=G3HbENa0gxGlOS3m%2Fk2M7w%3D%3D&trackingId=hMBAIfygIFX9nFaziCvKuw%3D%3D",
    "description": "**About the Company**\n\n#ACLDIGITAL is looking for skilled Android Developer proficient in Core Java for a key role. The position involves extensive coding in Core Java to build a Test Framework, primarily for testing Android applications. Strong understanding of Android fundamentals is crucial for this role.\n\n  \n\n**About the Role**\n\nYears of Exp :4-8yrs Location: Bangalore (Work from Office) Immediate Joining Required\n\n  \n\n**Responsibilities**\n\n-   To apply, email your resume to rakesh.ravi@acldigital.com with the following details:\n\n  \n\n**Qualifications**\n\nEducation details.",
    "created_at": "2025-01-31 10:57:16.055604+00"
  },
  {
    "companyName": "APTIV",
    "externalUrl": "https://builtin.com/job/expert-software-engineer/3959453",
    "description": "As an Expert Software Engineer, you will lead the architectural design for Automotive Infotainment Android products, analyze customer requirements, create software architecture documents, participate in design reviews, and resolve systemic issues. You'll also engage with customers and suppliers to define functionalities and ensure alignment with product roadmaps.\n\nSummary Generated by Built In\n\nHelp shape the future of mobility.\n\nImagine a world with zero vehicle accidents, zero vehicle emissions, and wireless vehicle connectivity all around us. Every day, we move closer to making that world a reality. Aptiv’s passionate team of engineers and developers creates advanced safety systems, high-performance electrification solutions and data connectivity solutions so that automakers can bring advanced capabilities to more people around the globe. This is how we enable sustainable mobility and help to prevent accidents caused by human error.\n\n**YOUR ROLE**\n\n**Job Responsibilities:** \n\n-   Should be a Software Architect responsible for Automotive Infotainment Android Product. \n    \n\n-   Should independently own the overall Android SW Architecture & Design \n    \n\n-   Analyzing Customer Requirements, Internal and Standard Requirements to create Software Architecture Design \n    \n\n-   Ensure the creation of software design document from architectural design by partnering with stakeholders like system engineer, SW team, SWPL, IT&V, electrical engineer. \n    \n\n-   Participate in software architectural and software design reviews \n    \n\n-   Participate in competency design, customer design reviews and deep dive discussions for any challenges faced in design/issues \n    \n\n-   Develop reuse strategy for the product/project \n    \n\n-   Participate in Product Strategy and Architecture Planning and support of Product Roadmap Development \n    \n\n-   Help start center for new business pursuits and customer engagement. \n    \n\n-   Work with systems/customer towards defining functionality/requirements where gaps are identified. \n    \n\n-   Single point of contact (technical) for internal team and Customer/external interfaces \n    \n\n-   Working with potential suppliers for new and upcoming technologies for Infotainment products. \n    \n\n-   Should understand and involve in various KPIs including certification activities/process. \n    \n\n-   Analysis and resolution of customer and internal reported systemic issues \n    \n\n-   Be abreast with current technology trend in Infotainment Products and handle stakeholders & customer requests. \n    \n\n-   Monitor Android Automotive trends, roadmaps and incorporate in product SW roadmap \n    \n\n**YOUR BACKGROUND**\n\n**Key Experience/Skill Requisites:** \n\n-   Vehicle level knowledge of Infotainment products and ECUs that communicate with Infotainment Head Unit \n    \n\n-   Experience in Infotainment technologies like Tuner, Media, Bluetooth, Apple CarPlay, Android Auto, WiFi, Networking. \n    \n\n-   At least 6+ years of Android development experience (Application, Services, HAL, BSP in Android) \n    \n\n-   3\\+ years of experience as Android SW Architect role \n    \n\n-   3+ years of experience in Automotive Infotainment domain \n    \n\n-   3\\+ years of experience on Android Automotive OS \n    \n\n-   Expertise in minimum Android 11/12 version. \n    \n\n-   Latest Technology and trends in Android Automotive products \n    \n\n-   Deep architecture and development level knowledge on Infotainment Android Solutions. \n    \n\n-   Expertise in Android Framework & Android Automotive Framework. \n    \n\n-   Expertise on setting up Android AOSP build system for new product \n    \n\n-   Expertise in Android Studio IDE Design, Development and Debugging. \n    \n\n-   Excellent Java, C, C++ programming skills.  \n    \n\n-   Excellent knowledge on Android App Development concepts and APIs \n    \n\n-   Expertise in HIDL and HAL services design. \n    \n\n-   Expertise in Android Security policies \n    \n\n-   Expertise in Android Product/Device/Board Configuration \n    \n\n-   Expertise in Android Secure Boot, Android startup and initialization sequences \n    \n\n-   Good knowledge on Android BSP \n    \n\n-   Good knowledge of performance optimizations in Android \n    \n\n-   Working Experience in Agile development, ASPICE process adherence on Architecture and traceability. \n    \n\n-   Strong debugging/trouble-shooting skills  \n    \n\n-   Expertise in Google Test Framework and testing frameworks used in Android like Junit, Mockito, Tradefed. \n    \n\n-   Knowledge and experience in CTS, VTS requirements and compatibility issue analysis \n    \n\n-   Tools – GIT, Geritt, JIRA, Polarion, Confluence, Android Studio, Enterprise Architect (UML), VMWare, Coverity.  \n    \n\n-   Good analytical, problem solving skills. \n    \n\n-   Good interpersonal and communication skills \n    \n\n-   Highly self-motivated and energetic. \n    \n\n**Qualification**: B.E. / B.Tech / M.E. / M.Tech in Electronics, Communication/Computer Science /Instrumentation/ \n\n**Experience:** \n\n10\\+ years and above of relevant experience \n\n**Why join us?**\n\n·       You can grow at Aptiv.Aptiv provides an inclusive work environment where all individuals can grow and develop, regardless of gender, ethnicity or beliefs.\n\n·       You can have an impact. Safety is a core Aptiv value; we want a safer world for us and our children, one with: Zero fatalities, Zero injuries, Zero accidents.\n\n·       You have support. We ensure you have the resources and support you need to take care of your family and your physical and mental health with a competitive health insurance package.\n\n**Your Benefits at Aptiv:**\n\n·       Hybrid and flexible working hours;\n\n·       Higher Education Opportunities (UDACITY, UDEMY, COURSERA are available for your continuous growth and development);\n\n·       Life  and accident insurance;\n\n·       Sodexo cards for food and beverages\n\n·       Well Being Program that includes regular workshops and networking events;\n\n·       EAP Employee Assistance;\n\n·       Access to fitness clubs (T&C apply);\n\n·       Creche facility for working parents;\n\nApply today, and together let’s change tomorrow!\n\n#LI-SV2\n\nPrivacy Notice - Active Candidates: https://www.aptiv.com/privacy-notice-active-candidates\n\nAptiv is an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, gender identity, sexual orientation, disability status, protected veteran status or any other characteristic protected by law.\n\nRead Full Description",
    "created_at": "2025-01-31 10:58:03.246955+00"
  },
  {
    "companyName": "Illumina",
    "externalUrl": "https://builtin.com/job/desktop-support-analyst/3963003",
    "description": "The Desktop Support Analyst is responsible for managing service queues, providing exceptional support to VIPs and general users, collaborating with global teams, and contributing to process enhancements within the End User Services function.\n\nSummary Generated by Built In\n\nWhat if the work you did every day could impact the lives of people you know? Or all of humanity?\n\nAt Illumina, we are expanding access to genomic technology to realize health equity for billions of people around the world. Our efforts enable life-changing discoveries that are transforming human health through the early detection and diagnosis of diseases and new treatment options for patients.\n\nWorking at Illumina means being part of something bigger than yourself. Every person, in every role, has the opportunity to make a difference. Surrounded by extraordinary people, inspiring leaders, and world changing projects, you will do more and become more than you ever thought possible.\n\n**Position Summary:**\n\nThe End User Services (EUS) **Desktop Support Analyst** will be a key member of the GIS End User Services function, based out of our **India Office** reporting to the regional Manager.   \n\n**Responsibilities:**\n\n-   A key member of the global End User Services team, shared responsibility of effectively managing the Service Management queues in accordance with priority and commitment.\n-   Together with the global End User Services team, collective responsibility to ensure the efficient staffing of support service.\n-   Professional, well-presented and motivated individual providing support to Illumina's VIP's and general userbase through various communication channels.  \n-   Deliver exceptional results by effectively handling one's personal workload and collaborating effectively with the global End User Services Team.  \n-   Adhere to global GIS policies and procedures supporting the business through best practices and great customer service.\n-   Collaborate with colleagues at local and global levels to facilitate procurement and stock management procedures.\n-   Engage in cross-functional collaboration working with the wider GIS organization to support the business, projects and organizational changes.\n-   Contribute and support communication with other resolver groups in GIS to ensure appropriate action is taken to resolve issues in a timely manner.\n-   The ability to recognize opportunities for enhancing processes and supporting the documentation of GIS Knowledge Base to maintain consistent support practices globally.\n-   Maintain an open mindset when it comes to sharing knowledge and offering guidance to both new and existing junior members of the End User Services team.  \n-   Occasional requirement for after-hours support as needed (Shared burden and low volume expected))\n\nListed responsibilities are an essential, but not exhaustive list, of the usual duties associated with the position. Changes to individual responsibilities may occur due to business needs.\n\n**Preferred Requirements:**\n\n-   Experience in supporting technologies like Outlook/Email, Intune, Teams, Network & VPN, MFA, UAM, Software & Hardware Asset Management.\n-   Experience working in an ITIL environment\n-   Knowledge of Windows, Mac, iOS and Android operating systems\n-   Excellent customer service approach\n-   Clear and adaptive communication style\n-   Initiative & self-management\n-   Process development & maturation\n-   The ability to multi-task, effectively determine priorities and meet SLA's\n-   Enthusiasm to learn new skills and embrace change\n-   Ability to work in a fast-paced environment\n-   Experience supporting Company Executives directly\n-   Creation of support documentation, guides, and manuals. \n\nAll listed requirements are deemed as essential functions to this position; however, business conditions may require reasonable accommodation for additional tasks and responsibilities.\n\n**Preferred Experience/Education:**\n\n-   Bachelor’s degree from an accredited college or university or equivalent work experience.\n-   Experience working within an IT organization.\n\n  \n\nIllumina believes that everyone has the ability to make an impact, and we are proud to be an equal opportunity employer committed to providing employment opportunity regardless of sex, race, creed, color, gender, religion, marital status, domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition, sexual orientation, pregnancy, military or veteran status, citizenship status, and genetic information.\n\nRead Full Description",
    "created_at": "2025-01-31 10:58:03.246955+00"
  },
  {
    "companyName": "CS Soft Solutions (India) Pvt Ltd",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-cs-soft-solutions-india-pvt-ltd-4138573178?position=21&pageNum=0&refId=G3HbENa0gxGlOS3m%2Fk2M7w%3D%3D&trackingId=3lcd6%2Fe%2BZSfYDaHsHT%2FtoQ%3D%3D",
    "description": "Role And Responsibilities  \n  \n\n-   Good experience in Core java, Kotlin programming\n-   Good understanding of Android UI, SQLITE, MVVM, Room database.\n-   Knowledge of Window, Linux. Basic commands to work from a Linux terminal.\n-   Basic Knowledge of web technologies like HTTP protocol, authentication techniques.\n-   Proficient understanding of code versioning tools, such as Github, Gitlab.\n-   Good to have knowledge about socket programming.\n-   Excellent analytical and debugging skills.Should be able to work across multiple platforms and domains.\n-   Should have the ability to work independently and be a self-starter, always under the direction and support provided by the manager.\n-   Excellent communication and presentation skills\n-   Commitment to excellence, accepting responsibility, and accountability for results.\n-   Flexible to attempt alternate solutions to resolve issues and able to adjust to a dynamic, changing technical and business environment.",
    "created_at": "2025-01-31 10:57:16.055604+00"
  },
  {
    "companyName": "Cyanous Software Private Limited",
    "externalUrl": "https://in.linkedin.com/jobs/view/cyanous-android-developer-kotlin-programming-at-cyanous-software-private-limited-4139518721?position=15&pageNum=0&refId=G3HbENa0gxGlOS3m%2Fk2M7w%3D%3D&trackingId=eldyl8jEm50TSrx9qG%2BFjg%3D%3D",
    "description": "**Job Description**  \n  \n\n-   Strong experience developing highly scalable, native Android applications in production.\n-   Have 8+ years of experience.\n-   Strong experience building and maintaining Android frameworks and maintaining Android libraries via Gradle/Maven/Bintray\n-   Strong to moderate experience with functional/reactive programming patterns to build applications from the ground up is a plus.\n-   Strong experience collaborating with designers and UX experts to create great user experiences.\n-   Strong hands-on coding experience in Kotlin, Jetpack Components, Clean Architecture, Memory Management, Clean code, Best practices\n-   Write comprehensive unit and UI tests using JUnit, Espresso, and Mockito to ensure code quality and reliability.\n-   Conduct code reviews and provide constructive feedback to maintain high code standards and foster a collaborative development environment.\n-   Optimise application performance, focusing on responsiveness and resource management.\n-   Experience integrating with and/or building standard RESTful web services.\n-   Experience with GraphQL is also a plus.\n-   You have released or worked as part of a team to release apps in the Google Play Store\n-   You are confident in expressing your point of view from a position of knowledge and experience. You are also receptive to feedback and open to revising your plans when appropriate.\n-   Experience in managing & mentoring the mobile team.\n\n**Additional Skills**  \n  \n\n-   The Android Mobile App Developer will create, implement, and support native mobile applications, SDKs, and design systems/component libraries in the vehicle mobility space, and apply their mobile development knowledge in a highly energized, fast-paced, and innovative environment.\n-   Be a go-to resource for modern, native Android development in Kotlin.\n-   Build, implement, and support mobile applications, SDKs, and design systems/component libraries. Demonstrate a willingness to build and use frameworks, component libraries, design systems, and other reusable pieces - both first and third party.\n-   Be an effective developer who recognizes and utilizes the right tool for the job.\n-   Demonstrate a strong proficiency in Android but a willingness to branch out and learn both Android & IOS as needed.\n-   Creatively solve technical issues. Deliver solutions in a complex environment while collaborating with cross platform team members.\n\n**Must Have Skill Sets**  \n  \n\n-   Kotlin.\n-   Compose UI.\n-   Coroutines\n-   Flow\n-   MVVM.\n-   Navigation.\n-   Clean Arch\n-   Git.\n-   Firebase.\n-   Hilt or Dagger.\n-   Unit & UI Test.\n\n(ref:hirist.tech)",
    "created_at": "2025-01-31 10:57:16.055604+00"
  },
  {
    "companyName": "Uber",
    "externalUrl": "https://in.linkedin.com/jobs/view/sr-software-engineer-android-at-uber-4139287937?position=12&pageNum=0&refId=G3HbENa0gxGlOS3m%2Fk2M7w%3D%3D&trackingId=niGOKUnKMuebnsUHm8Na6A%3D%3D",
    "description": "The Shared Rides team at Uber is focused on delivering an affordable rideshare service by sharing the cost of the driver among multiple riders. This team works on various aspects of shared rides, such as improving rider and driver experiences, optimizing matching algorithms for efficient sharing, and devising pricing strategies to enhance cost savings and rider engagement. They tackle complex problems in real-time, like efficiently matching drivers with ride requests and arranging trips with similar routes.  \n  \nFor mobile engineers, the role is instrumental in designing and building scalable software solutions that enable seamless experiences in the Rider App. Mobile engineers collaborate across the product and platform features of the flagship Uber app. They are involved in developing complex user interfaces and enhancing mobile application features, ensuring that the shared ride services are efficient and provide a defect-free experience for both riders and drivers. They require expertise in Android development, partnering with various engineering, product, and operations teams to deliver innovative services. Passion for problem-solving, a commitment to high engineering standards, and collaboration are essential qualities for engineers on this team.",
    "created_at": "2025-01-31 10:57:16.055604+00"
  },
  {
    "companyName": "Live Connections",
    "externalUrl": "https://in.linkedin.com/jobs/view/mobile-application-developer-at-live-connections-4139853916?position=9&pageNum=5&refId=Qci2wm1L3MiBnWUbiFcPPQ%3D%3D&trackingId=AQnZ5zJ6Bz625IVN7dKFRQ%3D%3D",
    "description": "**_Looking for UI UX Developer Flutter developer_**\n\n  \n\n**_Location: Chennai_**\n\n  \n\n**_Experience: 5-8 Years (5+ years of experience in the UI development)_**\n\n  \n\n  \n\n**_Responsibilities_**\n\n  \n\n-   **Mobile App Development**: Design, develop, test, and maintain mobile applications for Android and iOS platforms.\n-   Solid understanding of UX and UI design with an emphasis on maximizing usability\n-   Expertise in developing intuitive UI for enterprise B2B applications on Hybris Platform\n-   Top-notch programming skills and in-depth knowledge of modern HTML 5, CSS and Java Script\n-   Must have experience on end to end development of web components using AJAX, JQuery, Advanced **_JQuery,_** Responsive Page development,\n-   Good knowledge of **Object Oriented Programming,** database management system and good understanding of how back-end development works\n-   **Technical**: Guide the team in best practices for mobile development, provide technical solutions, and oversee the implementation of mobile applications.\n-   **Platform-Specific Services**: Develop platform-specific services such as calls, calendar integration, and Google Maps integration.\n-   **API Integration**: Integrate APIs into mobile applications to enhance functionality and user experience.\n-   **Deployment**: Deploy mobile applications on both iOS and Android platforms, ensuring smooth and successful releases.\n-   **Cloud-Based API Development**: Contribute to the development of **_AWS Cloud-based APIs_** to support mobile applications, leveraging cloud services for scalability and reliability.\n\n  \n\n-   **Technical Skills**:\n-   Proficiency in Android and iOS development.\n-   Experience with Flutter 3-4 years for both ios and android\n-   Strong understanding of mobile app design principles, patterns, and best practices.\n-   Experience with API design and integration.\n-   Familiarity with AWS Cloud services and API development is a plus.\n-   **Soft Skills**:\n-   Excellent problem-solving skills and attention to detail.\n-   Strong communication and team leadership skills.\n-   Ability to work in an Agile environment and adapt to changing requirements.",
    "created_at": "2025-01-31 13:30:13.615703+00"
  },
  {
    "companyName": "Soctronics",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-platform-developer-at-soctronics-4138566861?position=10&pageNum=0&refId=G3HbENa0gxGlOS3m%2Fk2M7w%3D%3D&trackingId=fRiu13HmiaYBZZ5V4hVptQ%3D%3D",
    "description": "Hyderabad  \n  \n**Skills Required**  \n  \n\n-   Android OS bring-up/upgrade experience on any platform\n-   Kernel upgrade in Android\n-   Experience in enabling Android features like OTA, virtual A/B update, AVB and etc.\n-   Enabling any peripherals on platform with Android\n-   Experience in resolving Android CTS/VTS test issues.\n-   Experience/Knowledge on Power management, and power measurements\n-   Experience/Knowledge on Bootloaders and Boot time optimizations\n-   Understanding of Trustzone, secure boot, crypto accelerators etc.\n\nInterested ? Apply now!  \n  \nUSE LINKEDIN PROFILE  \n  \nEnter your full name\\*  \n  \nEnter Email\\*  \n  \nEnter LinkedIn profile link\\*  \n  \nAttach Your Resume (Max size 4MB)\\*  \n  \nSUBMIT  \n  \nor  \n  \nAPPLY HERE",
    "created_at": "2025-01-31 10:57:16.055604+00"
  },
  {
    "companyName": "Google",
    "externalUrl": "https://in.linkedin.com/jobs/view/software-engineering-manager-ii-google-assistant-at-google-4138392078?position=27&pageNum=0&refId=G3HbENa0gxGlOS3m%2Fk2M7w%3D%3D&trackingId=ruEeBGR7bmO9QwlY39bYQQ%3D%3D",
    "description": "**Minimum qualifications:**  \n  \n\n-   Bachelor’s degree, or equivalent practical experience.\n-   5 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).\n-   3 years of experience in a technical leadership role; overseeing strategic projects, with 2 years of experience in a people management, supervision/team leadership role.\n\n**Preferred qualifications:**  \n  \n\n-   Master's degree or PhD in Computer Science or related technical field.\n-   3 years of experience working in a complex, matrixed organization.\n\n**About The Job**  \n  \nLike Google's own ambitions, the work of a Software Engineer (SWE) goes way beyond just Search. SWE Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of engineers. You not only optimize your own code but make sure engineers are able to optimize theirs. As a SWE Manager you manage your project goals, contribute to product strategy and help develop your team. SWE teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way.  \n  \nGoogle is an engineering company at heart. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on users around the world. At Google, engineers not only revolutionize search, they routinely work on scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, social to local, Google engineers are changing the world one technological achievement after another.  \n  \n**Responsibilities**  \n  \n\n-   Set and communicate team priorities that support the broader organization's goals. Align strategy, processes, and decision-making across teams.\n-   Set clear expectations with individuals based on their level and role and aligned to the broader organization's goals. Meet regularly with individuals to discuss performance and development and provide feedback and coaching.\n-   Develop the mid-term technical vision and roadmap within the scope of your (often multiple) team(s). Evolve the roadmap to meet anticipated future requirements and infrastructure needs.\n-   Design, guide and vet systems designs within the scope of the broader area, and write product or system development code to solve ambiguous problems.\n-   Review code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
    "created_at": "2025-01-31 10:57:16.055604+00"
  },
  {
    "companyName": "Infotree Global Solutions",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-infotree-global-solutions-4138893953?position=25&pageNum=0&refId=G3HbENa0gxGlOS3m%2Fk2M7w%3D%3D&trackingId=5k0072i7Fc8V438aDLaY2w%3D%3D",
    "description": "**Job Title - Senior Android Engineer**\n\n**#5yrs+ in Kotlin and In SDK and in Android development**\n\nWe are looking for an experienced software engineer across : **Android (Java & Kotlin)**\n\n**Job Description:**\n\nYou GET developers! You know what they need, how to talk to them, how to make their lives easier, what makes them click, their dissatisfiers and their delighters. You recognize when a framework, library or product provides a great experience. As an Android engineer, you will use those superpowers to build and maintain SDKs and libraries, improve our entire onboarding process, SDKs, Quickstarts, Docs, and provide direct assistance to developers in our support channels. You will be the internal and external steward of the experience for the technologies that you love working with every day.\n\nEach engineer shepherds one or multiple platforms forward, both internally within Auth0, and externally in the community. You will be working in a cross-functional team alongside the developer evangelist, onboarding, growth, dashboard, community, tooling, and SDK teams to provide the best developer experience for the technologies you own. The most important qualifications for this position are software engineering expertise, empathy, and self-direction.\n\n**You will be:**\n\nWriting, curating, editing developer resources: tutorials, examples, guides, and documentation.\n\nDirectly shaping and developing our open source SDKs.\n\nOwning the code samples and implementation guidance for Auth0.\n\nChampioning Auth0 by engaging directly with the community.\n\nGathering and channel user feedback within the company to improve the experience for developers on Auth0.\n\nThe go-to-expert in the company, internally and externally, providing domain knowledge and reviews for Auth0 in these technologies.\n\nSharing your technical expertise at conferences and other tech events.\n\nDeveloping our libraries that allow users to integrate seamlessly with Auth0.\n\nWorking on our Quickstart guides to delight our developers.\n\nTroubleshooting and fixing issues with our libraries.\n\n**You'd be a great fit if you:**\n\n5 + years of expertise in Android development\n\nHave developed Android libraries or SDKs to be consumed by other developers\n\nHave a good understanding of the Android frameworks & ecosystem and have created mobile applications that have seen the light of day\n\nHave hybrid library development experience (React Native, Flutter)\n\nUnderstanding of CI platforms such as GitHub Actions or CircleCI.\n\nUnderstanding of testing mobile applications in a CI environment\n\nYou are able to work in a team environment, have good communication skills and understand the value of collaboration\n\nA deep understanding of writing, running, maintaining and debugging applications.\n\nExcellent written and verbal communication skills: presenting, documenting, troubleshooting.\n\nDemonstrable experience authoring developer documentation (tutorials, blog posts, docs).\n\nThe ability to be self-directed and be effective working independently, yet feel equally comfortable contributing in a global team environment.\n\n**Bonus points if you have:**\n\nExperience with iOS (Swift & Objective-C))\n\nExperience working in distributed teams and work environments.\n\nCreated open-source material or have contributed to open-source projects.\n\nYour own technical blog or published articles on popular Android sites.\n\nKnowledge in the identity and access management space.",
    "created_at": "2025-01-31 10:57:16.055604+00"
  },
  {
    "companyName": "Google",
    "externalUrl": "https://in.linkedin.com/jobs/view/senior-software-engineer-engineering-productivity-silicon-at-google-4102646851?position=24&pageNum=0&refId=G3HbENa0gxGlOS3m%2Fk2M7w%3D%3D&trackingId=4Wf6mwYM5xHaVfA903hCIA%3D%3D",
    "description": "**Minimum qualifications:**  \n  \n\n-   Bachelor's degree or equivalent practical experience.\n-   5 years of experience with software development in C/C++, Python, SQL languages, and with data structures/algorithms.\n-   3 years of experience testing, maintaining, or launching software products, and 1 year of experience with software design and architecture.\n-   3 years of experience with performance, systems data analysis, visualization tools, or debugging.\n\n**Preferred qualifications:**  \n  \n\n-   Experience in front end technologies like TypeScript, Angular etc.\n-   Experience and knowledge of Android, Android OS, or embedded systems.\n-   Knowledge of product life-cycle, tools, processes, and operations planning.\n\n**About The Job**  \n  \nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.  \n  \nGoogle Silicon works with many teams at Google, including Research, Machine Learning, Android, Chrome, and Hardware. Google Silicon's Software Engineering Productivity team identifies areas for impact and implements tools that make the growing Silicon Software team more effective.  \n  \nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.  \n  \n**Responsibilities**  \n  \n\n-   Design creative solutions to problems, and write organized and maintainable code with minimal assistance.\n-   Develop innovative solutions for Engineering productivity software components with focus on scale, high availability, quality, and usage of Google infrastructure.\n-   Develop systems to simplify the setup and maintenance of CI, code coverage, and more.\n-   Improve development efficiency across the silicon organization and possibly Google-wide through tooling improvements.\n-   Coordinate with multidisciplinary teams throughout the development process and influence the technical decisions.\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
    "created_at": "2025-01-31 10:57:16.055604+00"
  },
  {
    "companyName": "Concentrix",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-lead-developer-at-concentrix-4139562795?position=22&pageNum=0&refId=G3HbENa0gxGlOS3m%2Fk2M7w%3D%3D&trackingId=lDMNL78P94xHbb%2FpBUbVBg%3D%3D",
    "description": "Job Title:  \n  \nAndroid Lead Developer  \n  \n**Job Description**  \n  \nWe’re Concentrix. A new breed of tech company — Human-centered. Tech-powered. Intelligence-fueled.  \n  \nWe create game-changing solutions across the enterprise, that help brands grow across the world and into the future. We are trusted by clients across all major sectors, from up-and-coming success stories to iconic Fortune Global 500 brands in over 70 countries spanning 6 continents.  \n  \nOur game-changers:  \n  \n\n-   Challenge Conventions\n-   Deliver outcomes unimagined\n-   Create experiences that go beyond WOW\n\nIf this is you, we would love to discuss career opportunities with you.  \n  \nIn our Concentrix Catalyst team, you will work with the engine that powers the experience design and engineering capabilities at Concentrix. A leading global solutions company that reimagines everything CX through strategy, talent, and technology. We combine human-centered design, powerful data, and strong tech to accelerate CX transformation at scale. You will be surrounded by the best in the world providing market leading technology and insights to modernize and simplify the customer experience. Within our professional services team, you will deliver strategic consulting, design, advisory services, market research, and contact center analytics that deliver insights to improve outcomes and value for our clients. Hence achieving our vision.  \n  \nConcentrix provides eligible employees with an opportunity to enroll in many benefit programs, generally including private medical plans, great compensation package, retirement savings plans, paid learning days, and flexible workplaces. Specific benefits plans will vary by country/region.  \n  \nWe’re a remote-first company looking for the absolute best talent in the world. Experience the power of a game-changing career.  \n  \nAndroid lead developer is responsible for the development and maintenance of applications aimed at a vast number of diverse Android devices.  \n  \nPrimary focus will be the development of Android applications and their integration with back-end services. Collaboration with along-side other engineers and developers working on different layers of the infrastructure.  \n  \n**Responsibilities**  \n  \n\n-   Ability to work with client on the requirements and estimate them.\n-   Leadership qualities of leading the feature/team.\n-   Translate designs and wireframes into high quality code.\n-   Design, build, and maintain high performance, reusable, and reliable Java code\n-   Ensure the best possible performance, quality, and responsiveness of the application\n-   Identify and correct bottlenecks and fix bugs\n-   Maintain code quality, Code reusability and using lint or monitoring tools to find the bugs.\n-   Troubleshoots bugs and documents errors.\n\n**Skills**  \n  \n\n-   Strong expertise in Kotlin and Java, along with experience in Android SDK, Android Studio, and libraries such as Retrofit, Dagger, or Jetpack components and and how to deal with different screen sizes\n-   Experience with architectural patterns such as MVVM, MVP, MVC and design patterns\n-   Familiarity with RESTful APIs to connect Android applications to back-end services\n-   Strong knowledge of Android UI design principles, patterns, and best practices\n-   Experience with canvas drawing, threading, and performance tuning\n-   Knowledge of the open-source Android ecosystem and the libraries available for common tasks\n-   Ability to understand business requirements and translate them into technical requirements\n-   A knack for benchmarking and optimization\n-   Understanding of Google’s Android design principles and interface guidelines\n-   Proficient understanding of code versioning tools, such as Azure, Git\n-   Familiarity with continuous integration\n-   Strong analytical, organizational, and problem-solving skills\n\nLocation:  \n  \nIND Hyderabad Raidurg Village B7 South Tower, Serilingampally Mandal Divya Sree Orion  \n  \nLanguage Requirements:  \n  \nTime Type:  \n  \nFull time  \n  \n**If you are a California resident, by submitting your information, you acknowledge that you have read and have access to the Job Applicant Privacy Notice for California Residents**  \n  \n**R1543587**",
    "created_at": "2025-01-31 10:57:16.055604+00"
  },
  {
    "companyName": "Bajaj Auto CSR",
    "externalUrl": "https://in.linkedin.com/jobs/view/mobile-and-web-app-developer-at-bajaj-auto-csr-4139221331?position=38&pageNum=0&refId=G3HbENa0gxGlOS3m%2Fk2M7w%3D%3D&trackingId=8uQU7sEicNVq0zznoUK59Q%3D%3D",
    "description": "**Division**  \n  \n**R&D**  \n  \n**Department**  \n  \n**Level**  \n  \n**L3 UB**  \n  \n**Functional Area**  \n  \n**Role**  \n  \n**Mobile and Web App developer**  \n  \n**1**  \n  \n**Job Title**  \n  \n**Manager**  \n  \n**2**  \n  \n**Reporting**  \n  \n_Functional reporting to_ : L2  \n  \n**3**  \n  \n**Background**  \n  \n**i) Educational Qualification**  \n  \n**Essential**  \n  \n\n-   B.E / B. Tech Mechanical Engg /Electrical Engg from reputed University / Institute\n-   Minimum 60 % marks\n-   Should have been consistent & secured good percentage throughout academics (SSC, HSC, Graduation etc)\n\n**Ii) Experience**  \n  \n_Minimum:_ 3 Year(s)  \n  \n_Maximum:_ 7 Year(s)  \n  \n**Technical Skills**  \n  \n\n-   React Native: Proficiency in developing cross-platform mobile apps using React Native.\n-   JavaScript​: Strong understanding of JavaScript syntax, concepts, and best practices\n-   .iOS and Android development: Familiarity with iOS and Android development environments and tools\n-   .RESTful APIs: Knowledge of working with RESTful APIs and data integration\n-   .Mobile app design: Understanding of mobile app design principles and user experience\n-   .Performance Optimization: Techniques for optimizing app performance, including memory management, efficient rendering, and network requests\n-   .Offline Functionality: Implementing features that allow apps to function without a network connection, such as caching and local data storage\n-   .Push Notifications: Integrating push notification services for real-time updates and user engagement\n\n**.Version Contro**  \n  \n\n-   lGit: Proficiency in using Git for version control, branching, merging, and collaborating with other developers\n\n**.Testing And Quality Assuranc**  \n  \n\n-   eUnit Testing: Writing unit tests to ensure code quality and maintainability\n-   .Integration Testing: Testing the interaction between different components of the app\n-   .End-to-End Testing: Simulating user interactions to verify the overall functionality of the app\n-   .Debugging Tools: Proficiency in using debugging tools to identify and resolve issues in the code\n\n**.Additional Technologie**  \n  \n\n-   sNative Modules: Creating custom native modules for tasks that require platform-specific capabilities\n-   .Libraries and Frameworks: Familiarity with popular React Native libraries and frameworks like Expo, React Navigation, and Redux Toolkit\n-   .Cloud Services: Integrating cloud services like Firebase, AWS Amplify, or Google Cloud Platform for backend functionality, authentication, and storage\n-   .Accessibility: Ensuring that the app is accessible to users with disabilities by following accessibility guidelines\n\n.",
    "created_at": "2025-01-31 10:57:16.055604+00"
  },
  {
    "companyName": "HumanIT Digital Consulting",
    "externalUrl": "https://pt.linkedin.com/jobs/view/android-developer-at-humanit-digital-consulting-4139624378?position=15&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=%2FgXVIiWhbif4fW7AHI8tUQ%3D%3D",
    "description": "**Mobile Developer (Android) - Remote PT**\n\n  \n\nAs an Android Developer, you will create exceptional native experiences with the latest e-commerce tech stack, ensuring a world-class product quality. Our approach to software development is like haute cuisine: every detail is meticulously crafted to deliver a smooth and impactful experience.\n\n  \n\nYou will work with a talented team of Android, iOS, and Quality Assurance engineers who thrive in dynamic and collaborative environments. Additionally, you will contribute to building an app with over 10M+ downloads, featured at the Google I/O 2019 Developer Keynote and multiple case studies. The codebase integrates Arch Components (ViewModel, LiveData, Room, etc.), following a Kotlin-first approach with RxJava & Coroutines and utilizing Agile methodologies such as Scrum and Kanban.\n\n  \n\n**Requirements:**\n\n**Expertise in:**\n\n-   Kotlin (Kotlin Multiplatform is a plus);\n-   Jetpack Compose (Compose Multiplatform is a plus);\n-   Coroutines (or RxJava);\n-   Software Architecture (MVVM or similar);\n-   Unit testing and UI tests;\n-   Developing fluid and interactive user experiences;\n-   Working independently with a strong sense of responsibility.\n\n  \n\n**Preferred Skills:**\n\n-   Experience working in cross-functional, feature-oriented teams;\n-   Direct collaboration with the client to ensure technical feasibility of requirements;\n-   Service-oriented architectures, design patterns, and data structures;\n-   Test-driven development and continuous delivery;\n-   Monitoring performance metrics and maintaining code quality.\n\n  \n\n**Key Responsibilities:**\n\n-   Define technical architecture and design;\n-   Develop and maintain features in collaboration with the client;\n-   Write testable, well-documented code;\n-   Ensure the agreed level of test coverage;\n-   Take ownership of code from development to maintenance;\n-   Mentor junior engineers;\n-   Diagnose and solve production issues;\n-   Work both autonomously and collaboratively to meet goals;\n-   Actively contribute to solution design and implementation.\n\n  \n\n**Location:**\n\n-   Fully remote, based in Portugal.\n\n  \n\nIf this opportunity excites you, get in touch and join our team!",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "ília",
    "externalUrl": "https://br.linkedin.com/jobs/view/pl-sr-desenvolvimento-android-at-%C3%ADlia-4139339876?position=14&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=B5ZEygbba9z7deRdKSxe9w%3D%3D",
    "description": "Aqui na ília nossas vagas estão sempre abertas para todas as pessoas e não se restringem quanto a gênero, etnia, orientação sexual, fatores sociais, condições físicas ou intelectuais (PCD) etc. Incentivamos a candidatura de integrantes de todos os grupos minoritários!  \n  \n**Sobre a ília**  \n  \nSomos especialistas em tecnologia, dados e design, impulsionando a transformação digital de grandes players do mercado há mais de 10 anos, nos setores financeiro, seguros e mobilidade. Com mais de 450 profissionais, estamos presentes no Brasil e Europa, atendendo aos mercados da América Latina, Europa e América do Norte, desenvolvendo produtos digitais de alta qualidade e com foco em resultados de negócios. Somos uma equipe inovadora, criativa e apaixonada por tecnologia.  \n  \nCertificada pelo 5° ano consecutivo como Great Place to work aqui na ília acreditamos que pessoas mudam o mundo, e investimos nelas. Nossas awesome deliveries são feitas de pessoas para pessoas, afinal awesome people make awesome deliveries!  \n  \n#Vempraília!  \n  \n**Requisitos:**  \n  \n\n-   Domínio em Kotlin, incluindo uso avançado de DSLs e boas práticas para código limpo e performático.\n-   Experiência com Jetpack Compose, animações avançadas e Custom Views.\n-   Proficiência em arquiteturas modernas (MVVM, MVI) e padrões de design.\n-   Conhecimento avançado em performance (profiling, memory leaks) e segurança mobile (OWASP Mobile Top 10, autenticação segura).\n-   Integração com APIs REST e familiaridade com GraphQL.\n-   Experiência com bibliotecas avançadas (RxJava, WorkManager, Coroutines/Flow).\n-   Experiência com Gradle (configurações avançadas e otimizações de build).\n-   Automação de processos de CI/CD para deploy de apps, utilizando ferramentas como Jenkins, GitHub Actions, ou Bitrise.\n-   Forte habilidade com Git, incluindo fluxos como Gitflow e Pull Request Reviews.\n-   Familiaridade com publicação de apps na Google Play Store e boas práticas de release.\n-   Expertise em testes automatizados (Unit Tests, UI Tests com Espresso) e práticas de TDD/BDD.\n-   Experiência com ferramentas de análise de código (SonarQube, Codacy).\n-   Colaboração em equipes ágeis (Scrum, Kanban).\n-   Participação em code reviews e condução de sessões de pair programming.\n-   Mindset de melhoria contínua e refatoração de código legado.\n\n**Diferenciais:**  \n  \n\n-   Experiência com aplicativos multimódulos e arquitetura clean.\n-   Familiaridade com Firebase Suite (Crashlytics, Analytics, Push Notifications).\n-   Inglês Avançado ou Intermediário\n\n**Benefícios e Incentivos:**  \n  \nNossa contratação é CLT- 40h semanais com jornada flexível, sendo executada 100% de forma remota. Os benefícios da ília são pensados para proporcionar uma experiência AWESOME para cada ílian, abaixo você encontra os benefícios de forma resumida. #vempraília  \n  \nPara Saúde e bem-estar:  \n  \n\n-   Plano de Saúde e Odontológico SulAmérica extensivo a dependentes;\n-   Vale Alimentação/Refeição em cartão fléxivel Picpay benefícios\n-   Seguro de Vida;\n-   Auxílio Home-Office em cartão fléxivel Picpay benefícios;\n-   Wellhub (Gympass)\n-   TotalPass\n\nPara o seu Desenvolvimento:  \n  \n\n-   ília University: Universidade Corporativa com mais de 20 mil cursos disponíveis para desenvolvimento pessoal e profissional;\n-   Language Academy: Escola de idiomas para ílians;\n-   í-talks e Chapter: Momentos e cerimônias em que o time compartilha práticas, estudos, projetos e ideias. Nas chapters ainda se reúnem pessoas com skills similares para compartilhamento de ideias, práticas e experiências;\n\nGostamos de ir além no cuidado com as nossas pessoas, então dispomos também de alguns benefícios não convencionais:  \n  \n\n-   Plano de Saúde PET- Guapeco\n-   BYOD- Alugamos o seu notebook pessoal te pagando um valor mensal para que você o use, mas disponibilizamos também máquinas de trabalho para ílians. Você quem decide!\n-   Seu Niver, seu bolo!\n-   Seu Networking Vale Prêmio- Programa de premiação a indicação de novos funcionários.",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "EmTalk",
    "externalUrl": "https://ru.linkedin.com/jobs/view/android-developer-at-emtalk-4138503927?position=9&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=TPFGpcLIgcrlorBj6k00bQ%3D%3D",
    "description": "Мы ищем Андроид разработчика в нашу молодую и амбициозную команду!\n\n  \n\nДобрый день, наш идеальный кандидат! Мы стартап EmTalk, и мы ищем такого же увлеченного, как и мы, специалиста в свою команду. Мы занимаемся проблемой ментального здоровья сотрудников и разрабатываем B2C продукт, который, мы уверены, будет полезен многим людям и актуален на рынке. Одной из основных механик выступают сюжетно-ролевые игры, с помощью которых мы хотим показывать людям потенциальные последствия действий на работе и варианты развития событий, таким образом разрешая проблему наших потенциальных клиентов. В данный момент мы находимся на стадии разработки MVP и надеемся на твою помощь! \n\n  \n\nТебя ждет команда из 25 высокомотивированных человек и среди них 3 андроид разработчика, 1 тестировщик, 3 дизайнера. Члены команды горят этим делом и хотят создать востребованный продукт. На текущем этапе мы не можем материально вознаграждать наших сотрудников, но ты можешь получить гораздо большее. Многие из наших коллег находят новые роли благодаря сотрудничеству с нашим стартапом, при этом все равно остаются с нами! Мы выслушиваем любые идеи, комментируем, вместе обсуждаем, учимся, развиваемся, делимся лекциями и открытиями, и каждый из нас определяет, как нам строить нашу компанию. В начале 2025 года мы хотим загрузить MVP нашего приложения в Google Play и верим в успех! \n\n  \n\nЮридически мы находимся в Казахстане, команда русскоговорящая и распределена по миру.\n\n  \n\nОбязанности:\n\nРазработка и рефакторинг кода андроид приложения\n\nП.С, Это стартап и тут чрезвычайно важна кроссфункциональность. Здесь у тебя будет возможность заняться всем, что тебе интересно.\n\n  \n\nКвалификация:\n\nЖелательно уже закончить любые курсы. Умение самостоятельно писать клиент-серверные приложения на архитектуре архитектуре MVVM/MVI. В идеале уже владеть compose. \n\nНаш стэк: compose (чистый), hilt (переходим на Dagger 2), retrofit, room, MVI, coroutines, kaspresso. Разработка и рефакторинг кода андроид приложения",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "Treatwell",
    "externalUrl": "https://nl.linkedin.com/jobs/view/senior-android-engineer-saas-at-treatwell-4090512641?position=12&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=ZWwoGQGeztIigU50NgjTcQ%3D%3D",
    "description": "**Senior Engineer - Android (SaaS)**  \n  \nWe're looking for a talented, friendly and open Senior Android Developer to help build our partner's facing apps.  \n  \nHere in the Treatwell tech team, we believe in Agile principles and values, our teams use Scrum and various XP practices, we love DDD and we are embracing eventual consistency in our new services. We like to use the right tech for the job but we don't get seduced by the latest shiny fads.  \n  \nOur tech stack is designed to support modern, efficient, and scalable Android application development. We leverage Android technologies such as Jetpack Compose, flow, and coroutines whilst supporting legacy code. We believe in a testable environment, with test coverage across the full testing pyramid, including unit tests, integration tests, UITesting, and PACT consumer-driven contract tests. Our code lives in Git and we have automated builds, tests, and deployments.  \n  \nWe do things well, but we're not complacent. We want to do great work and we want to be known for it. We're looking for people who can help us to continue to grow and improve as a team  \n  \n**You Will Be Responsible For**  \n  \n\n-   Playing a key role in creating improved and new ways for our salon Partners to interact with payments capabilities of our SaaS.\n-   Developing and maintaining Android applications.\n-   Be part of an empowered team to operate independently and to ship to production as frequently as you see fit.\n-   Working on a variety of exciting technologies (Android SDKs, Kotlin Coroutines, Jetpack Compose, etc). We have plans to leverage React Native for hybrid development soon. We also maintain libraries or bridges with physical devices (POS and Epson).\n-   Helping us to realise this vision and accelerate the journey, knowing what great technology looks like, and mentoring our existing team.\n-   Create and maintain partner-centric applications whilst improving and updating the native/hybrid mobile app ecosystem.\n-   Understanding and translating project requirements into technical specifications by collaborating with cross-functional teams.\n-   Troubleshooting and fixing bugs and technical problems.\n-   Keeping up-to-date with the latest trends and emerging technologies released by Google.\n\n**About You**  \n  \n\n-   You have solid experience in mobile software development on the Android platform, Kotlin native, and some hybrid experience.\n-   You know good UX and visual design when you see it.\n-   You've been part of a high-performing, autonomous Agile development team and you get a kick out of shipping.\n-   You like learning new skills and taking on tasks beyond your usual remit - maybe even some backend development tasks!\n-   You're a good communicator, fun to work with, and enjoy being part of a vocal, passionate team.\n-   You're active in the software development community, whether through blogs, meetups, personal projects, or open-source contributions.\n-   Ideally, you have an understanding of self-service in a B2B environment and an understanding of memory management, performance, and optimization.\n-   Familiarity with these is a plus:\n-   Payment technologies and Backend (such as Java)\n-   Troubleshooting and fixing bugs and technical problems, especially when mocking third-party libraries.\n-   Experience developing hybrid applications that combine React Native components with native Android development is a plus\n-   You are based in any of the countries that are listed in the job description (Spain, Greece or the Netherlands), with a valid right to work in that location.\n-   You can communicate fluently in English.\n\n**About Treatwell**  \n  \nHi, we're Treatwell. Nice to meet you.  \n  \nWe're a team of 700 passionate and brilliantly talented people across Europe. We're the industry's smartest salon management software, all connected to Europe's leading bookings platform, working with over 50,000 salon partners across 13 countries, processing over 8 million bookings every month. And....breathe.  \n  \nBut we're not done yet. We're on an exciting journey to digitally revolutionise the hair and beauty community.  \n  \nIf this excites you, we might just have the role for you.  \n  \n**We'll Treat You With**  \n  \n\n-   28-days holiday, plus bank holidays\n-   Monthly 40 EUR Treatwell vouchers so you can treat yourself too\n-   Growth funds for you to develop and grow with your team\n-   Mental health support through our partnership with Plumm\n-   100% remote position with flexible working within the locations we are listing for the role (Spain, Greece, or the Netherlands), meaning that you'll be attached to our legal entity in that country, so you must hold a permanent and valid residency permit.\n-   All the tools / devices supplied to do the best job you can eg. laptop, monitor, keyboard etc.\n-   Other market-related benefits for specific locations",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "Intellectsoft",
    "externalUrl": "https://ua.linkedin.com/jobs/view/senior-android-developer-at-intellectsoft-4139613144?position=4&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=fmfp4LzClTDWfdZWLSVGOw%3D%3D",
    "description": "Intellectsoft is a software development company delivering innovative solutions since 2007. We operate across North America, Latin America, the Nordic region, the UK, and Europe.We specialize in industries like Fintech, Healthcare, EdTech, Construction, Hospitality, and more, partnering with startups, mid-sized businesses, and Fortune 500 companies to drive growth and scalability. Our clients include Jaguar Motors, Universal Pictures, Harley-Davidson, Qualcomm, and London Stock Exchange.Together, our team delivers solutions that make a difference. Learn more at www.intellectsoft.net  \n  \n**Requirements**  \n  \n\n-   Bachelor's deegree in a technical field, or equivalent work or training experience\n-   Minimum of 5 years working on native Android development\n-   Proficiency with Kotlin and Android Studio, RxJava, Dagger2, Retrofit2, Room\n-   Experience with collections, multithreading, synchronization\n-   Understanding of mobile architecture patterns (MVVM, MVC, etc.)\n-   Experience with RESTful APIs to connect mobile applications to back-end services\n-   Understanding of Google's Material Design Guidelines\n-   Knowledge of mobile app distribution processes (Google Play Store)\n-   Understanding of automated testing frameworks for mobile applications, experience in unit tests (JUnit, Mockito, Robolectric)\n-   Git, gitflow, pull request, code review - are the everyday words/tools for you\n\n**Nice To Have Skills**  \n  \n\n-   Experience with Firebase\n-   Knowledge of Cloud Services\n-   Understanding of CI/CD principles for mobile development\n-   Experience with app analytics tools like Google Analytics, Firebase Analytics\n-   Experience designing, building, and maintaining REST APIs, using tools like Swagger, MITM\n\n**Responsibilities:**  \n  \n\n-   Collaborate with the team to design, implement, and deploy new mobile applications and improvements\n-   to existing mobile applications\n-   Develop new functionalities\n-   Maintain production systems, perform root cause analysis of issues\n-   Active participation in the Scrum process\n-   Ensure good testing coverage of unit and integration testing\n-   Participate in peer design and code reviews\n-   Proactively collaborate with teammates\n\n**Benefits**  \n  \n\n-   35 paid absence days per year for work-life balance of each specialist + 1 additional day for each following year of cooperation with the company\n-   Up to 15 unused absence days can be add to income after 12 month of cooperation\n-   Health insurance for you and your family!\n-   Depreciation coverage for personal laptop usage for project needs\n-   Udemy courses of your choice\n-   Regular soft-skills trainings\n-   Excellence Сenters meetups",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "Namecheap, Inc",
    "externalUrl": "https://pt.linkedin.com/jobs/view/junior-android-developer-at-namecheap-inc-4139378636?position=8&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=VFGdGPO6xH4wRhe96uN7aQ%3D%3D",
    "description": "Join us as a Junior Android Developer to help our mission to enhance online privacy with innovative tools. Help develop FastPN for Android mobile, tablet and TV applications. Be part of a dynamic team composed of various operating system experts, UX, QA and Product where you can directly impact the end product.\n\n  \n\n🌍 **Location:** 100% remote, based in Portugal\n\n🏁 **The Interview Process:** 3 stages - 45 min HR conversation ➡️ 1h Live Technical discussion ➡️ 1h Values Interview\n\n🧰**Tools:** Kotlin, Java\n\n👩‍💻 **Reporting to:** FastVPN Product Manager\n\n🚀 **Your team:** 5 people (1 Manager, 1 Senior Backend, 2 Senior Front end and YOU!)\n\n  \n\n**What will make your journey with us amazing?**\n\n  \n\n🏆A supportive manager who cares about your well-being and is invested in your professional growth.\n\n  \n\n🌱A culture of continuous learning, with clear targets and feedback.\n\n  \n\n🧡A global company with over 2500 employees located in more than 26 countries around the world, including offices in 3 countries: Ukraine 🇺🇦, Portugal 🇵🇹, and India 🇮🇳.\n\n  \n\n**What will be your responsibilities?**\n\n  \n\n-   Support the ongoing development and maintenance of our Android VPN app.\n-   Contribute to the architecture and design of an Android TV app version.\n-   Collaborate closely with the team on new features, bug fixes, and performance improvements.\n-   Be a proactive team member - we value all opinions and ideas.\n-   Stay updated with the latest development best practices and trends.\n\n  \n\n**What will you bring?**\n\n  \n\n-   Proven Android Development Experience: Android app development using Kotlin, Java.\n-   Solid understanding of software engineering principles and practices.\n-   A growth-oriented mindset with a desire to explore new tools and platforms.\n-   Familiarity with iOS or cross-platform development is a plus.\n\n  \n\n**What’s in it for you:**\n\n  \n\n💻 100% remote, based in Portugal\n\n🌍 International professional environment\n\n🌱 Career growth opportunities\n\n  \n\n**#NamecheapCareers**\n\n**#equalopportunity**\n\n**#hackyourcareer**",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "AiDASH",
    "externalUrl": "https://in.linkedin.com/jobs/view/software-development-engineer-ii-android-at-aidash-4139637628?position=51&pageNum=0&refId=FaeIlSvK2LarK1%2FuHFyEVA%3D%3D&trackingId=QHfnzosN2cKUVOeu4FEX2w%3D%3D",
    "description": "**About AiDASH?**\n\nAiDash is making critical infrastructure industries climate-resilient and sustainable with satellites and AI. Using our full-stack SaaS solutions, electric, gas, and water utilities, transportation, and construction customers are transforming asset inspection and maintenance—and complying with biodiversity net gain mandates and carbon capture goals. Our customers deliver ROI in their first year of deployment with reduced costs, improved reliability, and achieved sustainability goals. Learn more at www.aidash.com.\n\n  \n\nWe are a Series C climate tech startup backed by leading investors (including National Grid Partners, G2 Venture Partners, Lightrock, BGV, and Marubeni, among others) and by our customers-turned-advocates (Duke Energy & National Grid Partners, among others)! We have been recognized by Forbes two years in a row as one of “America’s Best Startup Employers.\" We are also proud to be one of the few climate software companies in Time Magazine’s “America’s Top GreenTech Companies 2024.\".\n\n  \n\n**How You’ll Make an Impact**\n\n-   Design and Build a completely new Maps Interaction for our Sustainability initiatives\n-   Contribute to the design and implementation of new features and products.\n-   Collaborate with product managers, developers, and creative designers to translate requirements and mock-ups into fully functional features.\n-   Rapidly learn and master new technologies to improve usability and performance\n-   Play a key role in the design and implementation of new products and features.\n-   Translate requirements and mock-ups into fully functional features by working closely with product managers, developers, and creative designers.\n-   Break features into simpler granular tasks, estimate the effort required and identify dependencies.\n-   Write efficient and readable code based on a good understanding of design principles.\n-   Drive the product roadmap and take ownership of several core components of the product.\n\n  \n\n**What we're looking for:**\n\n-   Android Development Consumer/Enterprise Application Development Experience.\n-   4+ years of solid experience designing and developing modern mobile Hybrid applications\n-   Flutter's experience in building scalable hybrid apps along with native.\n-   Experience in building and shipping complexes and business-critical hybrid apps with frequent iteration.\n-   Deep understanding of design patterns and principles with a broad knowledge of the Android & Flutter Tech stack.\n-   Deep understanding of Android SDK to create scalable, dynamic, and highly performant Ul components.\n-   Working knowledge of remote APIs, concurrency, layouts, transitions, animations, client-side persistence, and architectural patterns on mobile apps.\n-   Strong aptitude, algorithms, and data structures in AR-VR.\n-   B Tech/BE degree with a specialisation in computer science or equivalent degree from Tier 1 or Tier 2 colleges.\n\n  \n\nWe are proud to be an equal-opportunity employer. We are committed to embracing diversity and inclusion in our hiring practices, and we promote a work environment where everyone, from any race, color, religion, sex, sexual orientation, gender identity, or national origin, can do their best work.\n\n  \n\nWe are committed to providing an inclusive and accessible interview experience for all candidates. Please let us know if you require any accommodation during the interview process, and we will make every effort to meet your needs.",
    "created_at": "2025-01-31 12:30:13.844702+00"
  },
  {
    "companyName": "System Soft Technologies",
    "externalUrl": "https://mx.linkedin.com/jobs/view/mobile-application-developer-at-system-soft-technologies-4138369720?position=34&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=LTAp43%2BPcEwNqat98%2FFzgw%3D%3D",
    "description": "**Job Description – Mobile App Developer**\n\nSystem Soft Technologies is a premier technology company providing exceptional consulting services and solutions that drive innovation, enhance business value, and boost competitiveness. For over 25 years, we have built trusted partnerships with our clients, helping us grow into a $200MM+ enterprise. With the collective resources of over 1,200 associates covering the full spectrum of IT expertise, we anticipate and meet the unique needs of our clients, consistently delivering exceptional quality that exceeds expectations.\n\n  \n\n**Job Summary:**\n\nClient is looking for Mobile App Developer and this is remote from Mexico.\n\n  \n\n  \n\n**Responsibilities:**\n\n-   Involve in the app architecture and guide technical decision-making processes.\n-   Participate in daily stand-up meetings and in requirement gathering and elaboration of needs to identify and vet solutions.\n-   Create technical specifications and interpret requirements to achieve functional software solutions.\n-   Develop, integrate, and build effective and accessible mobile applications.\n-   Primarily focus on front-end development, with occasional involvement in server-side development and database integration.\n-   Follow an approved development methodology, ensuring all phases including prototyping, documentation, design, development, testing, and technical support are completed effectively\n-   Conduct unit, integration, and functional tests to ensure business, quality, and performance requirements are met, and collaborate with quality assurance teams to ensure optimal outcomes.\n-   Work with project managers, technical leads, and other developers to define technical requirements and tasks for project planning.\n-   Proactively research and stay current on emerging technologies related to our scope of work.\n-   Create and maintain appropriate technical documentation following approved ACS development methodology\n\n  \n\n**Required Skills and Experience:**\n\n-   Seeking an independent expert in Flutter/Dart Mobile Development with strong experience in test automation, mobile app integration, and cross-platform development.\n-   Must have developed at least 3 Flutter apps, work CST US time zone hours, and align with ACS's mission.\n-   Proven experience in building and maintaining mobile applications for both Android and iOS platforms.\n-   Strong proficiency in Dart and extensive experience with the Flutter framework and its ecosystem.\n-   Expertise in integrating Flutter with native frameworks and platforms.\n-   Strong knowledge of state management in Flutter.\n-   Strong foundation in Object-Oriented Programming (OOP) techniques, including interfaces, abstraction, providers, and dependency injection.\n-   Familiarity with gang of four design patterns e.g. MVC, MVP, and MVVM (at least one)\n-   Experience with Git for version control, as well as conducting code reviews and managing pull requests.\n-   Familiarity with unit testing and mocking frameworks to ensure code quality.\n-   Experience integrating third-party libraries and services such as Firebase, Refit, and others.\n-   Understanding of n-tier programming and its application in mobile app development.\n-   Ability to pick up and learn new technologies quickly and adapt to existing software.\n-   Knowledge of OWASP Top Ten vulnerabilities and Secure Coding Practices, PCI concepts\n-   Knowledge of mobile app security best practices and performance optimization\n-   Experience with Scrum/Agile methodology, with the ability to quickly turn ideas into working products.\n\n  \n\n  \n\n**Nice to Have:**\n\n-   Xamarin .NET or Maui .NET (C#)\n-   React Native\n-   Experience with native mobile development (iOS/Android) is a bonus.\n-   Configuring Azure Devops Pipelines to build native apps (bonus if experience building flutter apps via pipelines to upload to respective stores)\n-   Excellent knowledge of JavaScript, CSS, XML, HTML.\n-   Experience working with SQL databases Sql, Sqlite, or Mssql\n-   Experience working with document databases MongoDB or Cosmos DB\n-   Experience with cloud-based platforms (e.g., AWS, Google Cloud, Azure).\n-   Experience working with Redis Cache and client/server caching techniques.",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "EarnIn",
    "externalUrl": "https://mx.linkedin.com/jobs/view/senior-mobile-engineer-android-at-earnin-4064859450?position=23&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=NL81zMO6UBAkWqejE3Taig%3D%3D",
    "description": "**About Earnin**  \n  \nAs one of the first pioneers of earned wage access, our passion at EarnIn is building products that deliver real-time financial flexibility for those with the unique needs of living paycheck to paycheck. Our community members access their earnings as they earn them, with options to spend, save, and grow their money without mandatory fees, interest rates, or credit checks.  \n  \nWe’re fortunate to have an incredibly experienced leadership team, combined with world-class funding partners like A16Z, Matrix Partners, DST, Ribbit Capital, and a very healthy core business with a tremendous runway. We’re growing fast and are excited to continue bringing world-class talent onboard to help shape the next chapter of our growth journey.  \n  \n**Position Summary**  \n  \nWe are seeking experienced, passionate, and resourceful senior mobile engineers to join our Product Engineering teams. As a mobile engineer, you will collaborate cross-functionally with various teams, contributing to the design and development of our mobile applications. Being customer-facing, our Product Engineering teams play a crucial role in shaping the customer’s impression of our company.  \n  \n**This position will ideally be hybrid from our Mexico City office as part of our expanding site, though a remote arrangement is possible**. EarnIn provides excellent benefits for our employees including healthcare, internet/cell phone reimbursement, a learning and development stipend, and potential opportunities to travel to our Palo Alto HQ. Our salary ranges are determined by role, level, and location.  \n  \n**What You'll Do**  \n  \n\n-   Develop and implement product features to improve customer experience.\n-   Architect and refine mobile infrastructure to enhance scalability and support the organization's expansion.\n-   Collaborate closely with backend engineers to design robust APIs for efficient mobile-to-server communication.\n-   Lead the establishment and governance of engineering best practices, ensuring high standards for code quality and system reliability.\n-   Proactively drive projects, providing clear direction and detailed problem-solving strategies.\n-   Mentor the mobile engineering team, elevating skills and optimizing processes.\n-   Design and execute comprehensive unit and UI automation tests to ensure new features perform as required without disrupting existing functionalities.\n-   Analyze feature effectiveness using advanced analytics to demonstrate impact and inform future enhancements.\n\n**What We're Looking For**  \n  \n\n-   Bachelor’s degree (or higher) in Computer Science or a related field, or equivalent practical experience.\n-   Strong proficiency in Kotlin, with expertise in reactive and functional programming paradigms.\n-   Deep understanding of Android application architectures (MVVM, MVC, MVP, etc.).\n-   Extensive knowledge of professional software engineering practices across the full development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations.\n-   Minimum of 4 years relevant industry experience, particularly in mobile development.\n-   Familiarity with iOS development and cross-platform frameworks such as React Native or Kotlin Multi Platform is a significant plus.\n\nAt EarnIn, we believe that the best way to build a financial system that works for everyday people is by hiring a team that represents our diverse community. Our team is diverse not only in background and experience but also in perspective. We celebrate our diversity and strive to create a culture of belonging. EarnIn does not unlawfully discriminate based on race, color, religion, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), gender identity, gender expression, national origin, ancestry, citizenship, age, physical or mental disability, legally protected medical condition, family care status, military or veteran status, marital status, registered domestic partner status, sexual orientation, genetic information, or any other basis protected by local, state, or federal laws. EarnIn is an E-Verify participant.  \n  \nEarnIn does not accept unsolicited resumes from individual recruiters or third-party recruiting agencies in response to job postings. No fee will be paid to third parties who submit unsolicited candidates directly to our hiring managers or HR team.",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "Workling",
    "externalUrl": "https://br.linkedin.com/jobs/view/android-developer-remote-from-anywhere-at-workling-4139324505?position=24&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=t5H7rXk0qp9EcouPwpypfg%3D%3D",
    "description": "At Workling, we're revolutionizing the way businesses thrive by seamlessly matching challenges with skills, igniting instant impact and fueling continuous growth opportunities for professionals worldwide.\n\n  \n\nOverview of the Role:\n\nWe are looking for a skilled Android Developer capable of delivering high standards of technical quality and innovation, always striving for continuous improvement, and looking to help all different types of clients around the world.\n\nTo ensure success, you must have detailed knowledge of development techniques, excellent communication, and organizational skills.\n\n  \n\nAs part of the team, you will:\n\n\\- Able to work independently with minimal supervision, as well as collaborate with a diverse team\n\n\\- Accountable for resolution of the most technically challenging issues facing the organization\n\n\\- Write code with increasing quality and maintainability\n\n\\- Guide the architecture of large features which impact all parts of the company, identifying issues and raising concerns/blockers for mitigation\n\n\\- Research and introduce new technology to improve the applications and/or the development pipeline\n\n  \n\nKey qualifications and skills to succeed in this role:\n\n\\- Advanced English (spoken and written)\n\n\\- 5+ years of experience in Android development\n\n\\- Solid knowledge of design and architecture patterns\n\n\\- Solid knowledge and management of programming fundamentals including algorithms and data structures\n\n  \n\nWhat to expect from us:\n\n\\- Fully Remote: Enjoy the freedom to work from anywhere in the world.\n\n\\- Competitive Compensation: Receive excellent pay in USD or your preferred local currency.\n\n\\- Home Office Setup: We provide the necessary hardware for your home office.\n\n\\- Flexible Hours: Design your own work schedule for optimal work-life balance.\n\n\\- Paid Leave: Enjoy paid parental leave, vacation, and national holidays.\n\n\\- Dynamic Work Culture: Thrive in our innovative and multicultural environment.\n\n\\- Elite Collaboration: Work with the global top 1% of talent in various fields.\n\n\\- Growth and Support: Benefit from mentorship, skill development, promotions, and diverse career growth opportunities\n\n  \n\nJoin Workling's mission to connect top talent with global opportunities, driving impact and sustained growth for professionals and businesses.",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "TeaCode.io",
    "externalUrl": "https://pl.linkedin.com/jobs/view/junior-mobile-developer-at-teacode-io-4138976701?position=21&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=hvyusK6fAOmvUuabx%2FSBBw%3D%3D",
    "description": "**Pay rate:** 40 - 65 zł/h  \n  \n**Type of agreement:** B2B contract, contract of mandate  \n  \n**Type of work:** remote  \n  \nAre you passionate about technology and eager to grow your skills in a dynamic environment? At TeaCode, we are looking for a motivated **Junior Mobile Developer** to join our innovative team.  \n  \nYou will work on an **innovative fitness app** that transforms traditional street games into a gamified, interactive experience. The app leverages precise location tracking to guide players to check-in points, collect points, and compete in teams.  \n  \nA key feature is **NFC support**, allowing users with NFC cards to participate easily. The goal is to create an engaging, inclusive experience that promotes family bonding, physical activity, and outdoor fun. You will be responsible for developing new features, optimizing performance, and ensuring a seamless user experience across both iOS and Android.  \n  \nThis is an exciting opportunity to work on a tech-driven fitness solution that encourages an active lifestyle through digital innovation.  \n  \n**Key Responsibilities**  \n  \n\n-   Collaborate directly with the CTO to plan and develop new features\n-   Work with IoT technologies, including NFC and location-based services\n-   Contribute to the development of the mobile application\n-   Assist in optimizing and improving marketing campaigns using Amazon PinPoint\n-   Participate in code reviews and continuous learning to enhance development skills\n-   Stay up to date with mobile development best practices and emerging technologies\n\n**Requirements**  \n  \n\n-   First experience in mobile app architecture and development in a Typescript/Javascript environment\n-   Knowledge and commercial experience in Typescript, React Native\n-   Experience in releasing/publishing mobile apps on Google Play and Apple App Store\n-   Experience in AWS would be a big advantage\n-   English at C1 level or higher\n-   Proficiency in Polish\n-   Good communication skills are a must\n-   Self motivation, willingness to learn new things and positive attitude to change\n-   Teamwork skills\n\n**What We Offer**  \n  \n\n-   A collaborative and supportive work environment\n-   Opportunities for professional growth and skill development\n-   Engaging projects that challenge your creativity and technical expertise\n-   Macbook equipment to work on\n-   Coworking office space in a vibrant location of Warsaw\n\n**Recruitment Process**  \n  \n\n-   HR interview with a Talent Acquisition Specialist (30 minutes)\n-   Intellectual capabilities test (1 hour)\n-   Technical interview: live coding session (1 hour)\n-   Final interview with the Head of Delivery (1 hour)\n-   Decision\n\n**About Us**  \n  \n\n-   We are a software house based in Warsaw with over 50 people on board\n-   We work in one programming language → JavaScript/TypeScript\n-   We have clients from all over the world\n-   We are really flexible in working hours\n-   The atmosphere within the team is our great value",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "Teko",
    "externalUrl": "https://ph.linkedin.com/jobs/view/android-developer-at-teko-4138907408?position=31&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=ieKSaybWuesMLHbYe9pLjw%3D%3D",
    "description": "**About Teko**\n\nTeko is a technology startup innovating the after-sales service for appliances and electronics. Our sophisticated platform empowers technicians and revolutionizes the after-sales service of businesses. We are backed by Concepcion Industries Corp., the Philippines' leading appliance manufacturer and distributor, with trusted brands such as Carrier, Condura, Midea, Toshiba, and Shark Ninja.\n\n  \n\n**Responsibilities**\n\n-   Develop and maintain a large scale Android application.\n-   Implement new features, meeting design needs, and keep libraries up to date.\n-   Identify, troubleshoot, and fix bugs from Crashlytics.\n-   Take part in full product development and enhancement cycles.\n-   Integrate and collaborate with backend developers and QA.\n\n**Requirements**\n\n-   Solid 4+ years knowledge of Kotlin, Java, and Android SDK. Knowledge of Android NDK is a plus.\n-   Experience with Android MVVM architecture and SOLID object oriented principles.\n-   Knowledgeable in lambda and asynchronous programming with RxJava/RxKotlin.\n-   Familiarity with dependency injection and libraries such as Dagger and Hilt\n-   Strong knowledge of RESTful APIs and libraries such as OkHttp and Retrofit.\n-   Hands-on dev tools, GIT, Firebase, AWS, and Postman.\n-   Ability to respond professionally to emails, chats, and phone calls.\n-   Bachelor’s in Computer Science, Computer Engineering or related field.\n-   Team player and ability to work independently with professionalism.\n\n**Good to Have**\n\n-   Knowledge with Jetpack libraries.\n-   Experience with instrumentation/unit testing and test-driven development.",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "SpotOn",
    "externalUrl": "https://pl.linkedin.com/jobs/view/senior-software-engineer-i-android-at-spoton-4138899538?position=25&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=azi0I9iq3E0qnTpdivSo1g%3D%3D",
    "description": "At SpotOn, we’re helping restaurants and small businesses compete and win with flexible payment and software technology—backed by real people who really care. From seamless point-of-sale systems to integrated restaurant management solutions, every SpotOn tool is designed to help local businesses increase profits and create better experiences for their customers and employees.  \n\n  \n\nRecently, SpotOn was:\n\n  \n\n  \n-   Named one of Fast Company’s Most Innovative Companies of 2024\n  \n-   Awarded Great Places to Work and Built In’s Best Workplaces for the third year in a row\n  \n-   Selected as the Best Overall Restaurant POS by NerdWallet \n  \n-   Rated the top-rated point-of-sale (POS) for restaurants, bars, retail, and small businesses by Capterra users\n  \n\n  \n\nWe’re committed to caring hard and moving fast so that we can continue to grow and make a positive impact together. \n\n  \n\nThat’s where you come in. \n\n**On a daily basis you will:**\n\n  \n\n  \n-   Be a part of a strong Android team working in Scrum methodology.\n  \n-   Work on projects that follow the guidelines of clean architecture approach, SOLID and utilize many design patterns.\n  \n-   Use MVVM/MVI architecture pattern.\n  \n-   Work with multimodular project separated by feature/layer.\n  \n-   Use the newest frameworks like Koin, Coroutines, Jetpack Compose etc.\n  \n-   Be an independent developer and take ownership of the upcoming tasks.\n  \n-   Work on complex system with multiple projects.\n  \n-   Get a chance to work in different stacks than Android (if that's something you would like).\n  \n\n  \n\n**Tools We Use:**\n\n  \n\n  \n-   Observability: OpenTelemetry & Grafana Cloud.\n  \n-   Developer Platform: GitHub.\n  \n-   CI Server: GitHub Actions.\n  \n-   Crash Monitoring: Firebase.\n  \n-   Atlassian Suite.\n  \n-   Google Suite.\n  \n-   Slack.\n  \n\n  \n\n**What skill are we looking for?**\n\n  \n\n  \n-   5+ years of recent Android development experience. Ability to show code snippets and/or open-source projects are bonus points!\n  \n-   Fluency in Kotlin (the language we use).\n  \n-   Familiar with RESTful APIs and WebSockets and how to use them from Kotlin-based Android applications.\n  \n-   Good knowledge of Android SDK.\n  \n-   Experience with payments.\n  \n-   Knowledge of libraries commonly used in Android development (for instance Koin, RxJava, Retrofit, Room, Coroutines).\n  \n-   Experience with object-oriented concepts and design patterns.\n  \n-   Good knowledge of different Android application architecture patterns.\n  \n-   Ability to debug and profile applications.\n  \n-   Excellent command of written and spoken English (min. B2 level).\n  \n-   Experience in working in small teams and with version control systems (and if that’s Git, even better!).\n  \n\n  \n\n**Perfect candidate also has:** \n\n  \n\n  \n-   Knowledge of security issues on mobile.\n  \n-   Basic knowledge of SQL, SQLite. \n  \n-   Navigation component.\n  \n-   Clean architecture approach. \n  \n-   Hands-on experience in improving application performance.\n  \n-   Practical knowledge of observability best practices in mobile applications.\n  \n-   Great personality and communication skills.\n  \n\n  \n\n**Here’s a bit about what we have to offer:**\n\n  \n\n  \n-   Competitive pay: 18000 - 23500PLN net on B2B; 15500 - 20000  PLN gross on CoE.\n  \n-   Training budget 3500 PLN gross per year.\n  \n-   Access to e-learning platforms (O’Reilly).\n  \n-   Fully paid private healthcare in LuxMed.\n  \n-   Access to the Worksmile platform with a monthly top-up.\n  \n-   Company free breakfasts/lunches in the office once a week.\n  \n-   Group English classes with a native speaker.\n  \n-   New Macbook Pro, 4K monitors or whatever tools you need.\n  \n-   Flexible working hours.\n  \n-   New, modern, bright and comfortable office space in the city centre.\n  \n-   A lot of free parking spots around the office.\n  \n-   Access to the company’s library.\n  \n-   Great working atmosphere.\n  \n-   Chill out room with a PlayStation and games.\n  \n-   Free snacks and beverages in a kitchen.\n  \n-   Company parties and social activities.\n  \n-   Employee referral program.\n  \n-   Relocation Package within Poland.\n  \n\n  \n\n  \n\nThe controller of your personal data included in your job offer and others collected during the recruitment process is SpotOn Poland spółka z ograniczoną odpowiedzialnością with its registered office in Kraków, Aleja 29 listopada 20, 31-401 Kraków, e-mail address: poland-rodo@spoton.com. We will process your personal data for the purpose of current or, if you voluntarily agree, also future recruitment processes. More information about how we proccess your data, including the basis for processing and your rights in relation to the processing, can be found on our website: https://pl.spoton.com/privacy-and-cookies-policy.\n\n  \n\nAdministratorem podanych danych osobowych, w tym danych zawartych w dokumentach aplikacyjnych i zebranych w toku procesu rekrutacji, jest SpotOn Poland Sp. z o.o. z siedzibą w Krakowie (ul. Aleja 29 listopada 20, 31-401 Kraków; adres e-mail do kontaktu: poland-rodo@spoton.com. Dane osobowe będą przetwarzane w celu realizacji obecnych lub – jeżeli wyrazisz na to dobrowolną zgodę – także przyszłych procesów rekrutacji. Więcej informacji o tym, jak przetwarzamy Twoje dane, w tym także informacje o podstawach prawnych przetwarzania oraz o prawach przysługujących Ci w związku z przetwarzaniem danych, znajdziesz na stronie: https://pl.spoton.com/privacy-and-cookies-policy.\n\n  \n\n_SpotOn is an equal employment opportunity employer. Qualified candidates are considered for employment without regard to race, religion, gender, gender identity, sexual orientation, national origin, age, military or veteran status, disability, or any other characteristic protected by applicable law._\n\n  \n\nSpotOn is an e-verify company.",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "Capitole",
    "externalUrl": "https://es.linkedin.com/jobs/view/desarrollador-de-android-barcelona-at-capitole-4137890301?position=22&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=mMp1vc9z2thPGhuWwjXb9w%3D%3D",
    "description": "¡**Capitole Consulting** sigue creciendo y queremos hacerlo contigo!\n\n  \n\nEstamos buscando un desarrollador Android / Kotlin con 3 años de experiencia.\n\n  \n\n**Funciones principales y descripción del proyecto:**\n\n  \n\nPasarías a formar parte de un proyecto de desarrollo en continua mejora en uno de los clientes TOP de Capitole.\n\n  \n\nTu objetivo será el de participar junto al resto del squad en el desarrollo de nuevas funcionalidades y hacer discovery para nuevos proyectos para aplicaciones internas del cliente.\n\n  \n\nParticiparás activamente en todos los aspectos del ciclo de vida del proyecto patrones de diseño y mejores prácticas.\n\n  \n\nStack Tecnológico:\n\n  \n\n-   **Android Kotlin**\n-   **Compose** **Jetpack Compose**\n-   **Data Binding e Inyección de Dependencias**: **Dagger** o **Hilt**.\n-   **Testing unitario, E2E e Integración: JUnit**, **Espresso**, y **Mockk**\n-   **GIT**\n-   **Clean code, SOLID**\n-   **Scrum**\n\n  \n\nSemipresencial de L-J: 8,5h y V 6h. Flexibilidad de entrada entre 8 y 9:30h. Para ello buscamos una persona que quiera reubicarse en la zona de Barcelona.\n\n  \n\nSomos geniales, pero contigo lo seremos más 😊\n\n  \n\nPara ello tendrás:\n\n• Presupuesto de 1.200€ en formación individual para que lo utilices en lo que tú quieras (eventos tecnológicos, libros, formaciones, certificaciones etc.).\n\n• Seguimiento con tu equipo todos los meses para tener un continuo feedback.\n\n• Seguro médico privado pagado íntegramente por Capitole\n\n• Retribución flexible (tickets restaurante, transporte y/o guardería).\n\n• Andjoy (Gymforless)\n\n• Descuentos en grandes marcas para emplead@s (Club Capitole)\n\n• Team Buildings cada dos meses. ¡No te puedes perder la fiesta de verano o la cena de Navidad!\n\n• Equipo de fútbol patrocinado por Capitole.\n\n• Comunidades tecnológicas para que compartas tus conocimientos e ideas con los demás equipos.\n\n  \n\n¿Aún no nos conoces? ¡¡Descúbrenos!! https://capitole-consulting.com/\n\nMira lo que opinan de nosotros 👀 https://www.glassdoor.es/Opiniones/Capitole-Consulting-Opiniones-E2060890.htm\n\nNo dudes en enviarnos tu perfil, ¡estamos deseando conocerte!\n\n  \n\n_El empleado/a se adherirá a las políticas de seguridad de la información:_\n\n_\\- Tendrá acceso a la información confidencial relativa a Capitole y al proyecto en el que trabaja._\n\n_\\- Tendrá que cumplir las políticas de seguridad y las políticas internas de la empresa y cliente._\n\n_\\- Tendrá que firmar un NDA._",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "Schwarz Digits",
    "externalUrl": "https://de.linkedin.com/jobs/view/android-developer-jetpack-compose-m-w-d-at-schwarz-digits-4138350736?position=47&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=I0Qh6or0p2dNmopWyEPzMA%3D%3D",
    "description": "Die Schwarz IT betreut die gesamte digitale Infrastruktur und alle Softwarelösungen der Unternehmen der Schwarz Gruppe. Sie ist somit für Auswahl, Bereitstellung und Betrieb sowie Weiterentwicklung von IT-Infrastrukturen, IT-Plattformen und Business-Anwendungen zuständig. Um die Fachbereiche durch IT-Lösungen optimal bei deren Geschäftsprozessen zu unterstützen, nimmt die Schwarz IT die Anforderungen der Fachbereiche in Beratungsgesprächen auf und erarbeitet gemeinsam mit diesen professionelle und leistungsfähige IT-Lösungen.  \n  \n**Deine Aufgaben**   \n  \nWir sind verantwortlich für die Entwicklung von Software zur Unterstützung der Filialwarenwirtschaft von Unternehmen der Schwarz Gruppe. Dabei setzen wir auf neue Technologien und Plattformen. Der persönliche Kontakt und Austausch am Standort in Heilbronn ist ein wichtiges Element der Zusammenarbeit und ein zentraler Anlaufpunkt unserer Arbeitswelt. Zugleich bieten wir die Vorteile flexibler Arbeitsweisen und ermöglichen mobiles Arbeiten von bis zu fünf Tagen pro Arbeitswoche. Dabei nutzen wir die Chance uns auch 2x im Monat persönlich als Team zu treffen. Unser Mindset: Offene Türen, Duz-Kultur, Respekt, deine Ideen sind jederzeit willkommen.   \n  \n\n-   Du baust Android Enterprise Applikationen, die Teil der kritischen Infrastruktur Europas sind\n-   Du gehst mit uns den Weg hin zu einer der besten Softwareentwicklungs-Organisationen \n-   Du bist Teil eines kleinen selbstorganisierten, agilen Teams, vergleichbar mit SCRUM, das in kurzen Release-Zyklen arbeitet\n-   Du führst alle Tätigkeiten des Software-Engineerings aus, von der Anforderungsermittlung und Planung über die Implementierung und Qualitätssicherung bis zum Betrieb\n-   Du bringst deine Ideen ein, zum Beispiel im Rahmen unserer Entwickler-Community\n-   Du verbesserst dich selbst und deine Applikation stetig\n\n**Dein Profil**   \n  \n\n-   Du hast Erfahrung in der Entwicklung von Android Apps, idealerweise mit Gradle, Kotlin und Jetpack Compose\n-   Du kennst Datenbanken wie SQLite\n-   Du verstehst HTTP und Messaging\n-   Du bist in der Lage automatische Tests zu schreiben\n-   Idealerweise bist du motiviert auch im Backend (Kotlin, Ktor) auszuhelfen \n-   Du hast gute Deutsch- (B2) und Englischkenntnisse \n-   Du hast ein IT Studium Orientierung Anwendungsentwicklung oder alternativ eine IT-Ausbildung mit entsprechender IT-Weiterbildung",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "Schwarz Digits",
    "externalUrl": "https://de.linkedin.com/jobs/view/kotlin-backend-developer-ktor-at-schwarz-digits-4138351723?position=44&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=HaSqCUkE6j%2BPImFZEhoIcQ%3D%3D",
    "description": "Die Schwarz IT betreut die gesamte digitale Infrastruktur und alle Softwarelösungen der Unternehmen der Schwarz Gruppe. Sie ist somit für Auswahl, Bereitstellung und Betrieb sowie Weiterentwicklung von IT-Infrastrukturen, IT-Plattformen und Business-Anwendungen zuständig. Um die Fachbereiche durch IT-Lösungen optimal bei deren Geschäftsprozessen zu unterstützen, nimmt die Schwarz IT die Anforderungen der Fachbereiche in Beratungsgesprächen auf und erarbeitet gemeinsam mit diesen professionelle und leistungsfähige IT-Lösungen.  \n  \n**Deine Aufgaben**   \n  \nWir sind verantwortlich für die Entwicklung von Software zur Unterstützung der Filialwarenwirtschaft von Unternehmen der Schwarz Gruppe. Dabei setzen wir auf neue Technologien und Plattformen. Der persönliche Kontakt und Austausch am Standort in Heilbronn ist ein wichtiges Element der Zusammenarbeit und ein zentraler Anlaufpunkt unserer Arbeitswelt. Zugleich bieten wir die Vorteile flexibler Arbeitsweisen und ermöglichen mobiles Arbeiten von bis zu fünf Tagen pro Arbeitswoche. Dabei nutzen wir die Chance uns auch 2x im Monat persönlich als Team zu treffen. Unser Mindset: Offene Türen, Duz-Kultur, Respekt, deine Ideen sind jederzeit willkommen.   \n  \n\n-   Du baust Enterprise Applikationen, die Teil der kritischen Infrastruktur Europas sind\n-   Du gehst mit uns den Weg hin zu einer der besten Softwareentwicklungs-Organisationen \n-   Du bist Teil eines kleinen selbstorganisierten, agilen Teams, vergleichbar mit SCRUM, das in kurzen Release-Zyklen arbeitet\n-   Du führst alle Tätigkeiten des Software-Engineerings aus, von der Anforderungsermittlung und Planung über die Implementierung und Qualitätssicherung bis zum Betrieb\n-   Du bringst deine Ideen ein, zum Beispiel im Rahmen unserer Entwickler-Community\n-   Du verbesserst dich selbst und deine Applikation stetig\n\n**Dein Profil**   \n  \nDu hast Erfahrung in der Entwicklung von Enterprise Applikationen, idealerweise mit Gradle und Kotlin  \n  \n\n-   Du hast Erfahrung in der Entwicklung von Enterprise Applikationen, idealerweise mit Gradle und Kotlin\n-   Du kennst Datenbanken wie PostgreSQL\n-   Du verstehst HTTP und Messaging\n-   Du bist in der Lage automatische Tests zu schreiben\n-   Idealerweise bist du motiviert auch in der zugehörigen Android App (Kotlin, Jetpack Compose) auszuhelfen\n-   Du hast gute Deutsch- (B2) und Englischkenntnisse \n-   Du hast ein IT Studium Orientierung Anwendungsentwicklung oder alternativ eine IT-Ausbildung mit entsprechender IT-Weiterbildung",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "ALGOTEQUE Innovation Hub",
    "externalUrl": "https://pl.linkedin.com/jobs/view/senior-mobile-developer-flutterflow-at-algoteque-innovation-hub-4139210919?position=41&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=G0acwnpypifC306Fi1sSIw%3D%3D",
    "description": "ALGOTEQUE is an IT consultancy firm that helps startups, mid-sized and large corporations to create and deliver innovative technologies.  \n  \nOur team has a successful track record in designing, developing, implementing, and integrating software solutions (AI, ML, BI, Web, Automation) for Telecom, Energy, Bank, Insurance, Pharma, Automotive, Industry, e-commerce. We deliver our services both in fixed-price and time-and-materials models, helping our customers achieve their business and IT strategies.  \n  \n**Job Description**  \n  \nWe are looking for Senior Mobile Developers to join our team and contribute to building cutting-edge mobile applications for the education industry.  \n  \n**Profile / Requirements**  \n  \n✅ 5+ years of experience in native mobile development (iOS/Android)  \n  \n✅ 3+ years of experience with FlutterFlow  \n  \n✅ Strong understanding of mobile app architecture and best practices  \n  \n✅ Experience integrating APIs and working with databases  \n  \n✅ A BSc/BA in Computer Science is preferred  \n  \n✅ English( B2/C1)  \n  \n✅ Location: Poland  \n  \n**What We Offer**  \n  \n🚀 Work on innovative projects that impact the education sector  \n  \n💻 Flexible working model - remote or hybrid(From Wroclaw lub Warsaw)  \n  \n📈 Opportunity to influence product and technology decisions  \n  \n💡 A team of passionate professionals working with the latest tech  \n  \nIf you have the experience and want to work on projects that make a real difference in education – apply now!  \n  \n📩 Send your application or reach out to us directly to learn more.  \n  \nAO3315",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "Joget, Inc.",
    "externalUrl": "https://my.linkedin.com/jobs/view/software-developers-at-joget-inc-4139495921?position=40&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=RjoTzkQc7TKGFVgDCFuXyA%3D%3D",
    "description": "Joget Technology Sdn. Bhd. (Joget, Inc.)  \n  \nAI-generated summary  \n  \nbeta  \n  \nThis job is for Software Developers who design, code, test, & deploy features, conduct R&D, & support users remotely. You might like this job because it offers a mix of coding & helping users.  \n  \nRM 3000 - RM 9000  \n  \nRemote, Selangor  \n  \nFull-Time  \n  \n**Job Description**  \n  \nNote: This is a remote work position.  \n  \n**Responsibilities**  \n  \nAs a Software Developer you will be required to:  \n  \n\n-   Design, code, test and deploy features for our products.\n-   Conduct R&D and have fun with POCs.\n-   Support users and customers in solving issues faced when using our products.\n-   Document and contribute learning materials to help users and customers.\n\nJob Requirements  \n  \n**Required Skills**  \n  \n\n-   B.S degree in Computer Science or relevant field of study.\n-   Comfortable in using Java technology for web-based applications, preferably in Apache Maven, Spring and Hibernate.\n-   Strong in HTML, CSS and JavaScript.\n-   Good database and SQL skills, especially MySQL.\n\nOptional, but Highly Desirable Experience  \n  \n\n-   Experience with Joget DX or similar products.\n-   Experience working with cross-browser behaviors and quirks.\n-   Experience in working in an agile development environment.\n-   Experience working with remote teams.\n-   Experience with subversion or git, continuous integration and deployment tools.\n-   Experience with unit testing.\n-   Experience with secure coding practices.\n-   Experience working with different OS and cloud platforms.\n-   Experience in mobile Android or IOS development.\n\n**Skills**  \n  \nEnglish Language  \n  \nComputer Science  \n  \n**Company Benefits**  \n  \nDigital Nomad  \n  \nBe a digital nomad and work from home or anywhere you choose.  \n  \nLearn and Grow  \n  \nWe encourage continuous learning and will fund your professional growth.  \n  \nFlexible Work Hours  \n  \nWe are task oriented and offers flexible working hours.  \n  \nAdditional Info  \n  \nCompany Activity  \n  \nLast active - few minutes ago  \n  \nExperience Level  \n  \n0 - 7 Years of Experience  \n  \nCareer Level  \n  \nJunior Executive  \n  \nJob Specialisation  \n  \nCybersecurity / Network Security, Data Science & Analytics, Hardware / Network / Infrastructure (On-Premises / Cloud)  \n  \nCompany Profile  \n  \nJoget Technology Sdn. Bhd. (Joget, Inc.)  \n  \nWHO IS JOGET? WHAT IS JOGET DX? We are the team behind the Joget DX commercial open source project, a no-code/low-code web platform that modernizes application development and workflow automation on the cloud and mobile. With more than 40 partners and thousands of users globally, our products help small businesses, Fortune 500 companies, and government agencies to easily build and maintain enterprise apps.  \n  \nSimilar Jobs You Might Like  \n  \nSoftware Developer Intern  \n  \nInternship  \n  \nJoget Technology Sdn. Bhd. (Joget, Inc.)  \n  \nJr Frontend Software Developer  \n  \nInternship  \n  \nGravitas Digital  \n  \nSoftware Developer (Backend)  \n  \nFull-Time  \n  \nPaidchain Sdn Bhd  \n  \nSoftware Developer (Frontend)  \n  \nFull-Time  \n  \nPaidchain Sdn Bhd  \n  \nInternship - Software Developer  \n  \nInternship  \n  \nAllgo Technologies Sdn Bhd  \n  \nSoftware Developer  \n  \nFull-Time  \n  \nMalcan Technologies",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "Radius",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-radius-4139649941?position=3&pageNum=0&refId=tFo4BH%2F7BuYauBwg2pMCLA%3D%3D&trackingId=mrvKJs%2Fghl9pD6iPlSAJiA%3D%3D",
    "description": "**Role Description:**  \n  \nAs a Software Engineer ( Android ), you will be responsible for architecting and developing cutting-edge features in native Android app for RadiusAgent. An ideal candidate will have prior experience in developing messaging and/or social networking features.  \n  \n**Responsible for-**  \n  \n\n-   You will collaborate with cross-functional teams to define, design, and ship new features\n-   You will work with outside data sources and API’s\n-   You will unit-test code for robustness, including edge cases, usability, and general reliability\n-   you will be working on bug fixing and improving application performance\n-   You will continuously discover, evaluate, and implement new technologies to maximize development efficiency\n-   You will be working with remote data via REST and JSON\n-   You will be working on android development and android SDK development\n\n**Expectation-**  \n  \n\n-   3+ years of relevant development experience in Android development\n-   1+ years of professional development experience in Jetpack Compose\n-   Experience working in Real Estate industry will be a bonus\n-   Strongly adhering to Mobile principles, Coding standards, Design patterns\n-   Ability to work autonomously and to be able to work cross-functionally with multiple stakeholders\n\n**This is a work from office role**  \n  \nAbout Radius:  \n  \nRadius is the pioneering force in revolutionizing the real estate industry. As an innovative partner for growth, we provide a tailored ecosystem of cutting-edge technology, compliance support, services, and networking. With our platform, brokerages can level up their operations, launch their own brokerage, or join top-performing teams. Our unrivaled offering ensures seamless transactions, boosts productivity, and fosters long-term success. Backed by a 99% retention rate, 370% annual brokerage growth, and an expansive network of over 85,000 agents, Radius Brokerage Platform is the go-to solution for professionals seeking to excel in the real estate sector. Discover the future of real estate with Radius and unlock limitless potential.  \n  \nPowered by JazzHR  \n  \nJY36N6uK4F",
    "created_at": "2025-01-31 13:30:13.615703+00"
  },
  {
    "companyName": "Abbott",
    "externalUrl": "https://in.linkedin.com/jobs/view/mobile-software-engineer-ii-at-abbott-4139650436?position=44&pageNum=0&refId=p3t8NU%2FqzOxIG4F9ilHHHw%3D%3D&trackingId=QW5aVdxN7kJo6xcqDoUZ8g%3D%3D",
    "description": "**What You’ll Do**  \n  \n\n-   Work on verification and validation test designs, test scripts and test execution for CRM’s mobile software on Android and iOS platforms. Ensuring that all product development conforms to design specifications and coding standards for medical devices.\n-   Design and implement test scripts in programming languages such as C#, C++, Java and/or Python. Demonstrate good understanding and application of object-oriented programming principles per Abbott’s quality system practices and policies.\n-   Define and execute automation testing and integration testing strategy for one or more components and/or features.\n-   Ensure traceability and compliance of code implementation with software requirements.\n-   Contribute to assessment on existing designs for new or changing requirements.\n-   Develop, maintain, and enhance verification and validation test artifacts including test plans and strategies, test protocols and interfaces, and implementing, troubleshooting, and maintaining automated, semi-automated and scripts. Estimate, prioritize, plan and coordinate testing activities.\n-   Setup and configure test equipment including devices, test servers and tools. Troubleshoot and resolve issues with test setups to ensure this does not impact test execution and results.\n-   Develop a good understanding of the business requirements, customer workflows, data interfaces and product behavior prior to developing test designs and test scripts.\n-   Participate in gathering and analysis of debug information towards finding the root cause of issues encountered with the mobile software and/or test code.\n-   Participate in assessment, evaluation and deployment of new tools and test frameworks for mobile software testing.\n-   Assist in the evaluation of selected designs as required through testing and full documentation of the results.\n-   Work on problems of moderate scope where analysis of situations or data requires evaluation of identifiable factors.\n-   Exercise judgment within defined procedures and practices to determine appropriate action.\n-   Ensuring that standards and safety regulations are observed. Addressing and discussing issues and proposed solutions with superiors.\n-   Apply best QA practices to remove daily blockers.\n-   Comply with U.S. Food and Drug Administration (FDA) regulations, other regulatory requirements, Company policies, operating procedures, processes, and task assignments. Maintains positive and cooperative communications and collaboration with all levels of employees, customers, contractors, and vendors.\n\n**Required**  \n  \n**EDUCATION AND EXPERIENCE YOU’LL BRING**  \n  \n\n-   Bachelor’s Degree in Software engineering, computer science, or a related engineering field or an equivalent combination of education and work experience.\n-   Minimum of 3-4 year of relevant work experience in a range of software engineering disciplines using a variety of programming methods.\n-   Experienced using JIRA, Git, Jenkins, Appium, Selenium, and other QA related tools.\n-   Working knowledge of mobile software such as Xcode, Android studio, emulators, and simulators.\n-   Strong verbal and written communications with ability to effectively communicate at multiple levels in the organization.\n-   Able to handle difficult communication during the meetings and able to provide effective input.\n-   Experience with unit- and integration-level testing and automated testing.\n-   Experience working in a broader enterprise/cross-division business unit model preferred.\n-   Ability to work within a team and as an individual contributor in a fast-paced, changing environment.\n-   Multitasks, prioritizes and meets deadlines in timely manner.\n-   Strong organizational and follow-up skills, as well as attention to detail.",
    "created_at": "2025-01-31 13:00:14.852804+00"
  },
  {
    "companyName": "WebShar4.4",
    "externalUrl": "https://www.glassdoor.co.in/job-listing/senior-node-js-developer-webshar-JV_KO0,24_KE25,32.htm?jl=1009618895538",
    "description": "**Company Overview:  \n**  \n\nBased in California’s Silicon Valley, **WebShar** is dedicated to helping innovative teams\n\ntransform their ideas into reality. We offer cutting-edge software development consulting\n\nservices to companies across the globe, leveraging years of technical expertise and industry\n\nexperience. WebShar’s team excels in modern software development methodologies,\n\nempowering organizations to create state-of-the-art software solutions tailored to their needs.\n\n**Job Title- Senior Node.js Developer**\n\n**Job Description:**\n\nWe are seeking a **Senior Node.js Developer** with a passion for building high-performance\n\nmobile applications on both iOS and Android platforms. You will be responsible for\n\narchitecting, developing, and maintaining these applications, as well as collaborating with\n\nother teams to ensure a seamless integration of product infrastructure. This role requires a\n\nhighly collaborative individual who is detail-oriented and committed to delivering\n\nexceptional products.\n\n**Location**: Remote\n\n**Job Type**: Full-time\n\n**Experience**: 5-6 Years\n\n**Key Duties and Responsibilities:**\n\n-   Lead and oversee software projects, serving as a **Technical Leader** or **Lead**\n\n**Software Engineer**.\n\n-   Take full responsibility for product development, ensuring the delivery of high-\n\nquality solutions within deadlines.\n\n-   Design and develop solutions by analyzing problems using **Node.js**, **Express.js**., or\n\nother relevant languages.\n\n-   Knowledge of **Go** and experience with **Go-based** solutions.\n\n-   Familiarity with **GraphQL** and its implementation in different environments.\n\n-   Adhere to coding standards, software development methodologies, and release\n\nprocesses.\n\n-   Utilize tools like configuration management systems, build processes, and debuggers.\n\n-   Create and implement designs for new functionalities and maintain existing features.\n\n-   Add value by participating in peer code reviews and providing constructive feedback.\n\n-   Provide reliable solutions to complex problems through sound technical analysis and\n\nproblem-solving.\n\n-   Perform **root cause analysis** and outline corrective actions when necessary.\n\n-   Mentor and guide junior software engineers, fostering a collaborative and growth-\n\noriented environment.\n\n-   Demonstrate a strong sense of urgency, commitment, and focus on priorities to ensure\n\ntimely delivery of solutions.\n\n-   Review technical documentation, manuals, and brochures for accuracy.\n\n-   Collaborate in product definition activities, including **feature analysis** and **system**\n\n**trade-offs**.\n\n**Requirements:**\n\n-   5-6 years of relevant work experience.\n\n-   **BS** or higher degree in **Computer Science** or related fields.\n\n**What We Offer:**\n\n-   Competitive salary and benefits package.\n\n-   A collaborative environment with opportunities for growth and career advancement.\n\n-   Chance to lead and mentor a talented team while working on impactful projects.",
    "created_at": "2025-01-31 13:01:03.002721+00"
  },
  {
    "companyName": "Capgemini",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-4-to-6-years-pune-at-capgemini-4139642254?position=8&pageNum=0&refId=p3t8NU%2FqzOxIG4F9ilHHHw%3D%3D&trackingId=xD0x%2FQLTGAHwdORPboxpaw%3D%3D",
    "description": "**Job Description**  \n  \nExperience on Android(Kotlin/Java/Jetpack) based mobile applications development.  \n  \n\n-   Strong command on Android. Exposure towards Android SDK and different versions of it.\n-   Good Kotlin exposure, Knowledge of Jetpack, architectural components, Coroutines, Hilt etc are preferred.\n-   Exposure to android design patterns, MVP, MVVM(Kotlin, Java) is preferred.\n-   Strong knowledge of the various packages on the Android App development stack like layouts, intents, widgets, content providers, location services, network, storage, security/cryptography, sqlite, etc.\n-   Good understanding and exposure to Reactive programming RxAndroid & Dependency Injection framework like Dagger2\n-   Knowledge of web services integration and serialization techniques like REST, SOAP, XML, JSON.\n-   Strong penchant for Object Oriented Design and CS fundamentals\n-   Experience of working with android build system, version control, bug tracking, continuous integration and other productivity enhancement software like Jira etc.\n\nPrimary Skill  \n  \n\n-   Experience in developing unit tests and UI tests using JUnit, Mockito, Espresso respectively.\n-   Prior experience in working in Agile software methodologies\n-   Taking responsibility and ownership in the team's work, team player and good communication skills.\n\nSkills (competencies)",
    "created_at": "2025-01-31 13:00:14.852804+00"
  },
  {
    "companyName": "We Digital Services",
    "externalUrl": "https://ar.linkedin.com/jobs/view/mobile-application-developer-at-we-digital-services-4139243213?position=43&pageNum=0&refId=Z2ZK3QzGqaJ6ds1%2Fdvh%2B%2FQ%3D%3D&trackingId=g%2FSuej4qdWW63yda1XsW6g%3D%3D",
    "description": "At **WE Digital Services**, we are looking for a talented **Full-Stack Mobile App Developer** to take charge of the entire mobile app development process. As a **full-stack developer**, you will **design, develop, and maintain** software products that meet or exceed our clients' expectations. Your goal will be to **bridge the gap between the user interface (UI) and back-end data processing**, ensuring seamless integration, high performance, and overall efficiency.\n\n  \n\n**For This Role, You Will Need:**\n\n🔹 **3+ years of demonstrable experience** as a Full-Stack Developer, with expertise in both front-end and back-end development.\n\n🔹 **Proficiency in React Native or Flutter** for cross-platform mobile development.\n\n🔹 **Strong front-end development skills**, including experience with JavaScript, React, Vue.js, and Bootstrap.\n\n🔹 **Solid back-end programming experience**, including knowledge of Django, Python, and RESTful APIs.\n\n🔹 **Proficient with databases**, such as MySQL and PostgreSQL.\n\n🔹 **Experience deploying apps** on both iOS and Android platforms.\n\n🔹 **Strong problem-solving skills** and the ability to adapt to new technologies quickly.\n\n🔹 **Excellent communication and teamwork abilities** to collaborate with designers and developers.\n\n🔹 **Ability to work independently** and manage multiple tasks efficiently.\n\n🔹 Familiarity with **Agile methodologies** and **test-driven development** best practices.\n\n🔹 **Intermediate English level**, both spoken and written, as the role involves working with an overseas team.",
    "created_at": "2025-01-31 10:57:16.118757+00"
  },
  {
    "companyName": "KOHLER India",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-lead-at-kohler-india-4139654095?position=10&pageNum=0&refId=X8smnh5lI4ONVx01dc3QIg%3D%3D&trackingId=UbvRdhAEkcfVn5AGymsKZA%3D%3D",
    "description": "Technical Skills  \n  \n\n-   10 – 14 years of experience with native Android.\n-   Should have hands-on experience on CICD\n-   Should have ability to review the code efficiently\n-   Should have ability to design a scalable Architecture\n-   Java, Kotlin, Android Studio and related SDKs\n-   Experience in developing IoT applications is a must\n-   In-depth knowledge of MQTT, WiFi, and BLE / Bluetooth protocol is a must. Basic knowledge about RS232 & RS 485 Protocol\n-   In-depth knowledge of MVVM Architecture. Knowledge of Clean Architecture will be an advantage.\n-   Good knowledge of Object-Oriented Analysis and Design, Software Design Patterns and coding principles\n-   Experience in device flashing and firmware update process.\n-   Proven experience in an Individual Contributor role and leading dev teams.\n-   Experience developing RESTful micro-service-based applications.\n-   Experience in App performance analyzing tools: Crashlytics / pro-gaurd / Sonar etc.\n-   Demonstrable experience in developing Android apps and deploying them to play stores.\n-   Flutter & Cloud experience will be an advantage.",
    "created_at": "2025-01-31 14:00:14.043577+00"
  },
  {
    "companyName": "Invia Travel Germany GmbH",
    "externalUrl": "https://de.linkedin.com/jobs/view/flutter-app-developer-m-f-d-e-commerce-ab-in-den-urlaub-at-invia-travel-germany-gmbh-4115160057?position=47&pageNum=0&refId=MJV0fpY6TikZNk9HiWUZ0A%3D%3D&trackingId=Q3di2sDUH70eUEMsj%2BG96g%3D%3D",
    "description": "**Invia Group** is a pan-European market leader in online travel sales and brings together leading travel portals in Europe under one roof. From package holidays to tailored tours, from business trips to family breaks, our offers for tourists serve a wide range of target groups.\n\n  \n\nOur diverse team of Invianers work together in 5 countries: Germany, Czech Republic, Poland, Slovakia and Hungary. Among others, Invia Group operates the portals **ab in den urlaub, invia.cz, travelplanet.pl, invia.hu.**\n\n  \n\nJoin our team as a **Flutter App Developer (m/f/d**) and play a pivotal role in shaping the future of our travel business! As a key pillar of our strategic vision, mobile apps are at the forefront of delivering exceptional user experiences. If you're passionate about Flutter development and ready to contribute to the seamless customer journey of our customers, this is the opportunity you've been waiting for. Join us in revolutionizing the travel industry through cutting-edge mobile applications\n\n  \n\nYour Tasks\n\n-   Develop and maintain our **ab in den urlaub** mobile apps using Flutter framework.\n-   Design and implement solutions that ensure optimal performance and aesthetics for both Android and iOS.\n-   Writing clean, efficient and well-structured code to find the most appropriate technical solutions for various requirements.\n-   Utilise BLOC patterns or other state management solutions to efficiently manage app state.\n-   Familiar with CI/CD (Continuous Integration/Continuous Deployment) processes to ensure smooth app delivery and updates.\n-   Collaborate with our development team to build a high quality and robust IT architecture for our applications.\n\n  \n\nYour Profile\n\n-   You have a degree in Computer Science or comparable training in the IT sector.\n-   You have at least 4 years of practical experience in mobile application development.\n-   You have knowledge of Flutter to create powerful and visually appealing cross-platform solutions.\n-   You have experience of developing Android and/or iOS apps using Flutter that has been published to the Google Play Store or App Store.\n-   You have experience working with various frameworks, interfaces and version control systems.\n-   You are familiar with mobile development architectures, current trends and technologies.\n-   You have a good understanding of the full mobile development lifecycle\n-   You are inclined to write extensive tests to ensure the functionality and stability of the app.\n-   You combine analytical thinking with a practical, hands-on approach and can identify situations where pragmatic solutions are appropriate.\n-   You have good communication skills in English, both written and verbal.\n\n  \n\nWhat we offer\n\n-   **Reliability**: unlimited full-time employment contract\n-   **More time for yourself**: 30 days of paid leave (+ additional vacation for long term employees)\n-   **Appreciation**: anniversary program for your loyalty\n-   **Work-Life-Balance**: Flexible working hours, mobile working throughout Germany and, for a limited time, abroad\n-   **But also an attractive location**: offices close to the city centre with excellent transport infrastructure in Leipzig\n-   **Creative space:** room for creativity, proactivity, and responsibility\n-   **Team spirit**: regular company and team events\n-   **Well-being**: guaranteed monthly allowance towards your lunch\n-   **A smoother journey to work**: allowance for the ‚Deutschlandticket‘ and the posibility of a ‚JobRad‘\n-   **Healthy well**\\-**being**: Allowance for company fitness\n\n  \n\nYour trip to us\n\nSimply Apply via our careers page and send us your CV, your availability and your salary expectations. As part of the application process, we are obliged as a company to view and check your work permit, your ID card or your passport to ensure that you are entitled to work for us. It must also be possible to check that you are authorised to start an employment relationship with us. Please make sure that you can provide the required documents if needed. Applications from disabled persons and persons with equivalent status are welcome. If you have any questions about this position and your application, you can reach us at +49 173 3266099 and +49 172 3580739.",
    "created_at": "2025-01-31 14:30:13.855063+00"
  },
  {
    "companyName": "Teqlawn",
    "externalUrl": "https://www.glassdoor.co.in/job-listing/android-developer-teqlawn-JV_KO0,17_KE18,25.htm?jl=1009620067856",
    "description": "We are seeking a highly skilled Android Developer with 4+ years of experience to join our team in a full-time, permanent role. The ideal candidate will be responsible for designing, developing, and maintaining high-performance, user-friendly Android applications that meet modern development standards. This is a remote position with a competitive salary and an opportunity to work on innovative mobile projects.\n\nKey Responsibilities:\n\n-   Develop, enhance, and maintain feature-rich Android applications using Java/Kotlin.\n-   Work collaboratively with UI/UX designers to create intuitive and responsive user experiences.\n-   Write clean, efficient, and well-structured code following best practices in Android development.\n-   Debug, troubleshoot, and optimize application performance and stability.\n-   Integrate APIs and manage seamless data flow with backend services.\n-   Perform thorough testing to ensure app functionality across various devices and Android versions.\n-   Keep up with the latest Android technologies, trends, and best practices.\n\nRequirements:\n\n-   4+ years of experience as an Android Developer.\n-   A strong portfolio showcasing published or personal Android projects.\n\nNote: Please share your portfolio and Play Store link while submitting your application.\n\nJob Types: Full-time, Permanent\n\nPay: ₹80,000.00 - ₹120,000.00 per month\n\nBenefits:\n\n-   Work from home\n\nSchedule:\n\n-   Day shift\n-   Monday to Friday\n\nExperience:\n\n-   Android Development: 4 years (Required)\n\nWork Location: Remote",
    "created_at": "2025-01-31 14:31:01.063756+00"
  },
  {
    "companyName": "Contentsquare",
    "externalUrl": "https://fr.linkedin.com/jobs/view/staff-mobile-software-engineer-mobile-analysis-at-contentsquare-4139140303?position=17&pageNum=0&refId=MJV0fpY6TikZNk9HiWUZ0A%3D%3D&trackingId=J7G7tpDMnr3zLAEv8P3dIA%3D%3D",
    "description": "Contentsquare is the all-in-one experience intelligence platform designed to be easily used by anyone that cares about digital journeys. With our flexible and scalable platform, organizations quickly get a deep understanding of their customers’ whole online journey.  \n  \nWe are a global leader in the experience analytics space, having secured $1.4 billion in funding and expanded to 15 offices worldwide. We’re here to stay—and we’re looking for team members that can help us further our growth.  \n  \nOur aim is to create an inclusive workplace where everyone learns and succeeds. Contentsquare has built a community of individuals who are daring, understanding, and deliberate. We invite you to join us in making the complex simpler—for our customers, their customers, and each other.  \n  \n_Important note: be careful of scammers pretending to be from Contentsquare. We will never ask for money or contact you through random texts. For more information, visit our careers blog.  \n  \n_Join our Engineering department as a Senior Staff Software Engineer focusing on Mobile/SDK development, where you will develop and enhance Contentsquare's Mobile technical vision, de-risk its delivery, and directly support its business. This position could be remote in Spain, France, the UK, Germany & Italy, or hybrid/office-based in Paris or Barcelona.  \n  \nYou'll be working on our Mobile Experience Analytics, deployed across mobile platforms, namely iOS (Swift/Objective-C), Android (Kotlin/Java), and cross-platform frameworks (React Native/Flutter) leveraging several UI toolkits (UIKit, SwiftUI, Android view, Jetpack Compose). You will participate in the design, implementation, and optimization of high-performance Contentsquare SDK applications, working within a dynamic team that pushes the boundaries of Mobile experience analytics (Screen Insights, Session Replay, Errors & Crashes, Feedback…), to deliver light and efficient solutions that will be easy to implement and to use solutions for our clients.  \n  \n**What you will do:**  \n  \n\n-   Technical Leadership & Business Orientation:\n-   Provide architectural direction and guidance for developing mobile applications matching business requirements and/or unlocking business opportunities.\n-   Leverage business acumen and domain expertise to design scalable, maintainable, and high-quality solutions across Mobile frameworks\n-   Drive best practices in mobile development, including code quality, testing, and automation.\n-   Application Development:\n-   Lead the end-to-end development lifecycle, from concept to deployment and maintenance.\n-   Ensure mobile applications are optimized for performance and usability.\n-   Collaborate with product managers, designers, and backend & web engineers to align technical solutions with business goals.\n-   Mentorship & Collaboration:\n-   Act as a mentor to junior and mid-level engineers, fostering professional growth and technical excellence.\n-   Facilitate knowledge sharing through code reviews, design discussions, and technical documentation.\n-   Build a culture of collaboration and continuous learning.\n-   Innovation & Problem-Solving:\n-   Stay up to date with emerging trends and technologies in mobile development.\n-   Identify and implement tools and frameworks to improve development efficiency.\n-   Troubleshoot and resolve complex technical challenges promptly.\n-   Proactively identify and implement strategies to reduce incident impact and detection time, ensuring the reliability and efficiency of our SaaS applications.\n\n**What you will need to succeed:**  \n  \n\n-   Expected Qualifications:\n-   Bachelor’s or Master’s degree in Computer Science, Engineering, or related field, or equivalent practical experience.\n-   8+ years of professional experience in mobile application development.\n-   Expertise with multiple mobile platforms: iOS (Swift/Objective-C), Android (Kotlin/Java), or cross-platform frameworks (React Native/Flutter).\n-   Expertise with applications published on the App Store and Play Store\n-   Strong knowledge of mobile architecture patterns and UI toolkits (UIKit, SwiftUI, Android view, Jetpack Compose)\n-   Proven experience with API integration, asynchronous programming, and offline-first applications.\n-   Familiarity with mobile DevOps practices, including CI/CD pipelines for mobile apps.\n-   String troubleshooting and debugging, performance optimization, and problem-solving skills.\n-   Bonus relevant experiences:\n-   Contributions to open-source projects or active involvement in developer communities (such as meetups)\n-   Knowledge of security best practices for mobile applications.\n-   Required soft Skills:\n-   Strong leadership, decision-making, and communication skills.\n-   Ability to manage competing priorities in a fast-paced environment.\n-   A passion for mentoring and empowering team members.\n-   Collaborative mindset and a commitment to high-quality software delivery.\n\n**Why you should join Contentsquare**  \n  \nWe invest in our people through career development, mentorship, social events, philanthropic activities, and competitive benefits. We are always assessing the perks we offer to ensure we’re aligned with the employees' needs.  \n  \nHere are a few we want to highlight:  \n  \n\n-   Virtual onboarding, Hackathon, and various opportunities to interact with your team and global colleagues both on and offsite each year\n-   Work flexibility: hybrid and remote work policies\n-   Generous paid time-off policy (every location is different)\n-   Immediate eligibility for birthing and non-birthing parental leave\n-   Wellbeing and Home Office allowances\n-   A Culture Crew in every country we’re based in to coordinate regular activities for employees to get to know each other and bond outside of work\n-   Every full-time employee receives stock options, allowing them to share in the company’s success\n-   We have multiple Employee Resource Groups, that offer a safe space for individuals who share common identities, life experiences, or allyship to connect, support one another, and passionately advocate for the issues close to their hearts\n-   And more benefits tailored to each country\n\n_Contentsquare is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law.  \n  \n__Your personal data is used by Contentsquare for recruitment purposes only. Read our_ _Job Candidate Privacy Notice_ _to find out more about data protection at Contentsquare and your rights. You can exercise your rights by using our dedicated Data Subject Rights Portal_ _here_ _.  \n  \n__Your personal data will be securely stored in our hosting provider’s data center in Oregon (US west). We have implemented appropriate transfer mechanisms under applicable data protection laws._",
    "created_at": "2025-01-31 14:30:13.855063+00"
  },
  {
    "companyName": "Teqlawn",
    "externalUrl": "https://www.glassdoor.co.in/job-listing/react-native-developer-teqlawn-JV_KO0,22_KE23,30.htm?jl=1009620088387",
    "description": "We are looking for an experienced React Native Developer with 4+ years of expertise to build high-quality, cross-platform mobile applications for both Android and iOS platforms. The ideal candidate will have strong experience in React Native, JavaScript/TypeScript, and integrating third-party APIs. This is a remote, full-time position with a competitive salary.\n\nKey Responsibilities:\n\n-   Design, develop, and maintain cross-platform mobile applications using React Native for both Android and iOS.\n-   Collaborate with UI/UX designers to deliver user-friendly, responsive, and visually appealing interfaces.\n-   Write clean, efficient, and maintainable JavaScript/TypeScript code following best practices.\n-   Debug, troubleshoot, and optimize applications for maximum performance.\n-   Integrate third-party APIs and ensure seamless data management between front-end and back-end.\n-   Perform rigorous testing to deliver bug-free, robust applications across platforms.\n\nRequirements:\n\n-   4+ years of experience as a React Native Developer.\n-   A strong portfolio showcasing published or personal mobile applications.\n\nNote: Please share your portfolio and Play Store/App Store link with your application.\n\nJob Types: Full-time, Permanent\n\nPay: ₹80,000.00 - ₹120,000.00 per month\n\nBenefits:\n\n-   Work from home\n\nSchedule:\n\n-   Day shift\n-   Monday to Friday\n\nExperience:\n\n-   React Native: 4 years (Required)\n\nWork Location: Remote",
    "created_at": "2025-01-31 15:01:01.18932+00"
  },
  {
    "companyName": "TeaCode.io",
    "externalUrl": "https://pl.linkedin.com/jobs/view/junior-mobile-developer-at-teacode-io-4139661965?position=21&pageNum=0&refId=PokO8KwkoDpNkQvGGGvpvQ%3D%3D&trackingId=NlaTNPd%2BR0%2BlaH6XofyxeA%3D%3D",
    "description": "**Pay rate:** 40 - 65 zł/h  \n  \n**Type of agreement:** B2B contract, contract of mandate  \n  \n**Type of work:** remote  \n  \nAre you passionate about technology and eager to grow your skills in a dynamic environment? At TeaCode, we are looking for a motivated **Junior Mobile Developer** to join our innovative team.  \n  \nYou will work on an **innovative fitness app** that transforms traditional street games into a gamified, interactive experience. The app leverages precise location tracking to guide players to check-in points, collect points, and compete in teams.  \n  \nA key feature is **NFC support**, allowing users with NFC cards to participate easily. The goal is to create an engaging, inclusive experience that promotes family bonding, physical activity, and outdoor fun. You will be responsible for developing new features, optimizing performance, and ensuring a seamless user experience across both iOS and Android.  \n  \nThis is an exciting opportunity to work on a tech-driven fitness solution that encourages an active lifestyle through digital innovation.  \n  \n**Key Responsibilities**  \n  \n\n-   Collaborate directly with the CTO to plan and develop new features\n-   Work with IoT technologies, including NFC and location-based services\n-   Contribute to the development of the mobile application\n-   Assist in optimizing and improving marketing campaigns using Amazon PinPoint\n-   Participate in code reviews and continuous learning to enhance development skills\n-   Stay up to date with mobile development best practices and emerging technologies\n\n**Requirements**  \n  \n\n-   First experience in mobile app architecture and development in a Typescript/Javascript environment\n-   Knowledge and commercial experience in Typescript, React Native\n-   Experience in releasing/publishing mobile apps on Google Play and Apple App Store\n-   Experience in AWS would be a big advantage\n-   English at C1 level or higher\n-   Proficiency in Polish\n-   Good communication skills are a must\n-   Self motivation, willingness to learn new things and positive attitude to change\n-   Teamwork skills\n\n**What We Offer**  \n  \n\n-   A collaborative and supportive work environment\n-   Opportunities for professional growth and skill development\n-   Engaging projects that challenge your creativity and technical expertise\n-   Macbook equipment to work on\n-   Coworking office space in a vibrant location of Warsaw\n\n**Recruitment Process**  \n  \n\n-   Intellectual capabilities test (1 hour)\n-   HR interview with a Talent Acquisition Specialist (30 minutes)\n-   Technical interview: live coding session (1 hour)\n-   Final interview with the Head of Delivery (1 hour)\n-   Decision\n\n**About Us**  \n  \n\n-   We are a software house based in Warsaw with over 50 people on board\n-   We work in one programming language → JavaScript/TypeScript\n-   We have clients from all over the world\n-   We are really flexible in working hours\n-   The atmosphere within the team is our great value",
    "created_at": "2025-01-31 15:00:14.642538+00"
  },
  {
    "companyName": "KarrFund",
    "externalUrl": "https://ma.linkedin.com/jobs/view/mobile-application-developer-at-karrfund-4139668329?position=14&pageNum=0&refId=PokO8KwkoDpNkQvGGGvpvQ%3D%3D&trackingId=ZAQxPGwK%2FP%2F1Vjs7zBLbrQ%3D%3D",
    "description": "**Company Description**  \n  \nA supper-app for nonprofit organizations.  \n  \n**Role Description**  \n  \nThis is a full-time remote role for a Mobile Application Developer at KarrFund. The Mobile Application Developer will be responsible for developing and maintaining mobile applications using object-oriented programming (OOP) for iOS & Android platforms.  \n  \n**Salary**  \n  \n30,000dhs/mois  \n  \n**Qualifications**  \n\n-   Mobile Application Development and Application Development skills\n-   Experience in IOS & Android Development\n-   Proficiency in Object-Oriented Programming (OOP)\n-   Strong problem-solving abilities\n-   Ability to work independently and remotely\n-   Ability to work with the creative team\n-   Background in Marketing or related field",
    "created_at": "2025-01-31 15:00:14.642538+00"
  },
  {
    "companyName": "Blazity",
    "externalUrl": "https://pl.linkedin.com/jobs/view/mobile-developer-part-time-at-blazity-4139663804?position=5&pageNum=0&refId=PokO8KwkoDpNkQvGGGvpvQ%3D%3D&trackingId=6%2BZyRsMBIH74AIZdz96lxA%3D%3D",
    "description": "At **Blazity**, we are a team of **React.js** and **Next.js** experts focused on creating **API-first products**. We build long-term partnerships with our clients, serving as their trusted development partners. Our work involves optimizing apps, stores, and websites, implementing new features, and automating workflows to deliver outstanding results.  \n  \nLooking for your next adventure? As it’s often said, you must gather your party before venturing forth – why not join ours? 😊  \n  \n**Our Requirements**  \n  \n\n-   Proven experience in mobile SDK development for iOS and Android.\n-   Expertise in Java (for Android) and Swift (for iOS).\n-   Hands-on experience working with existing, legacy codebases.\n-   Strong background in SDK development and customer support.\n\n**Scope Of Responsibilities**  \n  \n\n-   Maintaining and supporting existing mobile SDKs (iOS and Android).\n-   Working with Java (Android SDK) and Swift (iOS SDK).\n-   Working on push notification infrastructure\n-   Availability approx. 20 - 30 hours per month\n\n**What We Offer**  \n  \n**What Makes Us Special?**  \n  \n📈 Our team has a genuine impact on the company’s decisions and direction.  \n  \n✨ No bureaucracy – we keep things simple and efficient.  \n  \n🗺️ 100% remote work from Poland  \n  \n⏳ Flexible working hours – fit your schedule to your life.  \n  \n🍕 Fun social events to connect with your teammates.  \n  \n🤝 We value feedback and foster an open, supportive environment.  \n  \n**Salary ranges**  \n  \nB2B: 90 - 145 PLN/h  \n  \n**Location**  \n  \n100% remote from Poland",
    "created_at": "2025-01-31 15:00:14.642538+00"
  }
]