[
  {
    "companyName": "Adobe",
    "externalUrl": "https://builtin.com/job/software-development-engineer-3-android/3863247",
    "description": "As a Software Development Engineer 3, you will design, create, and maintain features within Adobe Experience Platform's Mobile SDKs and enterprise mobile apps. You will work in a full DevOps environment, collaborate with various teams, and innovate new mobile experiences utilizing Android, iOS, and other platforms.\n\nSummary Generated by Built In\n\n**Our Company**  \nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.   \nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\n\n  \n \n\nThe Adobe Experience Cloud (https://www.adobe.com/experience-cloud.html) is a USD 3B+ business serving the needs of enterprise businesses including 95%+ of fortune 500 organizations.\n\nAdobe Journey Optimizer (AJO) within Experience Cloud provides a platform for designing cross-channel customer experiences and provides an environment for visual campaign orchestration, real time interaction management and cross channel execution. It is built natively on the Adobe Experience Platform and combines a unified, real-time customer profile, an API-first open framework, centralized offer decisioning, and artificial intelligence (AI) and machine learning (ML) for personalization and optimization.\n\nWe are seeking an experienced full time **Android Engineer** to join the \"Mobile Experience team\" and contribute to mobile SDKs that allow customers to craft interactive experiences in their mobile apps. These SDKs are embedded in the mobile apps of many Fortune 500 companies and other large businesses. At Adobe, we process billions of hits per week from these mobile apps.\n\nBeyond the usual responsibility of designing, developing, documenting, and thoroughly testing code, Computer Scientists @ Adobe would own features of varying complexity, which may require understanding interactions with other parts of the system, moderately sophisticated algorithms and good design judgment.\n\nFor this, we are looking for strong and passionate engineers to join our team as we scale the business by building the next gen capabilities and adding new value to our existing offerings!\n\n****What you'll do****\n\nThis is an individual contributor position. Expectations will be on the below lines:\n\n-   Work with a team of engineers to Design, Create and Maintain features in our Adobe Experience Platform Mobile SDKs and enterprise mobile apps using the Android/iOS/React Native/Flutter platform.\n-   Work in full DevOps mode, responsible for all phases of engineering. From early specs, design/architecture, technology choice, development, unit-testing/integration automation, and deployment.\n-   Continuously follow new trends in the marketplace and find ways to implement these in our mobile SDKs to provide customers more innovative ways to interact and engage with their users to create mobile experiences. You will help research and prototype new features to evaluate them for inclusion.\n-   Collaborate with architects, product management and other engineering teams to build the technical vision and roadmap for the team.\n\n**Requirements**\n\n-   B.Tech / M.Tech degree in Computer Science from a premier institute.\n-   4+ years of proven experience in software development.\n-   Extensive knowledge of mobile platforms and mobile app development experience**.**\n-   Strong programming on Android platform/Kotlin/Java/Compose.\n-   Excellent computer science fundamentals. Good understanding of software design algorithms.\n\nAdobe is proud to be an Equal Employment Opportunity and affirmative action employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. Learn more.  \n \n\nAdobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email accommodations@adobe.com or call (408) 536-3015.\n\nAdobe values a free and open marketplace for all employees and has policies in place to ensure that we do not enter into illegal agreements with other companies to not recruit or hire each other’s employees.\n\nRead Full Description"
  },
  {
    "companyName": "UST",
    "externalUrl": "https://www.linkedin.com/jobs/view/android-developer-at-ust-4133455246?position=1&pageNum=0&refId=AiLGlqX5PJ3wN1T1csPGaA%3D%3D&trackingId=bV8H9B%2B2XhrmpuU%2FxkxJFg%3D%3D",
    "description": "**Role Description**  \n  \n**Android Developer**  \n  \n**Lead II - Software Engineering**  \n  \n**Who We Are**  \n  \nBorn digital, UST transforms lives through the power of technology. We walk alongside our clients and partners, embedding innovation and agility into everything they do. We help them create transformative experiences and human-centered solutions for a better world.  \n  \nUST is a mission-driven group of 29,000+ practical problem solvers and creative thinkers in more than 30 countries. Our entrepreneurial teams are empowered to innovate, act nimbly, and create a lasting and sustainable impact for our clients, their customers, and the communities in which we live.  \n  \nWith us, you’ll create a boundless impact that transforms your career—and the lives of people across the world.  \n  \nVisit us at UST.com.  \n  \n**You Are**  \n  \nWe are seeking a skilled android developer responsible for the development and maintenance of applications aimed at a vast number of diverse android devices. The primary focus will be the development of mobile applications and their integration with back-end services and browser apps. You will be working along-side other engineers and developers working on different layers of the infrastructure. The project portfolio contains various projects connected to mobile application development consuming existing APIs from partners, clients, etc.  \n  \n**The Opportunity**  \n  \n\n-   Designing and building mobile applications for android platform\n-   Collaborating with the design team to define app features and stories\n-   Ensuring quality and performance of the application to specifications and standards for android and the client\n-   Identifying potential problems and resolving application bottlenecks\n-   Fixing application bugs before the final release\n-   Collaborate with cross functional team to define and design the app\n-   Perform checks on correct functionality of app\n-   Integrate application with backend tools such as APIs and push notifications\n-   Responsible to help maintain code quality, organization and automation\n-   Work with a tech lead to maintain standards and code quality\n-   Collaboration with Android development team for unified approaches\n\nThis position description identifies the responsibilities and tasks typically associated with the performance of the position. Other relevant essential functions may be required.  \n  \n**What You Need**  \n  \n\n-   Proficiency in Kotlin and Jetpack Compose.\n-   Strong knowledge of android development frameworks\n-   Experience with offline storage, threading, and performance tuning.\n-   Familiarity with RESTful APIs to connect iOS applications to back-end services.\n-   Understanding and implementation of State Flow , Shared Flow data holder classes.\n-   Understanding and Usage of Coroutines and different scopes.\n-   Understanding of Googles design principles and interface guidelines with respect to UI components.\n-   Experience with performance and memory tuning with tools (such as Instruments, Accessibility Inspector).\n-   Understanding and implementing of Accessibility related to different views present on the UI.\n-   Familiarity with cloud message APIs and push notifications.\n-   Proficient understanding of code versioning tools (such as Git).\n-   Familiarity with continuous integration\n-   Hands-on experience with addressing Unit Testing and UI Automation Testing and Accessibility Testing.\n-   Understanding of Code Coverage and understanding of TDD approach\n-   Understanding of MVC, MVVM, MVP\n-   Knowledge of Google Analytics, Crashlytics, Firebase, Feature flag implementation using third party tools.\n-   Must-Have Skills:\n-   Proficient and knowledgeable in the following concepts (and related tools) - Android Frameworks, threading, android design principles, performance and memory tuning, integrating accessibility compliance as part of development, code versioning, TDD and Unit testing, mobile app design patterns, monitoring user behaviour, web traffic, performance and crash reporting.\n-   Kotlin, Jetpack compose, Git, Accessibility Inspector, MVVM, Google Analytics, Crashlytics, Firebase\n\nCompensation can differ depending on factors including but not limited to the specific office location, role, skill set, education, and level of experience. UST provides a reasonable range of compensation for roles that may be hired in various U.S. markets as set forth below.  \n  \n**Role Location: Remote**  \n  \n**Compensation Range:** $95,000-$143,750  \n  \n**Benefits**  \n  \nFull-time, regular employees accrue a minimum of 10 days of paid vacation per year, receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year), 10 paid holidays, and are eligible for paid bereavement leave and jury duty. They are eligible to participate in the Company’s 401(k) Retirement Plan with employer matching. They and their dependents residing in the US are eligible for medical, dental, and vision insurance, as well as the following Company-paid Employee Only benefits: basic life insurance, accidental death and disability insurance, and short- and long-term disability benefits. Regular employees may purchase additional voluntary short-term disability benefits, and participate in a Health Savings Account (HSA) as well as a Flexible Spending Account (FSA) for healthcare, dependent child care, and/or commuting expenses as allowable under IRS guidelines. Benefits offerings vary in Puerto Rico.  \n  \nPart-time employees receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year) and are eligible to participate in the Company’s 401(k) Retirement Plan with employer matching.  \n  \nFull-time temporary employees receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year) and are eligible to participate in the Company’s 401(k) program with employer matching. They and their dependents residing in the US are eligible for medical, dental, and vision insurance.  \n  \nPart-time temporary employees receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year).  \n  \nAll US employees who work in a state or locality with more generous paid sick leave benefits than specified here will receive the benefit of those sick leave laws.  \n  \n**What We Believe**  \n  \nWe proudly embrace the values that have shaped UST since day one. We build our culture of Humility, Humanity, and Integrity. These values inspire us to nurture a people-first, human centric culture that fosters diversity, prioritizes sustainable solutions, and keeps our people and clients at the forefront of all decisions.  \n  \n**Humility**  \n  \nWe will listen, learn, be empathetic and help selflessly in our interactions with everyone.  \n  \n**Humanity**  \n  \nThrough business, we will better the lives of those less fortunate than ourselves.  \n  \n**Integrity**  \n  \nWe honor our commitments and act with responsibility in all our relationships.  \n  \n**Equal Employment Opportunity Statement**  \n  \nUST is an Equal Opportunity Employer.  \n  \nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or any other applicable characteristics protected by law. We will consider qualified applicants with arrest or conviction records in accordance with state and local laws and “fair chance” ordinances.  \n  \nUST reserves the right to periodically redefine your roles and responsibilities based on the requirements of the organization and/or your performance.  \n  \n#UST  \n  \n#CB  \n  \n**Skills**  \n  \nAccessibility Inspector,kotlin,jetpack compose"
  },
  {
    "companyName": "HERE",
    "externalUrl": "https://builtin.com/job/sr-ps-consultant/3902030",
    "description": "The Senior Software Engineer will develop and maintain Android applications for automotive solutions, focusing on enhancing performance and quality, collaborating with stakeholders, and mentoring team members. Responsibilities include analyzing existing designs, improving software quality, and troubleshooting issues during testing and production phases.\n\nSummary Generated by Built In\n\n**What's the role?**  \n**Senior Software Engineer (ANDROID SOLUTIONS)** would be a part of the Solution Engineering and Maintenance Center of Excellence tasked with evolving and maintaining HERE Automotive SDK and associated services; solution that offers functionality on various domains: Routing, Rendering, Search, System, Traffic, Guidance used to enable in-car navigation use cases. We are searching for Lead Software Engineer with strong development skills to join our team.  \nWill be required to understand evolving business processes, responsible for developing, maintaining, and delivering Android applications (and customizations) with experience in modern programming languages for Android. Analysis of existing design / frameworks / processes and identifying improvement opportunities within the same. Cater to new demand to create engineering and delivery excellence for customer operations which caters to internal and external customers.  \nMust have good communication skills and be passionate about integration etc. especially with OEM platform.  \nMAIN RESPONSIBILITIES (essential functions - list in order of importance; 5-6 maximum)  \n\n-   Analyze, monitor and improve performance and quality of Android based embedded automotive solutions with UI\n-   Monitor and improve product quality assuring highest customer satisfaction.\n-   Maintain and increase code quality, while applying best engineering practices - Maintain a comprehensive understanding of the software system, actively participating in code reviews and development activities.\n-   Collaborate with stakeholders to understand and clarify requirements , understanding the business requirement to develop and maintain customized solutions for customer.\n-   Software Engineering - SDLC knowhow , Design and implement software systems and new solution designs for any enhancements and change requests.\n-   Troubleshoot issues that may arise during testing phase and in production phase and provide solutions.\n-   Mentor and guide team members as necessary.\n\n  \n**Who are you?**  \n**POSITION REQUIREMENTS** (MINIMUM EDUCATION, AMT. & TYPE OF WORK EXPERIENCE, SKILLS & COMPETENCIES REQUIRED TO PERFORM JOB COMPETENTLY)  \n\n-   Bachelor's Degree in Engineering or related discipline required or equivalent combination of relevant education and work experience\n-   5+ years of experience with substantial experience in embedded solution development projects\n-   Extensive experience in mobile development domain with Android\n-   Expertise in modern programming languages, technologies, and concepts, including object oriented design, design patterns, Kotlin or Flutter (SDK) / Dart\n-   Expertise with front end technologies - Javascript/TypeScript, React JS , Node JS\n-   Deep knowledge either on Linux and Android Open-Source Project (AOSP)\n-   Experience with Scrum/Kanban, Agile workflow methodologies , JIRA and Confluence , knowledge on SDLC\n-   Analytical approach and problem-solving skills and ability to lead detailed technical analysis\n-   Excellent collaborative skills as well as confidence in written and spoken English\n-   Having the following skills would be an added advantage:\n    -   Knowledge of location-based services such as mapping, navigation, GPS\n    -   Experience in working with embedded and/or automotive hardware test environments.\n    -   Experience developing HTTP REST services.\n    -   Knowledge on location or automotive specific industry standards, e.g., Navigation Data Standard (NDS), Transport Protocol Experts Group (TPEG)\n\n  \n**Who are we?**  \nHERE Technologies is a location data and technology platform company. We empower our customers to achieve better outcomes - from helping a city manage its infrastructure or a business optimize its assets to guiding drivers to their destination safely.  \nAt HERE we take it upon ourselves to be the change we wish to see. We create solutions that fuel innovation, provide opportunity and foster inclusion to improve people's lives. If you are inspired by an open world and driven to create positive change, join us. Learn more about us on our YouTube Channel.\n\nRead Full Description"
  },
  {
    "companyName": "Netflix",
    "externalUrl": "https://www.linkedin.com/jobs/view/software-engineer-l5-ads-platform-at-netflix-3983498007?position=7&pageNum=10&refId=wI8VgnLiU0R5JMpyizXy5Q%3D%3D&trackingId=onV8btwm0Bgi13iQ2kR2XA%3D%3D",
    "description": "Netflix is one of the world's leading entertainment services, with 283 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.  \n  \nWe launched a new ad-supported tier in November 2022 to offer our members more choice in how they consume their content. Our new tier allows us to attract new members at a lower price point, while also creating a compelling path for advertisers to reach audiences that are deeply engaged.  \n  \n**Our Team**  \n  \nThe Ads Platform Engineering teams build advertising systems and integrations that power the delivery of ads using our world-class content delivery ecosystem. We use a number of Netflix investments and innovations to power our ads - a unique mix of client and server-side ad insertions, state-of-the-art content delivery systems, ad encoding recipes, content understanding and metadata, etc. We deliver ads in a manner that’s thoughtful of our member’s viewing experience and drive great outcomes for advertisers. We also ensure that advertiser brand safety is ensured during serving, members only see the most appropriate ads for them.  \n  \nOur team is new and yet faced with the enormous ambitions of building highly performant advertising systems and delivering high impact to our business by monetizing our incredible slate of content. As one of the newest entrants in the Connected TV advertising space that’s rapidly growing, we seek to build unique value propositions that help us differentiate from the competition and become a market leader in record time.  \n  \nWe are looking for highly motivated engineers working in the advertising space who are excited to join us on this journey.  \n  \n**Skills & Experience We’re Seeking**  \n  \n\n-   Well-grounded domain experience in ANY ONE of these 4 areas :\n-   1- (Ad Delivery) Building publisher-side ad tech systems such as ad servers, bidders and pacers, yield optimizers, or their demand-side counterparts (DSPs).\n-   2 - (Identity and Audience Targeting) Built identity graphs, integrated with DMPs, and worked on enabling audience targeting, 1P or 3P segments.\n-   3 - (Measurement) Familiarity with brand lift measurement, incrementality-based measurement, outcomes measurement, etc.\n-   4 - (Sales Enablement) Guaranteed and non-guaranteed inventory reservations and management, Sales tooling, Integrations with OMS, CRM systems, etc.\n-   General understanding of the advertising marketplace and landscape.\n-   Worked closely with ad operations to enable campaign setup, targeting, reporting, and advertiser needs.\n-   Developed many cloud-based applications and comfortable with modern programming languages (preferably object-oriented).\n-   Familiar with A/B testing and experimentation.\n\n**Nice To Haves**  \n  \n\n-   Contributed to an ads industry technology standard (e.g VAST, OpenRTB) or worked on an industry consortium effort, working group etc.\n-   Familiarity with legal compliance and changing landscape of ads regulations around the world.\n-   Experience working in the CTV space and knowledge of it’s unique constraints\n\n**More About Netflix**  \n  \nGenerally, our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000-$720,000  \n  \nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.  \n  \nNetflix is a unique culture and environment. Learn more here.  \n  \nInclusion is a Netflix value and we strive to host a meaningful interview experience for all candidates. If you want an accommodation/adjustment for a disability or any other reason during the hiring process, please send a request to your recruiting partner.  \n  \nWe are an equal-opportunity employer and celebrate diversity, recognizing that diversity builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.  \n  \nJob is open for no less than 7 days and will be removed when the position is filled."
  },
  {
    "companyName": "INDI Staffing Services",
    "externalUrl": "https://br.linkedin.com/jobs/view/android-developer-remote-at-indi-staffing-services-4138066962?position=6&pageNum=12&refId=jLGoeyIp0LUzrCViYyu7jw%3D%3D&trackingId=ANWjjDKVo85S1nNtUuNEDA%3D%3D",
    "description": "Recognized as the leading software development company in the Americas, our client offers 100% remote modality and an excellent work environment in which employees can thrive, work in multicultural teams, with flexible schedules and endless growth opportunities.\n\n  \n\n**About the Role:**\n\n  \n\nWe are looking for Android Senior Developers to join our Development team and participate in different projects made up of multicultural teams distributed throughout the world. We are looking for proactive people, team players passionate about programming in this language and oriented to provide the best experience to the end user. This is an excellent opportunity for those professionals looking to develop in one of the fastest growing companies in the industry!\n\n  \n\nThese developers will face numerous technical challenges, so they must use current technologies, get involved in the mobile world, web applications, devices, etc.\n\n  \n\n**Main Activities:**\n\n  \n\n\\- Able to work independently with minimal supervision, as well as collaborate with a diverse team.\n\n\\- Accountable for resolution of the most technically challenging issues facing the organization.\n\n\\- Write code with increasing quality and maintainability.\n\n\\- Guide the architecture of large features which impact all parts of the company, identifying issues and raising concerns/blockers for mitigation.\n\n\\- Research and introduce new technology to improve the applications and/or the development pipeline.\n\n  \n\n**Requirements:**\n\n  \n\n\\- 6+ years of experience in development.\n\n\\- 5+ years of experience in Android development.\n\n\\- Solid knowledge of design and architecture patterns.\n\n\\- Solid knowledge and management of programming fundamentals including algorithms and data structures.\n\n\\- Advanced English level.\n\n  \n\n**Benefits:**\n\n  \n\n\\- 100% remote work.\n\n\\- Flexible hours - make your own schedule!\n\n\\- Diverse and multicultural work environment.\n\n\\- Paid parental leave, vacation & holidays.\n\n\\- Hardware setup for you to work from home.\n\n\\- Excellent compensation — well above the market average.\n\n\\- Extensive opportunities for growth and professional development thanks to our mentoring system.\n\n  \n\nEnjoy the opportunity to have a dynamic lifestyle, better health, and wellness. Find renewed passion in your job, improve your productivity, and benefit from attractive growth opportunities for your career.\n\n  \n\nIf you are interested in being part of a team composed of the best professionals and working 100% goal-oriented in an innovative environment, but with the structure and resources of a multinational market leader, do not hesitate to apply!"
  },
  {
    "companyName": "NSKH Tech",
    "externalUrl": "https://in.linkedin.com/jobs/view/senior-android-developer-at-nskh-tech-4138636295?position=4&pageNum=7&refId=AxSax6nO7HuJLLKD%2BBfbRw%3D%3D&trackingId=IoVcEBrvVtt2ZlYhVlntpQ%3D%3D",
    "description": "**Job Title:** Senior Android Developer\n\n-   **Experience:** 8+ years\n-   **Location:** \\[Chennai /Banglore\\]\n-   **Employment Type:** \\[Contract\\]\n-   **Job Description:**\n-   We are looking for a highly skilled **Senior Android Developer** with strong experience in building and maintaining scalable, high-performance **native Android applications**. The ideal candidate will be proficient in **Kotlin, Jetpack Components, Clean Architecture, and Android best practices**.\n-   **Responsibilities:**\n-   Develop and maintain high-quality **native Android applications** in production.\n-   Design and implement **scalable Android frameworks** and libraries via **Gradle/Maven/Bintray**.\n-   Work closely with **UI/UX designers** to create intuitive and engaging user experiences.\n-   Write **clean, maintainable, and testable code** following industry best practices.\n-   Implement **functional/reactive programming patterns** where necessary.\n-   Develop, maintain, and improve **Jetpack Compose UI, MVVM, Coroutines, and Navigation components**.\n-   Optimize **application performance, responsiveness, and resource management**.\n-   Write **comprehensive unit and UI tests** using **JUnit, Espresso, and Mockito**.\n-   Conduct **code reviews** and mentor junior developers to ensure **code quality** and **best practices**.\n-   Build and integrate **RESTful APIs** and **GraphQL services**.\n-   Work with **Firebase, push notifications, and real-time data updates**.\n-   Manage and maintain **Git repositories**, ensuring **CI/CD best practices**.\n-   Stay up-to-date with the latest Android technologies and development trends.\n-   **Must-Have Skills:**\n-   ✅ **Kotlin** - Strong expertise in modern Android development.\n-   ✅ **Jetpack Compose UI** - Experience in building modern UI using Compose.\n-   ✅ **MVVM Architecture** - Strong understanding of architecture patterns.\n-   ✅ **Coroutines & Flow** - Proficiency in modern concurrency handling.\n-   ✅ **Navigation Component** - Hands-on experience in handling navigation.\n-   ✅ **Clean Architecture** - Strong understanding of best practices.\n-   ✅ **Dependency Injection** - Hands-on experience with **Hilt or Dagger**.\n-   ✅ **Unit & UI Testing** - Experience using **JUnit, Espresso, and Mockito**.\n-   ✅ **Git & Version Control** - Strong knowledge of Git workflows.\n-   ✅ **Firebase** - Experience with Firebase authentication, push notifications, and real-time databases.\n-   **Good-to-Have Skills:**\n-   ➕ **GraphQL** - Experience in GraphQL integration.\n-   ➕ **Android SDK & Library Development** - Experience in building SDKs or frameworks.\n-   ➕ **CI/CD Pipelines** - Experience in setting up CI/CD for Android apps.\n-   ➕ **iOS Development (Optional)** - Willingness to learn and contribute to iOS if required.\n-   ➕ **Experience in Managing & Mentoring** - Ability to lead and mentor a team of mobile developers.\n-   **Why Join Us?**\n-   ✅ **Challenging projects** with cutting-edge technology.\n-   ✅ **Opportunity to work in a collaborative and innovative environment.**\n-   ✅ **Competitive compensation and career growth opportunities.**"
  },
  {
    "companyName": "Netpace Inc",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-netpace-inc-4137380238?position=7&pageNum=7&refId=AxSax6nO7HuJLLKD%2BBfbRw%3D%3D&trackingId=nyAmwpKNMSnV0Leuwhiqdw%3D%3D",
    "description": "**Need Immediate joiners:**\n\n  \n\n**Job Description:**\n\n-   Strong experience developing highly scalable, native Android applications in production.\n-   Have 8+ years of experience.\n-   Strong experience building and maintaining Android frameworks and maintaining Android libraries via Gradle/Maven/Bintray\n-   Strong to moderate experience with functional/reactive programming patterns to build applications from the ground up is a plus.\n-   Strong experience collaborating with designers and UX experts to create great user experiences.\n-   Strong hands-on coding experience in Kotlin, Jetpack Components, Clean Architecture, Memory Management, Clean code, Best practices...\n-   Write comprehensive unit and UI tests using JUnit, Espresso, and Mockito to ensure code quality and reliability.\n-   Conduct code reviews and provide constructive feedback to maintain high code standards and foster a collaborative development environment.\n-   Optimise application performance, focusing on responsiveness and resource management.\n-   Experience integrating with and/or building standard RESTful web services.\n-   Experience with GraphQL is also a plus.\n-   You have released or worked as part of a team to release apps in the Google Play Store\n-   You are confident in expressing your point of view from a position of knowledge and experience. You are also receptive to feedback and open to revising your plans when appropriate.\n-   Experience in managing & mentoring the mobile team.\n\n**Additional Skills:**\n\n-   The Android Mobile App Developer will create, implement, and support native mobile applications, SDKs, and design systems/component libraries in the vehicle mobility space, and apply their mobile development knowledge in a highly energized, fast-paced, and innovative environment.\n-   Be a go-to resource for modern, native Android development in Kotlin.\n-   Build, implement, and support mobile applications, SDKs, and design systems/component libraries. Demonstrate a willingness to build and use frameworks, component libraries, design systems, and other reusable pieces - both first and third party.\n-   Be an effective developer who recognizes and utilizes the right tool for the job.\n-   Demonstrate a strong proficiency in Android but a willingness to branch out and learn both Android & IOS as needed.\n-   Creatively solve technical issues. Deliver solutions in a complex environment while collaborating with cross platform team members.\n\n**Must have skill sets:**\n\nKotlin.\n\nCompose UI.\n\nCoroutines\n\nFlow\n\nMVVM.\n\nNavigation.\n\nClean Arch,\n\nGit.\n\n**Interested candidates plz share your resume on pbhaumik@netpace.com**"
  },
  {
    "companyName": "L.A. Head Hunter",
    "externalUrl": "https://br.linkedin.com/jobs/view/work-from-home-android-developer-at-l-a-head-hunter-4138092348?position=44&pageNum=0&refId=ejNL1hvGlBD%2Bt2zU89XiJg%3D%3D&trackingId=SsE%2Fypq3b8jb%2BviKa5UN6w%3D%3D",
    "description": "Recognized as the leading software development company in the Americas, our client offers 100% remote modality and an excellent work environment in which employees can thrive, work in multicultural teams, with flexible schedules and endless growth opportunities.\n\n  \n\n**About the Role:**\n\n  \n\nWe are looking for Android Senior Developers to join our Development team and participate in different projects made up of multicultural teams distributed throughout the world. We are looking for proactive people, team players passionate about programming in this language and oriented to provide the best experience to the end user. This is an excellent opportunity for those professionals looking to develop in one of the fastest growing companies in the industry!\n\n  \n\nThese developers will face numerous technical challenges, so they must use current technologies, get involved in the mobile world, web applications, devices, etc.\n\n  \n\n**Main Activities:**\n\n  \n\n\\- Able to work independently with minimal supervision, as well as collaborate with a diverse team.\n\n\\- Accountable for resolution of the most technically challenging issues facing the organization.\n\n\\- Write code with increasing quality and maintainability.\n\n\\- Guide the architecture of large features which impact all parts of the company, identifying issues and raising concerns/blockers for mitigation.\n\n\\- Research and introduce new technology to improve the applications and/or the development pipeline.\n\n  \n\n**Requirements:**\n\n  \n\n\\- 6+ years of experience in development.\n\n\\- 5+ years of experience in Android development.\n\n\\- Solid knowledge of design and architecture patterns.\n\n\\- Solid knowledge and management of programming fundamentals including algorithms and data structures.\n\n\\- Advanced English level.\n\n  \n\n**Benefits:**\n\n  \n\n\\- 100% remote work.\n\n\\- Flexible hours - make your own schedule!\n\n\\- Diverse and multicultural work environment.\n\n\\- Paid parental leave, vacation & holidays.\n\n\\- Hardware setup for you to work from home.\n\n\\- Excellent compensation — well above the market average.\n\n\\- Extensive opportunities for growth and professional development thanks to our mentoring system.\n\n  \n\nEnjoy the opportunity to have a dynamic lifestyle, better health, and wellness. Find renewed passion in your job, improve your productivity, and benefit from attractive growth opportunities for your career.\n\n  \n\nIf you are interested in being part of a team composed of the best professionals and working 100% goal-oriented in an innovative environment, but with the structure and resources of a multinational market leader, do not hesitate to apply!"
  },
  {
    "companyName": "Greenlight",
    "externalUrl": "https://builtin.com/job/engineering-manager-ux/3576030",
    "description": "As an Engineering Manager at Greenlight, you will lead a Platform Engineering team, manage and mentor software engineers, improve engineering processes, support technical decision-making and ensure a high standard of application delivery.\n\nSummary Generated by Built In\n\nGreenlight is the leading family fintech company on a mission to help parents raise financially smart kids. We proudly serve more than 6 million parents and kids with our award-winning banking app for families. With Greenlight, parents can automate allowance, manage chores, set flexible spend controls, and invest for their family’s future. Kids and teens learn to earn, save, spend wisely, and invest. \n\nAt Greenlight, we believe every child should have the opportunity to become financially healthy and happy. It’s no small task, and that’s why we leap out of bed every morning to come to work. Because creating a better, brighter future for the next generation depends on it.\n\nFounded in 2014, Greenlight Financial Technology is an Atlanta-based fintech company that’s committed to empowering parents to raise financially-smart kids. Its groundbreaking family finance product, Greenlight®, is a debit card for kids that parents manage by app using flexible parental controls. Patent-pending technology enables parents to choose the exact stores where their children can spend, manage chores, set parent-paid interest rates on savings and more. Kids monitor balances, create saving goals and learn to make real world trade-off decisions.\n\nWe are looking for an experienced Engineering Manager to lead one of our Platform Engineering teams. You may be a fit for this role if you thrive in a high growth, high impact environment and lead teams with high standards and a commitment to continuous improvement. You also should have experience leading teams in the deployment and operational phases of the SDLC.\n\n**Technologies we use:**\n\n-   iOS, Android\n-   Node.js, Java\n-   React, Redux, Swift, Kotlin\n-   REST, gRPC\n-   MySQL, Redis\n\n  \n\n**What you will be doing:**\n\n-   Manage and mentor a team of software engineers in our platform engineering group\n-   Work with other leaders across engineering and product to inform the technical roadmap and priorities\n-   Improve engineering tooling, process, and standards to enable faster, more consistent, more reliable, and highly repeatable application delivery\n-   Lead process improvement efforts as we grow our team and scale our product\n-   Provide guidance and best practices around security for applications and platform infrastructure\n-   Remain engaged with latest technology trends and understand operational challenges to continually evolve application delivery processes and platform components\n-   Support platform technology decisions based on performance metrics and operational SLAs\n-   Recruit, develop and retain great engineers\n\n**What you should bring:**\n\n-   Bachelors degree in computer science or equivalent, masters preferred\n-   10+ years of software development experience\n-   3+ years of experience managing teams, ideally with 5+ mobile app developers\n-   Strong technical background in developing products, services or platforms\n-   Ability to develop a sense of ownership, accountability & urgency with your teams\n-   Experience collaborating with engineering leaders and cross-functional team members\n-   Ability to provide technical mentorship and guidance to the team\n\nGreenlight is a high-growth start-up with a purpose-driven product that families love. Started by serial founders and backed by leading investors, including Drive Capital, JP Morgan Chase, Relay Ventures, Amazon, SunTrust Bank and Wells Fargo, the Greenlight team is 100 people strong with alumni from Facebook, Hulu, Amazon Web Services, Yahoo!, Cardlytics and Square.\n\nGreenlight is an equal opportunity employer and will not discriminate against any employee or applicant on the basis of age, color, disability, gender, national origin, race, religion, sexual orientation, veteran status, or any classification protected by federal state or local law.\n\nRead Full Description"
  },
  {
    "companyName": "Trimble Inc.",
    "externalUrl": "https://builtin.com/job/lead-software-engineer/3910805",
    "description": "As a Lead Software Engineer, you will design, develop, and maintain high-quality Android applications. Responsibilities include collaborating with teams to deliver solutions, optimizing application performance, leading technical design, conducting code reviews, and mentoring junior members while staying updated with the latest trends in Android development.\n\nSummary Generated by Built In\n\nYour Title: Lead Software Engineer (Andriod)\n\nJob Location: Chennai (Hybrid)\n\nAre you a Software Engineer that wants to be at the heart of analyzing, designing, and programming cutting-edge software enhancements and new products in a collaborative environment? \n\n**Who are we?**\n\nTrimble Transportation is a division of Trimble Inc., a leading provider of technology solutions for various industries. Trimble Transportation focuses specifically on providing technology and software solutions to the transportation and logistics industry.\n\nTrimble Transportation offers a range of solutions designed to improve operational efficiency, enhance safety, and optimize resources for fleet management, transportation logistics, and supply chain management. These solutions leverage advanced technologies such as GPS, telematics, cloud computing, and data analytics to enable better decision-making and streamline processes in the transportation industry.\n\n**Who are we looking for?**\n\nWe are seeking a highly skilled and experienced Senior Android Software Engineer to join our dynamic and innovative team. As a Senior Android Software Engineer, you will be responsible for developing, implementing, and maintaining cutting-edge mobile applications on the Android platform. Your comprehensive experience and marketable skills will be crucial in driving the success of our mobile app development projects. This is an excellent opportunity to work on challenging projects, collaborate with cross-functional teams, and contribute to the growth and evolution of our Android applications.\n\n**Responsibilities:**\n\n-   Design, develop, and maintain high-quality Android applications using the latest technologies and best practices.\n    \n-   Actively engage with cross-functional teams, including product managers, designers, and backend engineers, to define, prioritize, and deliver robust mobile solutions.\n    \n-   Lead the technical design and implementation of complex features and modules, ensuring scalability, reliability, and performance.\n    \n-   Provide technical expertise and guidance to junior team members, fostering knowledge sharing and professional growth.\n    \n-   Conduct code reviews, identify areas for improvement, and implement solutions to enhance the overall quality of the Android applications.\n    \n-   Optimize application performance and user experience by analyzing and addressing performance bottlenecks, memory leaks, and other issues.\n    \n-   Stay up-to-date with the latest trends, tools, and technologies in Android app development and propose innovative ideas to improve the application architecture and user experience.\n    \n-   Collaborate with Test Automation engineers to ensure proper testing and deployment of Android applications, ensuring high standards of quality and reliability.\n    \n-   Troubleshoot and debug issues reported by users or identified through testing, providing timely resolutions and maintaining high levels of user satisfaction.\n    \n\n**Qualifications:**\n\n-   Bachelor's or Master's degree in Computer Science, Software Engineering, or a related field.\n    \n-   **Minimum of 5 years** of professional experience in Android application development.\n    \n-   Experience with reactive and asynchronous programming frameworks such as **Kotlin** Coroutines.\n    \n-   Proven track record of delivering successful Android applications with comprehensive knowledge of the Android ecosystem, tools, and frameworks.\n    \n-   Strong proficiency in **Kotlin**.\n    \n-   Proficient in **RESTful APIs integration**, JSON/XML parsing, and third-party library integration.\n    \n-   Experience with Google Firestore and proficiency in integrating Firestore databases into Android applications.\n    \n-   Experience with **Google Cloud Platform (GCP)** services and the ability to leverage GCP tools for building scalable and cloud-native Android applications**(Mandatory)**.\n    \n-   Proficiency in utilizing Firebase for application analytics, crash reporting, and performance monitoring to gather insights and improve app performance.\n    \n-   Extensive experience with Android Studio, Gradle, and other development tools.\n    \n-   Solid understanding of object-oriented programming principles, design patterns, and best practices for mobile application development.\n    \n-   Deep knowledge of Android UI/UX design principles, material design guidelines, and responsive layout techniques.\n    \n-   Experience with Git/GitHub and familiarity with continuous integration/continuous deployment (CI/CD) processes.\n    \n-   Strong problem-solving skills and the ability to analyze complex technical challenges and propose effective solutions.\n    \n-   Excellent communication skills, both verbal and written, with the ability to effectively collaborate and communicate technical concepts to cross-functional teams.\n    \n-   Experience with unit testing frameworks (e.g., JUnit, Espresso) and test-driven development (TDD) principles.\n    \n\n**Preferred Qualifications:**\n\n-   Experience working with serverless backend technologies and cloud platforms, such as Google Cloud Functions.\n    \n-   Knowledge of JavaScript and proficiency in building backend services or APIs using Node.js or other JavaScript frameworks.\n    \n-   Familiarity with GoLang and the ability to work with Go-based backend systems and microservices.\n    \n-   Familiarity with Agile/Scrum methodologies and tools (e.g., JIRA, Confluence).\n    \n-   Proven experience in successfully launching Android applications through the Google Play Store, including a deep understanding of the submission and review process.\n    \n\nWe offer competitive compensation packages, a supportive work environment, and opportunities for professional growth and advancement. If you are passionate about Android app development and possess the skills and experience required, we would love to hear from you. Apply now to join our talented team of engineers and contribute to the development of innovative mobile applications.  \n \n\n****Trimble’s Inclusiveness Commitment****\n\nWe believe in celebrating our differences. That is why our diversity is our strength. To us, that means actively participating in opportunities to be inclusive. Diversity, Equity, and Inclusion have guided our current success while also moving our desire to improve. We actively seek to add members to our community who represent our customers and the places we live and work.\n\nWe have programs in place to make sure our people are seen, heard, and welcomed and most importantly that they know they belong, no matter who they are or where they are coming from.\n\nTrimble’s Privacy Policy\n\nRead Full Description"
  },
  {
    "companyName": "finbyte",
    "externalUrl": "https://tr.linkedin.com/jobs/view/senior-android-developer-100%25-remote-at-finbyte-4136728267?position=4&pageNum=10&refId=wI8VgnLiU0R5JMpyizXy5Q%3D%3D&trackingId=p4rb3mprVR04xoCgTO4t%2BA%3D%3D",
    "description": "We are finbyte, a tech company based in Berlin helping businesses build fintech solutions and gain momentum to launch innovative offerings. Finbyte brings Commencis’ extensive experience in software & product development and strong talent together with FinLeap’s dominant presence as Europe’s leading fintech ecosystem.\n\n  \n\nOn a mission to thrive fintechs and enterprises in the era of disruption, finbyte aims to create momentum and accelerate future-minded companies.\n\n  \n\nWe are looking for team members to develop state-of-the-art technology and contribute to innovative projects that will help reshape the future of finance.\n\n  \n\nJoin us to build the backbone of pioneering companies.\n\n  \n\n**The position in a nutshell:**\n\nWe are seeking a highly skilled and experienced Senior Android Developer to join our team. In this role, you will be responsible for developing, enhancing, and maintaining our FinTech mobile applications. You will work closely with our product managers, designers, and other engineers to deliver seamless, high-performance, and secure mobile experiences for our users.\n\n  \n\n**Key Responsibilities:**\n\n-   Design, develop, and maintain high-quality Android applications for the FinTech sector.\n-   Collaborate with cross-functional teams to define, design, and ship new features.\n-   Ensure the performance, quality, and responsiveness of applications.\n-   Identify and correct bottlenecks and fix bugs.\n-   Help maintain code quality, organization, and automation.\n-   Stay up-to-date with the latest industry trends, technologies, and best practices.\n-   Mentor and guide junior developers, promoting a culture of continuous learning and improvement.\n\n  \n\n**Qualifications:**\n\n-   Bachelor's or Master's degree in Computer Science, Engineering, or a related field.\n-   5+ years of proven professional experience in Android development with a strong portfolio of released applications on the Google Play Store.\n-   Strong proficiency in Kotlin.\n-   Production experience with Jetpack Compose.\n-   Experience with RESTful APIs to connect Android applications to back-end services.\n-   Experience with popular third-party libraries such as Hilt and Retrofit.\n-   Proficiency in Unit-Testing.\n-   Solid understanding of mobile architecture patterns (MVI, MVVM with Clean Architecture).\n-   Solid understanding of the full mobile development life cycle, OOP and SOLID principles.\n-   Experience with modern version control systems and code review processes\n-   Experience with offline storage, threading, and performance tuning.\n-   Familiarity with cloud message APIs and push notifications.\n-   Strong problem-solving skills and attention to detail.\n-   Excellent communication and teamwork abilities.\n\n  \n\n**Good to Have:**\n\n-   Experience in the FinTech sector or working on financial applications.\n-   Knowledge of security standards and best practices for mobile applications.\n-   Familiarity with Agile development methodologies.\n-   Contributions to open-source projects or a strong personal portfolio of app development.\n\n  \n\n**Interested?**\n\nTell us why you’re the right one to join our team. Apply now through LinkedIn or email."
  },
  {
    "companyName": "Nwaresoft",
    "externalUrl": "https://www.glassdoor.co.in/job-listing/mobile-application-developer-nwaresoft-JV_KO0,28_KE29,38.htm?jl=1009611659458",
    "description": "Job Details\n\n2-3 Years - Full time\n\nTotal Openings - 1\n\nDepartment - Technical Department\n\nCategory - Software Development\n\nSub Category - Front end & Back end Development\n\nPay according - Per month\n\nSalary Offered ₹30,000.00 - ₹50,000.00\n\n  \n\nNWARESOFT PRIVATE LIMITED\n\n**Skills Required**\n\n**SQL/NoSQL**\n\n**JSON**\n\n**Android SDK**\n\n**REST**\n\n**APIs**\n\n**Payment Gateway**\n\n**Coupon**\n\n**Flutter**\n\n**Description**\n\nWe are seeking a talented and motivated Mobile Application Developer with 2 to 3 years of experience to join our dynamic team. The ideal candidate will have a strong background in developing hybrid mobile applications using Android technologies and will be responsible for designing, building, and maintaining efficient, reusable, and reliable code. If you are passionate about mobile technologies and are eager to work in a fast-paced, collaborative environment, we want to hear from you.\n\n**Key Responsibilities:**\n\n1\\. Develop and Maintain Hybrid Mobile Applications:\n\n-   Design and build advanced applications for the Android platform using hybrid frameworks such as React Native, Flutter, or Ionic.\n-   Collaborate with cross-functional teams to define, design, and ship new features.\n\n2\\. Ensure Performance, Quality, and Responsiveness:\n\n-   Write clean, maintainable, and efficient code.\n-   Ensure the best possible performance, quality, and responsiveness of the application.\n-   Identify and correct bottlenecks and fix bugs.\n\n3\\. Continuous Improvement and Innovation:\n\n-   Stay updated with the latest industry trends and technologies.\n-   Continuously discover, evaluate, and implement new technologies to maximize development efficiency.\n\n4\\. Collaboration and Communication:\n\n-   Work closely with product managers, designers, and other developers to understand project requirements and deliver high-quality software solutions.\n-   Participate in code reviews and contribute to team knowledge sharing.\n\n**Requirements:**\n\n1\\. Education and Experience:\n\n-   Bachelor’s degree in Computer Science, Information Technology, or a related field.\n-   2-3 years of experience in Android development, with a focus on hybrid mobile applications.\n\n2\\. Technical Skills:\n\n-   Strong knowledge of Android SDK, different versions of Android, and how to deal with different screen sizes.\n-   Proficiency in hybrid frameworks such as React Native, Flutter, or Ionic.\n-   Experience with RESTful APIs to connect Android applications to back-end services.\n-   Familiarity with cloud message APIs and push notifications.\n-   Understanding of code versioning tools, such as Git.\n\n3\\. Soft Skills:\n\n-   Excellent problem-solving skills and attention to detail.\n-   Strong communication and interpersonal skills.\n-   Ability to work independently as well as part of a team.\n\n**Preferred Qualifications:**\n\n-   Experience with third-party libraries and APIs.\n-   Knowledge of the open-source Android ecosystem and the libraries available for common tasks.\n-   Familiarity with continuous integration.\n-   Experience in Agile/Scrum development process.\n\n**Benefits:**\n\n-   Competitive salary and performance-based bonuses.\n-   Flexible working hours and remote work options.\n-   Opportunity to work on cutting-edge technologies and projects.\n-   Health insurance and other benefits.\n-   Professional development opportunities and career growth."
  },
  {
    "companyName": "Dicetek LLC4.3",
    "externalUrl": "https://www.glassdoor.co.in/job-listing/android-developer-dicetek-llc-JV_KO0,17_KE18,29.htm?jl=1009616835082",
    "description": "The Software Developer - Android oversees development, and delivery of android solutions. The Software Developer - Android will help establish full stack framework for multi-country, multi-currency, multi-brand solutions and drive implementation of guidelines. He/She will also have the following responsibilities, including but not limited to:\n\n-   Prototyping, designing, and developing solutions including multi-country, multi-currency, multi-brand integrations\n-   Partnering with the stakeholders and end users to translate ideas, high level specifications into new or enhanced mobile application solutions\n-   Pursues continuous improvement in development processes, standards and quality\n-   Collaborate with product owners to develop multi generation software technology plans\n-   Work directly with stakeholders to understand business and technical needs\n-   Communicate effectively with immediate team and leadership, ensuring team receives consistent messages and has clear understanding of business direction, strategy, and results\n-   Collaborate with cross functional teams such as architecture, backend integration, visual design, UX teams, QA, etc.\n\n**Work Experience:**\n\n-   Minimum 3+ years of experience in software product development and delivery using Android.\n-   1+ years skills in Kotlin\n-   2+ years skills in Java, experience in developing the scalable apps\n-   2+ years of hands-on experience with Agile (Scrum or XP), test & behaviour driven development\n-   Highly proficient with building enterprise application with Android\n-   Strong knowledge of Object Oriented Analysis and Design, Software Design Patterns and Full stack coding principles\n-   Hands-on experience in source version control, unit testing, MVVM, Rest APIs, Android components\n-   Hands-on experience with modern frameworks, design patterns\n-   Strong problem solving abilities and capable of articulating specific technical topics or assignments"
  },
  {
    "companyName": "Coinbase",
    "externalUrl": "https://www.linkedin.com/jobs/view/software-engineer-at-coinbase-4133675331?position=6&pageNum=7&refId=BKSQIIlbctQc%2Bc5uU6T8kg%3D%3D&trackingId=jhKKdj30aNrE8Z0tyqjOLw%3D%3D",
    "description": "Ready to be pushed beyond what you think you’re capable of?\n\n  \n\nAt Coinbase, our mission is to increase economic freedom in the world. It’s a massive, ambitious opportunity that demands the best of us, every day, as we build the emerging onchain platform — and with it, the future global financial system.\n\n  \n\nTo achieve our mission, we’re seeking a very specific candidate. We want someone who is passionate about our mission and who believes in the power of crypto and blockchain technology to update the financial system. We want someone who is eager to leave their mark on the world, who relishes the pressure and privilege of working with high caliber colleagues, and who actively seeks feedback to keep leveling up. We want someone who will run towards, not away from, solving the company’s hardest problems.\n\n  \n\nOur work culture is intense and isn’t for everyone. But if you want to build the future alongside others who excel in their disciplines and expect the same from you, there’s no better place to be.\n\nCoinbase stores a large amount of digital currency making us a top tier target on the internet. Security is core to our mission and has been a key competitive differentiator for us as we scale. If you’re looking to fight on the front lines in a high-intensity environment, we’d like to speak with you about joining our security team. As a Software Engineer in Security Platform Engineering, you will be working on building capabilities and solutions for a variety of security use cases. Our team builds and maintains the platforms critical for security, compliance and privacy at Coinbase. You will be working on developing novel solutions for onchain security, web3 monitoring capabilities and associated services to protect Coinbase & customers. We highly value individuals with intellectual curiosity and openness. We collaborate across the organization, helping our engineers think big and take risks while building a culture of diversity, positive energy, and blameless truth-seeking.\n\n  \n\n**What you’ll be doing:**\n\n  \n\n  \n-   Build new services to meet critical product and business needs using Golang.\n  \n-   Design scalable systems to solve novel problems with modern cloud technology and industry best practices.\n  \n-   Articulate a long term vision for maintaining and scaling our backend systems and the teams running them.\n  \n-   Work with engineers, designers, product managers and senior leadership to turn our product and technical vision into a tangible roadmap every quarter.\n  \n-   Write high quality, well tested code to meet the needs of your customers.\n  \n\n  \n\n**What we look for in you:** \n\n  \n\n  \n-   You have at least 2 years of experience in software engineering.\n  \n-   You’ve designed, built, scaled and maintained production services, and know how to compose a service oriented architecture.\n  \n-   You write high quality, well tested code to meet the needs of your customers.\n  \n-   You’re passionate about building an open financial system that brings the world together.\n  \n\n  \n\n**Nice to haves:**\n\n  \n\n  \n-   You have gone through a rapid growth in your company (from startup to mid-size).\n  \n-   You have experience with Blockchain technology (such as Bitcoin, Ethereum etc..)\n  \n-   You have experience decomposing a large monolith into microservices.\n  \n-   You’ve worked with Golang, Ruby, Docker, Rails, Postgres, MongoDB or DynamoDB.\n  \n-   You’ve built financial, high reliability security systems.\n  \n\n  \n\n**P60083**\n\n  \n\nPay Transparency Notice: Depending on your work location, the target annual salary for this position can range as detailed below. Full time offers from Coinbase also include target bonus + target equity + benefits (including medical, dental, vision and 401(k)).\n\nPay Range: : $124,950 USD - $147,000 USD\n\nCommitment to Equal Opportunity  \n\nCoinbase is committed to diversity in its workforce and is proud to be an Equal Opportunity Employer.  All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, sex, gender expression or identity, sexual orientation or any other basis protected by applicable law. Coinbase will also consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state and local law.  For US applicants, you may view the Know Your Rights notice here.  Additionally, Coinbase participates in the E-Verify program in certain locations, as required by law. \n\n  \n\nCoinbase is also committed to providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please contact us at accommodations\\[at\\]coinbase.com to let us know the nature of your request and your contact information.  For quick access to screen reading technology compatible with this site click here to download a free compatible screen reader (free step by step tutorial can be found here).\n\n  \nGlobal Data Privacy Notice for Job Candidates and Applicants  \n\nDepending on your location, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) may regulate the way we manage the data of job applicants. Our full notice outlining how data will be processed as part of the application procedure for applicable locations is available here. By submitting your application, you are agreeing to our use and processing of your data as required. For US applicants only, by submitting your application you are agreeing to arbitration of disputes as outlined here."
  },
  {
    "companyName": "Block",
    "externalUrl": "https://au.linkedin.com/jobs/view/android-engineer-paynow-at-block-4040603265?position=35&pageNum=0&refId=AiLGlqX5PJ3wN1T1csPGaA%3D%3D&trackingId=NhoybNE3RZjyAj9o1H5Fqg%3D%3D",
    "description": "**The Role**  \n  \nThis role is part of the Paynow team which is responsible for customer online payment solutions and Health Services solutions for some of the major Australian financial institutions and related service partners.  \n  \nIn this role you will help develop and maintain client applications embedded in the financial institution terminals that underpins our healthcare platform. You will work in a multi-functional team responsible to develop new features and improve on existing experiences of our Healthcare products such as Health Claiming, support for payments and Afterpay, and in the process, contribute to one of our most important projects.  \n  \nAs an Android Engineer on the PayNow team you will be responsible for working on enterprise services that provide payments and healthcare solutions to some of Australia’s largest telecommunication and health services providers. This is a great opportunity for an experienced engineer to take charge and make things happen.  \n  \n**You Will**  \n  \n\n-   Build end-to-end features of the app: networking, persistence, business logic, and UI\n-   Own features and functions throughout their lifecycle from inception, rollout, launch, scale and iteration\n-   Fostering the use of agile practices for Software Delivery\n-   Work in cross-functional Product teams responsible for the discovery, delivery and validation of product features via microservices, APIs, web-apps\n-   Peer review design decisions, code, automated tests and documentation\n-   Participate in the ongoing design and architecture of our evolving our product and services\n-   Collaborate with product managers, experience designers & business stakeholders to build efficient and reliable feature implementations that will delight our customers\n-   Ensure that story estimates and code reviews are completed in a timely manner\n-   Build end-to-end features of the app: networking, persistence, business logic, and UI\n-   Craft durable, well-tested code with an unwavering commitment to product quality\n-   Invent thoughtful Android tech and open source it\n-   Re-architect legacy code and prep it to scale for the future of the product and the team\n-   Partner with fellow engineer and backend developers on delivering remarkable solutions\n-   Have a meaningful impact on the future of the Paynow product\n\n**You Have**  \n  \n\n-   An understanding or familiarity with payment standards for card present transactions (using payment terminals) including AS2805 and ISO8583.\n-   An understanding of how to build testable, decoupled, maintainable code and other engineering best practices.\n-   a track record of working on Android payment terminals\n-   experience building Android & iOS Apps\n-   Android Architecture components\n-   Proficiency in Java and/or Kotlin for development (we use both)\n-   Knowledge of health claiming, experience with EFTPOS terminal (payment) applications / EFTPOS terminal development (C/C++), or a working knowledge of such applications\n-   An interest and enjoy working on mobile apps at all levels – from networking up to user interfaces and whatever’s in between.\n-   Experience building high availability and highly resilient systems which can accept and report claims and payments no matter the network or device conditions.\n-   Frontend experience using language e.g. REACT\n-   Google libraries: Lifecycle, ViewPager2, Flexbox vie\n-   Test automation and Continuous Integration & Delivery practices\n-   Experience with version control, preferably Git.\n-   A willingness to learn and apply new methodologies as required\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to identity or other legally protected class.  \n  \nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. **_Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our_** **_I+D page_****_.  \n  \n_**Block is a globally distributed company and this role will require working with other employees in multiple time zones. You may be required to perform work outside of normal business as part of this role.  \n  \n__Every benefit we offer is designed with one goal: empowering you to do the best work of your career while building the life you want._ _Check out benefits at Block.  \n  \n___Block, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, and TIDAL, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.  \n  \n_Privacy Policy"
  },
  {
    "companyName": "Ascendion",
    "externalUrl": "https://www.linkedin.com/jobs/view/software-engineer-kotlin-react-at-ascendion-4133201905?position=2&pageNum=12&refId=tkLe7edTWkh%2Bnoal%2FYCkTw%3D%3D&trackingId=vrjr0VH74N3ijNQ%2B3n0UkA%3D%3D",
    "description": "About Ascendion:\n\nAscendion is a full-service digital engineering solutions company. We make and manage software platforms and products that power growth and deliver captivating experiences to consumers and employees. Our engineering, cloud, data, experience design, and talent solution capabilities accelerate transformation and impact for enterprise clients. Headquartered in New Jersey, our workforce of 6,000+ Ascenders delivers solutions from around the globe. Ascendion is built differently to engineer the next. Ascendion | Engineering to elevate life\n\n  \n\nWe have a culture built on opportunity, inclusion, and a spirit of partnership. Come, change the world with us:\n\nBuild the coolest tech for world’s leading brands\n\nSolve complex problems – and learn new skills\n\nExperience the power of transforming digital engineering for Fortune 500 clients\n\nMaster your craft with leading training programs and hands-on experience\n\n  \n\nExperience a community of change makers!\n\nJoin a culture of high-performing innovators with endless ideas and a passion for tech. Our culture is the fabric of our company, and it is what makes us unique and diverse. The way we share ideas, learning, experiences, successes, and joy allows everyone to be their best at Ascendion.\n\n  \n\nAbout the Role:\n\nJob Title: Software Engineer (Kotlin/React)\n\n  \n\nLocation: Remote\n\n  \n\nKey Responsibilities:\n\n-   Design and build secure, resilient software to handle faults, failures, and unusual events.\n-   Develop and maintain APIs, focusing on REST best practices.\n-   Work with Azure PaaS services, such as Azure Functions, RabbitMQ, Kafka, and AKS.\n-   Implement solutions with performance, reliability, and scalability in mind.\n-   Collaborate with the team to ensure high-quality software delivery.\n\n  \n\nMinimum Qualifications:\n\n-   5-7 years of software development experience.\n-   Should be well versed with front-end technology React as well.\n-   Knowledge of object-oriented programming (Kotlin preferred).\n-   5+ years of hands-on experience in Kotlin/Spring Boot API development.\n-   Familiarity with Agile development and version control tools like GitHub Actions.\n-   Experience with defensive coding practices and system fault handling.\n-   Proficiency in Linux/Unix environments.\n\n  \n\nSalary Range: The salary for this position is between $100,000 – $115,000 annually. Factors which may affect pay within this range may include geography/market, skills, education, experience, and other qualifications of the successful candidate.\n\n  \n\nThis position is eligible for commissions in accordance with the terms of the Company’s plan. Commissions for this position are estimated to be based on individual performance. Additionally, this role is also eligible for bonus based on achievement of mutually agreed KRAs.\n\n  \n\nBenefits: The Company offers the following benefits for this position, subject to applicable eligibility requirements: \\[medical insurance\\] \\[dental insurance\\] \\[vision insurance\\] \\[401(k) retirement plan\\] \\[long-term disability insurance\\] \\[short-term disability insurance\\] \\[personal days accrued each calendar year. The Paid time off benefits meet the paid sick and safe time laws that pertains to the City/ State\\] \\[12-15 days of paid vacation time\\] \\[6-8 weeks of paid parental leave after a year of service\\] \\[9 paid holidays and 2 floating holidays per calendar year\\] \\[Ascendion Learning Management System\\] \\[Tuition Reimbursement Program\\]\n\n  \n\nWant to change the world? Let us know.\n\nTell us about your experiences, education, and ambitions. Bring your knowledge, unique viewpoint, and creativity to the table. Let’s talk!"
  },
  {
    "companyName": "TextNow",
    "externalUrl": "https://ca.linkedin.com/jobs/view/senior-android-developer-ads-at-textnow-3978297603?position=10&pageNum=12&refId=2IsuBHwtu45er15qymThtQ%3D%3D&trackingId=dCM9FI6pTavSQkBeOEpQ3g%3D%3D",
    "description": "TextNow is looking for a Senior Android Developer to join our Revenue team, working to improve our Ads systems to improve the user experience while increasing revenue.  \n  \n**What You'll Do**  \n  \n\n-   Work with our AdOps team to develop new ad solutions to provide increasing value to advertisers\n-   Collaborate with our Product team to ensure a high-quality user experience around our ads\n-   Debug performance issues with ad units and work with ad providers to resolve them\n-   Suggest and implement improvements to the ads code architecture\n-   Be a leader in our larger Android team, establishing and encouraging best practices throughout the organization\n\n**Who You Are**  \n  \n\n-   An Android developer with 5+ years of Android development experience, particularly in Kotlin, with a desire to lead and mentor others\n-   An experienced ads developer, with 3+ years of ads development experience, particularly with Google Ads Manager\n-   Able to balance and advocate for both the business needs of revenue generation and a positive user experience\n-   Self-motivated to drive projects to completion\n-   A good communicator\n\n$108,340 - $171,180 a year  \n  \nMore about TextNow...  \n  \n**Our Values**  \n  \n\n-   Customer Obsessed (We strive to have a deep understanding of our customers)\n-   Do Right By Our People (We treat each other with fairness, respect, and integrity)\n-   Accept the Challenge (We adopt a \"Yes, We Can\" mindset to achieve ambitious goals)\n-   Act Like an Owner (We treat this company like it's our own... because it is!)\n-   Give a Damn! (We are deeply commited and passionate about our work and achieving results)\n\n**Benefits, Culture, & More**  \n  \n\n-   Strong work life blend\n-   Flexible work arrangements (wfh, remote, or access to one of our office spaces)\n-   Employee Stock Options\n-   Unlimited vacation\n-   Competitive pay and benefits\n-   Parental leave\n-   Benefits for both physical and mental well being (wellness credit and L&D credit)\n-   We travel a few times a year for various team events, company wide off-sites, and more\n\n**Diversity And Inclusion**  \n  \n_At TextNow, our mission is built around inclusion and offering a service for EVERYONE, in an industry that traditionally only caters to the few who have the means to afford it. We believe that diversity of thought and inclusion of others promotes a greater feeling of belonging and higher levels of engagement. We know that if we work together, we can do amazing things, and that our differences are what make our product and company great.  \n  \n_TextNow Candidate Policy  \n  \n_By submitting an application to TextNow, you agree to the collection, use, and disclosure of your personal information in accordance with the_ _TextNow Candidate Policy_"
  },
  {
    "companyName": "InPost",
    "externalUrl": "https://pl.linkedin.com/jobs/view/senior-android-developer-at-inpost-4137874796?position=41&pageNum=0&refId=TDiLq7EKnl44Tfit%2B2QHPw%3D%3D&trackingId=Q4F9gYEBoP%2Bpi%2B4%2FnDEaYQ%3D%3D",
    "description": "InPost Group is an innovative European out-of-home delivery company, revolutionizing the way parcels are delivered to customers. With operations across several countries, our network of intelligent lockers provides customers with a fast, convenient, and secure delivery option. InPost Group is a publicly tr_ad_ed company, with a market capitalization of about $5 billion as of March 2023. With about 30,000 employees worldwide, InPost Group is one of the largest out-of-home delivery providers in Europe, committed to providing sustainable and efficient delivery solutions to meet the evolving needs of customers in today's rapidly changing landscape.  \n  \n  \n  \n\n**Job Description**  \n  \n\nAt InPost we have built one of the most well-recognized and appreciated mobile applications in the European Logistics sector, with 10+ million users, and we are not stopping there. Our next step is conquering the international European market and scaling our Mobile platform and applications across Europe.  \n  \n\nWe are looking for experienced Android developers to join us in that journey - heavily influence our platform build, improve processes, and help us deliver the best native app experience in the market.  \n  \n\n**Responsibilities**  \n  \n\n-   Develop test-covered code at a high quality and take part in team decisions to build scalable and maintainable apps.\n-   Participate in code reviews to ensure code quality, best practices, and standards are followed.\n-   Document technical specifications, installation procedures, and other relevant information for applications.\n-   Collaborate with cross-functional teams to define, design, and ship new features\n-   Continuously discover, evaluate, and implement new technologies to maximize development efficiency\n\n  \n  \n\n**Technologies used:**  \nKotlin, Jetpack Compose, Coroutines, RXJava, Retrofit, Room, Dagger Hilt, Modularized code base, Clean architecture.  \n  \n  \n  \n\n**Qualifications**  \n  \n\n-   Be comfortable working in an agile cross-functional team.\n-   The ability to comfortably work independently in Kotlin & Java, refactoring existing code to improve its design while working in an agile environment.\n-   An understanding of Mobile Software architectures including MVVM, Clean Architecture, and SOLID principles.\n-   Experience in Continuous Integration / Continues Deployment, and release process. A good understanding of how to use git.\n-   Good understanding of UI/UX design principles and material design.\n\n**Additional Information**  \n  \n\n**Why InPost?**  \n  \n\n-   Professional growth within the company.\n-   Excellent working environment.\n-   Chances to broaden your skill set and acquire new competencies.\n-   Remote work.\n-   Private healthcare, Multisport card, and group insurance.\n-   Access to the Worksmile platform.\n-   Workation programme.\n-   Flexible working hours."
  },
  {
    "companyName": "DevBytes",
    "externalUrl": "https://in.linkedin.com/jobs/view/android-developer-at-devbytes-4134238217?position=8&pageNum=0&refId=TDiLq7EKnl44Tfit%2B2QHPw%3D%3D&trackingId=ENFM8F9V2GIeAo2l2gUSTw%3D%3D",
    "description": "**Company Overview**\n\nDevBytes is your ultimate go-to app for the latest content from the tech, startup, and dev worlds. With just a tap, you may dive into the freshest trends in AI, ML, cloud, AR/VR, cybersecurity, NLP, data science, DevOps, and everything coding.\n\nIt is your one-stop platform for tech news on the fly, delivering trending updates daily from industry giants like Google, OpenAI, Apple, Meta, Amazon, X, Netflix, Tesla, Microsoft, SpaceX, and beyond. Stay in the loop on the stories that matter to you.\n\n  \n\n**Role and Responsibilities**\n\n**1.      Design & Development:** Build and maintain advanced Android applications using Kotlin/Java, following best practices.\n\n**2.      UI/UX Integration:** Collaborate with designers to implement user interfaces aligned with modern Android standards.\n\n3.      **API Integration:** Work with RESTful APIs to connect Android applications to backend services.\n\n**4.      Code Optimization:** Ensure code quality through testing, debugging, and optimization for performance and scalability.\n\n**5.      Version Control:** Utilize Git for version control and collaborate with team members in code reviews.\n\n6.      **Testing:** Write and execute unit tests, and integrate automated testing frameworks for robust application reliability.\n\n7.      **Documentation:** Maintain comprehensive documentation for all application features and code.\n\n**8.      Collaboration:** Work closely with cross-functional teams, including product managers, backend developers, and QA engineers, to deliver complete solutions.\n\n**9.      Continuous Learning:** Stay updated on emerging trends, tools, and technologies in Android development and implement them when appropriate.\n\n**10.  Deployment & Maintenance:** Manage app releases to Google Play Store and provide post-launch support to ensure seamless user experiences**.**\n\n  \n\n**Qualifications-**\n\nCompleted a Bachelor's/Master's in Computer Science or IT, with 2+ years of development experience and proficiency in at least one programming language (e.g., Python, Java, JavaScript).\n\n **Benefits:**\n\n●     Opportunity to gain hands-on experience and develop skills in android development.\n\n●     Mentorship and guidance from experienced professionals in the field.\n\n●     Exposure to real-world projects and technologies used in the industry."
  },
  {
    "companyName": "Skyshi Digital Indonesia",
    "externalUrl": "https://id.linkedin.com/jobs/view/frontend-mobile-kotlin-at-skyshi-digital-indonesia-4137835696?position=1&pageNum=0&refId=TDiLq7EKnl44Tfit%2B2QHPw%3D%3D&trackingId=VBa7FScCOlTm4UO%2FdCxSrw%3D%3D",
    "description": "Requirements:\n\n-   Bachelor's degree in Computer Science, Software Engineering, or a related fiel\n-   Proven experience in mobile development with at least 3 years working with Android and Kotlin.\n-   Strong knowledge of Android SDK, Android UI design principles, patterns, and best practices.\n-   Experience with Android architecture components such as ViewModel, LiveData, Room, and Navigation.\n-   Familiarity with RESTful APIs and experience integrating mobile applications with backend services.\n-   Understanding of Material Design guidelines and mobile UI/UX best practices.\n-   Experience with version control systems (e.g., Git).\n-   Knowledge of performance optimization techniques for mobile applications.\n-   Experience with automated testing, unit testing, and continuous integration (CI) pipelines for mobile apps.\n-   Familiarity with agile methodologies and the ability to work in a fast-paced environment.\n-   Excellent communication and teamwork skills, with a proactive and\n-   problem-solving attitude."
  },
  {
    "companyName": "Yahoo",
    "externalUrl": "https://www.linkedin.com/jobs/view/sports-app-android-engineer-at-yahoo-3995440759?position=14&pageNum=0&refId=AiLGlqX5PJ3wN1T1csPGaA%3D%3D&trackingId=S9zK0DOAn229bR4x72nbLQ%3D%3D",
    "description": "Yahoo Sports is one of the internet’s leading destinations for comprehensive sports news and innovative fantasy games. We produce insightful content across multiple platforms and curate quality coverage from around the web to inform and entertain fans. We're an original fantasy sports pioneer, with a legacy of innovation that helps us continue to be a fantasy leader. And as one of the most-visited sports platforms on the internet, we're one of the best places for brands to reach fans.  \n  \n**A Little About Us**  \n  \nYahoo Sports connects fans to the sports and fantasy games they love most. We are passionate about building best-in-class sports apps that deliver real-time, personalized quality content, and a superior experience to millions of sports fans worldwide. At Yahoo Sports, “Fans come first.”  \n  \n**A Lot About You**  \n  \nYou are an experienced, motivated engineer who is passionate about mobile app development and building high quality, engaging products. You thrive working as part of a team of smart, talented engineers and product designers who value efficiency, creativity, and a trusted, collaborative work environment. You are curious, driven, and enjoy challenging work.  \n  \n**Responsibilities**  \n  \n\n-   Code in Kotlin -- to help build and evolve our Sports Android App -- with an emphasis on quality, performance, testability, modularity and maintainability\n-   Collaborate with other engineers and designers to help define, build and deliver new features, and further modernize our codebase\n-   Own and deliver -- from the small must-do tasks, to larger, more complex projects with many moving parts\n-   Share your opinions on, and help drive, our technical direction, best practices, product designs/ideas, team processes, peer feedback - we value, and depend on, your input!\n\n**Minimum Qualifications**  \n  \n\n-   Solid coding chops, code design skills and grasp of software development best practices -- including mobile app development; object-oriented design; writing modular, reusable, testable code; data structures; design patterns; concurrency; performance profiling and tuning\n-   3+ years of experience in building and shipping native, production mobile apps\n-   Experience in Kotlin, Android Studio, Android Platform Tools, Jetpack, Java, git, etc – all of the skills, tools, libraries and languages needed to build and support Android apps\n-   Strong analytical, problem solving, and debugging skills\n-   The quintessential teammate – high EQ, great communicator, adaptable, supportive, hard working and enjoys a good laugh\n-   BS in Computer Science or Engineering or equivalent CS training\n-   Being a sports fan is a plus!\n\nThe material job duties and responsibilities of this role include those listed above as well as adhering to Yahoo policies; exercising sound judgment; working effectively, safely and inclusively with others; exhibiting trustworthiness and meeting expectations; and safeguarding business operations and brand integrity.  \n  \nAt Yahoo, we offer flexible hybrid work options that our employees love! While most roles don’t require regular office attendance, you may occasionally be asked to attend in-person events or team sessions. You’ll always get notice to make arrangements. Your recruiter will let you know if a specific job requires regular attendance at a Yahoo office or facility. If you have any questions about how this applies to the role, just ask the recruiter!  \n  \nYahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo will consider for employment qualified applicants with criminal histories in a manner consistent with applicable law. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call +1.866.772.3182. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response.  \n  \nWe believe that a diverse and inclusive workplace strengthens Yahoo and deepens our relationships. When you support everyone to be their best selves, they spark discovery, innovation and creativity. Among other efforts, our 11 employee resource groups (ERGs) enhance a culture of belonging with programs, events and fellowship that help educate, support and create a workplace where all feel welcome. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more.  \n  \nThe compensation for this position ranges from $111,000.00 - $231,250.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Our comprehensive benefits include healthcare, a great 401k, backup childcare, education stipends and much (much) more.  \n  \n_Currently work for Yahoo? Please apply on our internal career site.  \n  \n_"
  },
  {
    "companyName": "DysrupIT",
    "externalUrl": "https://ph.linkedin.com/jobs/view/mobile-application-developer-at-dysrupit-4137364507?position=48&pageNum=0&refId=t1vMhhcYqU2iwmCV%2FtIJJQ%3D%3D&trackingId=qgj8gYQsOm19%2FLc4rEBO7A%3D%3D",
    "description": "JOB SUMMARY:\n\nWe are seeking a skilled Mobile Application Developer proficient in both iOS and Android development. The ideal candidate will have experience working with Swift and Kotlin, utilizing UIKit for iOS and Native Android with XML for UI development. The role involves integrating AWS SES, AWS SNS, and Google Firebase for messaging, notifications, and analytics.\n\nJOB RESPONSIBILITIES:\n\n• Develop, maintain, and enhance mobile applications for both iOS and Android platforms.\n\n• Design and implement user interfaces using UIKit (iOS) and Native Android XML layouts.\n\n• Collaborate with backend teams to integrate APIs and third-party services.\n\n• Implement AWS SES for email sending and AWS SNS for SMS notifications.\n\n• Utilize Google Firebase for push notifications and basic analytics tracking.\n\n• Optimize application performance, ensure security best practices, and debug issues as needed.\n\nJOB QUALIFICATIONS:\n\n• Bachelor’s degree in Computer Science, Software Engineering, or a related field.\n\n• Proven experience developing and deploying iOS and Android applications.\n\n• Strong proficiency in Swift (UIKit) and Kotlin (Native Android with XML).\n\n• Experience with AWS services (SES, SNS) and Google Firebase.\n\n• Familiarity with RESTful APIs and mobile application architecture.\n\n• Understanding of version control systems like Git.\n\n• Strong problem-solving skills and attention to detail."
  }
]